{"ID":"1358","Name":"Weaknesses in SEI ETF Categories of Security Vulnerabilities in ICS","Type":"Graph","Status":"Incomplete","Objective":"CWE entries in this view (graph) are associated with the Categories of Security Vulnerabilities in ICS, as published by the Securing Energy Infrastructure Executive Task Force (SEI ETF) in March 2022. Weaknesses and categories in this view are focused on issues that affect ICS (Industrial Control Systems) but have not been traditionally covered by CWE in the past due to its earlier emphasis on enterprise IT software. Note: weaknesses in this view are based on \"Nearest IT Neighbor\" recommendations and other suggestions by the CWE team. These relationships are likely to change in future CWE versions.","Audience":[{"Type":"Hardware Designers","Description":"ICS/OT hardware designers can use this view to ensure a minimal set of weaknesses that should be avoided or mitigated during the design process."},{"Type":"Product Vendors","Description":"Product vendors can use this view to ensure that all aspects of the product lifecycle address these weaknesses."},{"Type":"Assessment Tool Vendors","Description":"Assessment tool vendors that help to assess potential weaknesses, or avoid them, can use this view to improve their tool's coverage to address more weaknesses."},{"Type":"Academic Researchers","Description":"Academic researchers can use this view to identify potential research opportunities that could produce better methods for detection or avoidance of weaknesses in ICS/OT products."}],"Members":[{"CWE_ID":"1359","View_ID":"1358"},{"CWE_ID":"1360","View_ID":"1358"},{"CWE_ID":"1361","View_ID":"1358"},{"CWE_ID":"1362","View_ID":"1358"},{"CWE_ID":"1363","View_ID":"1358"}],"References":[{"ExternalReferenceID":"REF-1248","Authors":["Securing Energy Infrastructure Executive Task Force (SEI ETF)"],"Title":"Categories of Security Vulnerabilities in ICS","PublicationYear":"2022","PublicationMonth":"03","PublicationDay":"09","URL":"https://inl.gov/wp-content/uploads/2022/03/SEI-ETF-NCSV-TPT-Categories-of-Security-Vulnerabilities-ICS-v1_03-09-22.pdf"}],"MappingNotes":{"Usage":"Prohibited","Rationale":"This entry is a View. Views are not weaknesses and therefore inappropriate to describe the root causes of vulnerabilities.","Comments":"Use this View or other Views to search and navigate for the appropriate weakness.","Reasons":["View"]},"Notes":[{"Type":"Relationship","Note":"Relationships in this view are not authoritative and subject to change. See Maintenance notes."},{"Type":"Maintenance","Note":"This view was created in CWE 4.7 to facilitate and illuminate discussion about weaknesses in ICS with [REF-1248] as a starting point. After the release of CWE 4.9 in October 2022, this has been under active review by members of the \"Boosting CWE\" subgroup of the CWE-CAPEC ICS/OT Special Interest Group (SIG). Relationships are still subject to change. In addition, there may be some issues in [REF-1248] that are outside of the current scope of CWE, which will require consultation with many CWE stakeholders to resolve."}],"Content_History":[{"Type":"Submission","SubmissionName":"New Categories of Security Vulnerabilities (NCSV) Technical Project Team (TPT)","SubmissionOrganization":"Securing Energy Infrastructure Executive Task Force","SubmissionDate":"2022-03-09"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Maintenance_Notes, Relationship_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}