{"ID":"1377","Name":"ICS Engineering (Construction/Deployment): Inherent Predictability in Design","Status":"Incomplete","Summary":"Weaknesses in this category are related to the \"Inherent Predictability in Design\" category from the SEI ETF \"Categories of Security Vulnerabilities in ICS\" as published in March 2022: \"The commonality of design (in ICS/SCADA architectures) for energy systems and environments opens up the possibility of scaled compromise by leveraging the inherent predictability in the design.\" Note: members of this category include \"Nearest IT Neighbor\" recommendations from the report, as well as suggestions by the CWE team. These relationships are likely to change in future CWE versions.","Relationships":[{"CweID":"1278","ViewID":"1358"}],"References":[{"ExternalReferenceID":"REF-1248"}],"MappingNotes":{"Usage":"Prohibited","Rationale":"This entry is a Category. Using categories for mapping has been discouraged since 2019. Categories are informal organizational groupings of weaknesses that can help CWE users with data aggregation, navigation, and browsing. However, they are not weaknesses in themselves.","Comments":"See member weaknesses of this category.","Reasons":["Category"]},"Notes":[{"Type":"Relationship","Note":"Relationships in this category are not authoritative and subject to change. See Maintenance notes."},{"Type":"Maintenance","Note":"This category was created in CWE 4.7 to facilitate and illuminate discussion about weaknesses in ICS with [REF-1248] as a starting point. After the release of CWE 4.9 in October 2022, this has been under active review by members of the \"Boosting CWE\" subgroup of the CWE-CAPEC ICS/OT Special Interest Group (SIG). Relationships are still subject to change. In addition, there may be some issues in [REF-1248] that are outside of the current scope of CWE, which will require consultation with many CWE stakeholders to resolve."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"New Categories of Security Vulnerabilities (NCSV) Technical Project Team (TPT)","SubmissionOrganization":"Securing Energy Infrastructure Executive Task Force","SubmissionDate":"2022-03-09","SubmissionVersion":"4.7","SubmissionReleaseDate":"2022-04-28"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description, Maintenance_Notes, Relationship_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}