{"ID":"1007","Name":"Insufficient Visual Distinction of Homoglyphs Presented to User","Abstraction":"Base","Structure":"Simple","Status":"Incomplete","Description":"The product displays information or identifiers to a user, but the display mechanism does not make it easy for the user to distinguish between visually similar or identical glyphs (homoglyphs), which may cause the user to misinterpret a glyph and perform an unintended, insecure action.","ExtendedDescription":"\n\nSome glyphs, pictures, or icons can be semantically distinct to a program, while appearing very similar or identical to a human user. These are referred to as homoglyphs. For example, the lowercase \"l\" (ell) and uppercase \"I\" (eye) have different character codes, but these characters can be displayed in exactly the same way to a user, depending on the font. This can also occur between different character sets. For example, the Latin capital letter \"A\" and the Greek capital letter \"Α\" (Alpha) are treated as distinct by programs, but may be displayed in exactly the same way to a user. Accent marks may also cause letters to appear very similar, such as the Latin capital letter grave mark \"À\" and its equivalent \"Á\" with the acute accent.\n\n\nAdversaries can exploit this visual similarity for attacks such as phishing, e.g. by providing a link to an attacker-controlled hostname that looks like a hostname that the victim trusts. In a different use of homoglyphs, an adversary may create a back door username that is visually similar to the username of a regular user, which then makes it more difficult for a system administrator to detect the malicious username while reviewing logs.\n","LikelihoodOfExploit":"Medium","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"451","ViewID":"1000","Ordinal":"Primary"}],"WeaknessOrdinalities":[{"Ordinality":"Resultant"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Web Based","Prevalence":"Sometimes"}],"AlternateTerms":[{"Term":"Homograph Attack","Description":"\"Homograph\" is often used as a synonym of \"homoglyph\" by researchers, but according to Wikipedia, a homograph is a word that has multiple, distinct meanings."}],"ModesOfIntroduction":[{"Phase":"Architecture and Design","Note":"This weakness may occur when characters from various character sets are allowed to be interchanged within a URL, username, email address, etc. without any notification to the user or underlying system being used."},{"Phase":"Implementation"}],"CommonConsequences":[{"Scope":["Integrity","Confidentiality"],"Impact":["Other"],"Note":"An attacker may ultimately redirect a user to a malicious website, by deceiving the user into believing the URL they are accessing is a trusted domain. However, the attack can also be used to forge log entries by using homoglyphs in usernames. Homoglyph manipulations are often the first step towards executing advanced attacks such as stealing a user's credentials, Cross-Site Scripting (XSS), or log forgery. If an attacker redirects a user to a malicious site, the attacker can mimic a trusted domain to steal account credentials and perform actions on behalf of the user, without the user's knowledge. Similarly, an attacker could create a username for a website that contains homoglyph characters, making it difficult for an admin to review logs and determine which users performed which actions."}],"DetectionMethods":[{"Method":"Manual Dynamic Analysis","Description":"If utilizing user accounts, attempt to submit a username that contains homoglyphs. Similarly, check to see if links containing homoglyphs can be sent via email, web browsers, or other mechanisms.","Effectiveness":"Moderate"}],"PotentialMitigations":[{"Phase":["Implementation"],"Description":"\n\nUse a browser that displays Punycode for IDNs in the URL and status bars, or which color code various scripts in URLs.\n\n\nDue to the prominence of homoglyph attacks, several browsers now help safeguard against this attack via the use of Punycode. For example, Mozilla Firefox and Google Chrome will display IDNs as Punycode if top-level domains do not restrict which characters can be used in domain names or if labels mix scripts for different languages.\n"},{"Phase":["Implementation"],"Description":"\n\nUse an email client that has strict filters and prevents messages that mix character sets to end up in a user's inbox.\n\n\nCertain email clients such as Google's GMail prevent the use of non-Latin characters in email addresses or in links contained within emails. This helps prevent homoglyph attacks by flagging these emails and redirecting them to a user's spam folder.\n"}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"The following looks like a simple, trusted URL that a user may frequently access."},{"Nature":"Attack","ExampleCode":"```\n\thttp://www.еxаmрlе.соm\n```"},{"BodyText":"However, the URL above is comprised of Cyrillic characters that look identical to the expected ASCII characters. This results in most users not being able to distinguish between the two and assuming that the above URL is trusted and safe. The \"e\" is actually the \"CYRILLIC SMALL LETTER IE\" which is represented in HTML as the character \u0026#x435, while the \"a\" is actually the \"CYRILLIC SMALL LETTER A\" which is represented in HTML as the character \u0026#x430. The \"p\", \"c\", and \"o\" are also Cyrillic characters in this example. Viewing the source reveals a URL of \"http://www.\u0026#x435;x\u0026#x430;m\u0026#x440;l\u0026#x435;.\u0026#x441;\u0026#x43e;m\". An adversary can utilize this approach to perform an attack such as a phishing attack in order to drive traffic to a malicious website."}]},{"Entries":[{"IntroText":"The following displays an example of how creating usernames containing homoglyphs can lead to log forgery."},{"BodyText":"Assume an adversary visits a legitimate, trusted domain and creates an account named \"admin\", except the 'a' and 'i' characters are Cyrillic characters instead of the expected ASCII. Any actions the adversary performs will be saved to the log file and look like they came from a legitimate administrator account."},{"Nature":"Result","ExampleCode":"```\n\t123.123.123.123 аdmіn [17/Jul/2017:09:05:49 -0400] \"GET /example/users/userlist HTTP/1.1\" 401 12846\n\t 123.123.123.123 аdmіn [17/Jul/2017:09:06:51 -0400] \"GET /example/users/userlist HTTP/1.1\" 200 4523\n\t 123.123.123.123 admin [17/Jul/2017:09:10:02 -0400] \"GET /example/users/editusers HTTP/1.1\" 200 6291\n\t 123.123.123.123 аdmіn [17/Jul/2017:09:10:02 -0400] \"GET /example/users/editusers HTTP/1.1\" 200 6291\n```"},{"BodyText":"Upon closer inspection, the account that generated three of these log entries is \"\u0026#x430;dm\u0026#x456;n\". Only the third log entry is by the legitimate admin account. This makes it more difficult to determine which actions were performed by the adversary and which actions were executed by the legitimate \"admin\" account."}]}],"ObservedExamples":[{"Reference":"CVE-2013-7236","Description":"web forum allows impersonation of users with homoglyphs in account names","Link":"https://www.cve.org/CVERecord?id=CVE-2013-7236"},{"Reference":"CVE-2012-0584","Description":"Improper character restriction in URLs in web browser","Link":"https://www.cve.org/CVERecord?id=CVE-2012-0584"},{"Reference":"CVE-2009-0652","Description":"Incomplete denylist does not include homoglyphs of \"/\" and \"?\" characters in URLs","Link":"https://www.cve.org/CVERecord?id=CVE-2009-0652"},{"Reference":"CVE-2017-5015","Description":"web browser does not convert hyphens to punycode, allowing IDN spoofing in URLs","Link":"https://www.cve.org/CVERecord?id=CVE-2017-5015"},{"Reference":"CVE-2005-0233","Description":"homoglyph spoofing using punycode in URLs and certificates","Link":"https://www.cve.org/CVERecord?id=CVE-2005-0233"},{"Reference":"CVE-2005-0234","Description":"homoglyph spoofing using punycode in URLs and certificates","Link":"https://www.cve.org/CVERecord?id=CVE-2005-0234"},{"Reference":"CVE-2005-0235","Description":"homoglyph spoofing using punycode in URLs and certificates","Link":"https://www.cve.org/CVERecord?id=CVE-2005-0235"}],"RelatedAttackPatterns":["632"],"References":[{"ExternalReferenceID":"REF-7","Section":"Chapter 11, \"Canonical Representation Issues\", Page 382","Authors":["Michael Howard","David LeBlanc"],"Title":"Writing Secure Code","Edition":"2nd Edition","PublicationYear":"2002","PublicationMonth":"12","PublicationDay":"04","Publisher":"Microsoft Press","URL":"https://www.microsoftpressstore.com/store/writing-secure-code-9780735617223"},{"ExternalReferenceID":"REF-8","Authors":["Gregory Baatard","Peter Hannay"],"Title":"The 2011 IDN Homograph Attack Mitigation Survey","PublicationYear":"2012","Publisher":"ECU Publications","URL":"http://ro.ecu.edu.au/cgi/viewcontent.cgi?article=1174\u0026context=ecuworks2012"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2017-07-24","SubmissionVersion":"2.12","SubmissionReleaseDate":"2017-11-08"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2018-03-27","ModificationComment":"updated Demonstrative_Examples, Description, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated Demonstrative_Examples, Description, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Applicable_Platforms, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-06-25","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Demonstrative_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Demonstrative_Examples, Description, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}