{"ID":"1038","Name":"Insecure Automated Optimizations","Abstraction":"Class","Structure":"Simple","Status":"Draft","Description":"The product uses a mechanism that automatically optimizes code, e.g. to improve a characteristic such as performance, but the optimizations can have an unintended side effect that might violate an intended security assumption.","LikelihoodOfExploit":"Low","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"435","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"758","ViewID":"1000"}],"WeaknessOrdinalities":[{"Ordinality":"Primary","Description":"This weakness does not depend on other weaknesses and is the result of choices made during optimization."}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"}],"ModesOfIntroduction":[{"Phase":"Architecture and Design","Note":"Optimizations built into the design of a product can have unintended consequences during execution."}],"CommonConsequences":[{"Scope":["Integrity"],"Impact":["Alter Execution Logic"],"Note":"The optimizations alter the order of execution resulting in side effects that were not intended by the original developer."}],"DemonstrativeExamples":[{"ID":"DX-200","Entries":[{"IntroText":"The following code reads a password from the user, uses the password to connect to a back-end mainframe, and then attempts to scrub the password from memory using memset()."},{"Nature":"Bad","Language":"C","ExampleCode":"void GetData(char *MFAddr) { \n```\n\t char pwd[64];\n\t if (GetPasswordFromUser(pwd, sizeof(pwd))) { \n\t\t if (ConnectToMainframe(MFAddr, pwd)) { \n```\n// Interaction with mainframe*  }  }\n\t memset(pwd, 0, sizeof(pwd));  }"},{"BodyText":"The code in the example will behave correctly if it is executed verbatim, but if the code is compiled using an optimizing compiler, then the call to memset() might be removed as a dead store, because the buffer pwd is not used after its value is overwritten. Because the buffer pwd contains a sensitive value, the application may be vulnerable to attack if the data are left memory resident. If attackers are able to access the correct region of memory, they may use the recovered password to gain control of the system."},{"BodyText":"It is common practice to overwrite sensitive data manipulated in memory, such as passwords or cryptographic keys, in order to prevent attackers from learning system secrets. However, with the advent of optimizing compilers, programs do not always behave as their source code alone would suggest. In the example, the compiler interprets the call to memset() as dead code because the memory being written to is not subsequently used, despite the fact that there is clearly a security motivation for the operation to occur. The problem here is that many compilers, and in fact many programming languages, do not take this and other security concerns into consideration in their efforts to improve efficiency."},{"BodyText":"Attackers typically exploit this type of vulnerability by using a core dump or runtime mechanism to access the memory used by a particular application and recover the secret information. Once an attacker has access to the secret information, it is relatively straightforward to further exploit the system and possibly compromise other resources with which the application interacts."}]}],"ObservedExamples":[{"Reference":"CVE-2017-5715","Description":"Intel, ARM, and AMD processor optimizations related to speculative execution and branch prediction cause access control checks to be bypassed when placing data into the cache. Often known as \"Spectre\".","Link":"https://www.cve.org/CVERecord?id=CVE-2017-5715"},{"Reference":"CVE-2008-1685","Description":"C compiler optimization, as allowed by specifications, removes code that is used to perform checks to detect integer overflows.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-1685"}],"MappingNotes":{"Usage":"Allowed-with-Review","Rationale":"This CWE entry is a Class and might have Base-level children that would be more appropriate","Comments":"Examine children of this entry to see if there is a better fit","Reasons":["Abstraction"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2018-03-07","SubmissionVersion":"3.1","SubmissionReleaseDate":"2018-03-29"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-10-26","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-12-11","ModificationComment":"updated Demonstrative_Examples","ModificationVersion":"4.19","ModificationReleaseDate":"2025-12-11"}]}