{"ID":"116","Name":"Improper Encoding or Escaping of Output","Abstraction":"Class","Structure":"Simple","Status":"Draft","Description":"The product prepares a structured message for communication with another component, but encoding or escaping of the data is either missing or done incorrectly. As a result, the intended structure of the message is not preserved.","ExtendedDescription":"\n\nImproper encoding or escaping can allow attackers to change the commands that are sent to another component, inserting malicious commands instead.\n\n\nMost products follow a certain protocol that uses structured messages for communication between components, such as queries or commands. These structured messages can contain raw data interspersed with metadata or control information. For example, \"GET /index.html HTTP/1.1\" is a structured message containing a command (\"GET\") with a single argument (\"/index.html\") and metadata about which protocol version is being used (\"HTTP/1.1\").\n\n\nIf an application uses attacker-supplied inputs to construct a structured message without properly encoding or escaping, then the attacker could insert special characters that will cause the data to be interpreted as control information or metadata. Consequently, the component that receives the output will perform the wrong operations, or otherwise interpret the data incorrectly.\n","LikelihoodOfExploit":"High","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"707","ViewID":"1000","Ordinal":"Primary"},{"Nature":"CanPrecede","CweID":"74","ViewID":"1000"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Often"},{"Type":"Technology","Name":"AI/ML","Prevalence":"Undetermined"},{"Type":"Technology","Name":"Database Server","Prevalence":"Often"},{"Type":"Technology","Name":"Web Server","Prevalence":"Often"}],"AlternateTerms":[{"Term":"Output Sanitization"},{"Term":"Output Validation"},{"Term":"Output Encoding"}],"ModesOfIntroduction":[{"Phase":"Implementation"},{"Phase":"Operation"}],"CommonConsequences":[{"Scope":["Integrity"],"Impact":["Modify Application Data"],"Note":"The communications between components can be modified in unexpected ways. Unexpected commands can be executed, bypassing other security mechanisms. Incoming data can be misinterpreted."},{"Scope":["Integrity","Confidentiality","Availability","Access Control"],"Impact":["Execute Unauthorized Code or Commands"],"Note":"The communications between components can be modified in unexpected ways. Unexpected commands can be executed, bypassing other security mechanisms. Incoming data can be misinterpreted."},{"Scope":["Confidentiality"],"Impact":["Bypass Protection Mechanism"],"Note":"The communications between components can be modified in unexpected ways. Unexpected commands can be executed, bypassing other security mechanisms. Incoming data can be misinterpreted."}],"DetectionMethods":[{"DetectionMethodID":"DM-1","Method":"Automated Static Analysis","Description":"This weakness can often be detected using automated static analysis tools. Many modern tools use data flow analysis or constraint-based techniques to minimize the number of false positives.","Effectiveness":"Moderate","EffectivenessNotes":"This is not a perfect solution, since 100% accuracy and coverage are not feasible."},{"DetectionMethodID":"DM-2","Method":"Automated Dynamic Analysis","Description":"This weakness can be detected using dynamic tools and techniques that interact with the software using large test suites with many diverse inputs, such as fuzz testing (fuzzing), robustness testing, and fault injection. The software's operation may slow down, but it should not become unstable, crash, or generate incorrect results."}],"PotentialMitigations":[{"MitigationID":"MIT-4.3","Phase":["Architecture and Design"],"Strategy":"Libraries or Frameworks","Description":"\n\nUse a vetted library or framework that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid.\n\n\nFor example, consider using the ESAPI Encoding control [REF-45] or a similar tool, library, or framework. These will help the programmer encode outputs in a manner less prone to error.\n\n\nAlternately, use built-in functions, but consider using wrappers in case those functions are discovered to have a vulnerability.\n"},{"MitigationID":"MIT-27","Phase":["Architecture and Design"],"Strategy":"Parameterization","Description":"\n\nIf available, use structured mechanisms that automatically enforce the separation between data and code. These mechanisms may be able to provide the relevant quoting, encoding, and validation automatically, instead of relying on the developer to provide this capability at every point where output is generated.\n\n\nFor example, stored procedures can enforce database query structure and reduce the likelihood of SQL injection.\n"},{"Phase":["Architecture and Design","Implementation"],"Description":"Understand the context in which your data will be used and the encoding that will be expected. This is especially important when transmitting data between different components, or when generating outputs that can contain multiple encodings at the same time, such as web pages or multi-part mail messages. Study all expected communication protocols and data representations to determine the required encoding strategies."},{"Phase":["Architecture and Design"],"Description":"In some cases, input validation may be an important strategy when output encoding is not a complete solution. For example, you may be providing the same output that will be processed by multiple consumers that use different encodings or representations. In other cases, you may be required to allow user-supplied input to contain control information, such as limited HTML tags that support formatting in a wiki or bulletin board. When this type of requirement must be met, use an extremely strict allowlist to limit which control sequences can be used. Verify that the resulting syntactic structure is what you expect. Use your normal encoding methods for the remainder of the input."},{"Phase":["Architecture and Design"],"Description":"Use input validation as a defense-in-depth measure to reduce the likelihood of output encoding errors (see CWE-20)."},{"Phase":["Requirements"],"Description":"Fully specify which encodings are required by components that will be communicating with each other."},{"Phase":["Implementation"],"Description":"When exchanging data between components, ensure that both components are using the same character encoding. Ensure that the proper encoding is applied at each interface. Explicitly set the encoding you are using whenever the protocol allows you to do so."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"This code displays an email address that was submitted as part of a form."},{"Nature":"Bad","Language":"JSP","ExampleCode":"```\n\t\u003c% String email = request.getParameter(\"email\"); %\u003e\n\t...\n\tEmail Address: \u003c%= email %\u003e\n```"},{"BodyText":"The value read from the form parameter is reflected back to the client browser without having been encoded prior to output, allowing various XSS attacks (CWE-79)."}]},{"Entries":[{"IntroText":"Consider a chat application in which a front-end web application communicates with a back-end server. The back-end is legacy code that does not perform authentication or authorization, so the front-end must implement it. The chat protocol supports two commands, SAY and BAN, although only administrators can use the BAN command. Each argument must be separated by a single space. The raw inputs are URL-encoded. The messaging protocol allows multiple commands to be specified on the same line if they are separated by a \"|\" character."},{"BodyText":"First let's look at the back end command processor code"},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\t$inputString = readLineFromFileHandle($serverFH);\n```\n# generate an array of strings separated by the \"|\" character.* \n\t@commands = split(/\\|/, $inputString);\n\t\n\tforeach $cmd (@commands) {\n\t```\n```\n# separate the operator from its arguments based on a single whitespace* \n\t\t($operator, $args) = split(/ /, $cmd, 2);\n\t\t\n\t\t$args = UrlDecode($args);\n\t\tif ($operator eq \"BAN\") {\n\t\t```\n\t\t\tExecuteBan($args);\n\t\t}\n\t\telsif ($operator eq \"SAY\") {\n\t\t\tExecuteSay($args);\n\t\t}\n\t}\n```"},{"BodyText":"The front end web application receives a command, encodes it for sending to the server, performs the authorization check, and sends the command to the server."},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\t$inputString = GetUntrustedArgument(\"command\");\n\t($cmd, $argstr) = split(/\\s+/, $inputString, 2);\n```\n# removes extra whitespace and also changes CRLF's to spaces* \n\t$argstr =~ s/\\s+/ /gs;\n\t\n\t$argstr = UrlEncode($argstr);\n\tif (($cmd eq \"BAN\") \u0026\u0026 (! IsAdministrator($username))) {\n\t```\n\t\tdie \"Error: you are not the admin.\\n\";\n\t}\n```\n# communicate with file server using a file handle* \n\t$fh = GetServerFileHandle(\"myserver\");\n\t\n\tprint $fh \"$cmd $argstr\\n\";"},{"BodyText":"It is clear that, while the protocol and back-end allow multiple commands to be sent in a single request, the front end only intends to send a single command. However, the UrlEncode function could leave the \"|\" character intact. If an attacker provides:"},{"Nature":"Attack","ExampleCode":"```\n\tSAY hello world|BAN user12\n```"},{"BodyText":"then the front end will see this is a \"SAY\" command, and the $argstr will look like \"hello world | BAN user12\". Since the command is \"SAY\", the check for the \"BAN\" command will fail, and the front end will send the URL-encoded command to the back end:"},{"Nature":"Result","ExampleCode":"```\n\tSAY hello%20world|BAN%20user12\n```"},{"BodyText":"The back end, however, will treat these as two separate commands:"},{"Nature":"Result","ExampleCode":"```\n\tSAY hello world\n\tBAN user12\n```"},{"BodyText":"Notice, however, that if the front end properly encodes the \"|\" with \"%7C\", then the back end will only process a single command."}]},{"Entries":[{"IntroText":"This example takes user input, passes it through an encoding scheme and then creates a directory specified by the user."},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\tsub GetUntrustedInput {\n\t\treturn($ARGV[0]);\n\t}\n\tsub encode {\n\t\tmy($str) = @_;\n\t\t$str =~ s/\\\u0026/\\\u0026amp;/gs;\n\t\t$str =~ s/\\\"/\\\u0026quot;/gs;\n\t\t$str =~ s/\\'/\\\u0026apos;/gs;\n\t\t$str =~ s/\\\u003c/\\\u0026lt;/gs;\n\t\t$str =~ s/\\\u003e/\\\u0026gt;/gs;\n\t\treturn($str);\n\t}\n\tsub doit {\n\t\tmy $uname = encode(GetUntrustedInput(\"username\"));\n\t\tprint \"\u003cb\u003eWelcome, $uname!\u003c/b\u003e\u003cp\u003e\\n\";\n\t\tsystem(\"cd /home/$uname; /bin/ls -l\");\n\t}\n```"},{"BodyText":"The programmer attempts to encode dangerous characters, however the denylist for encoding is incomplete (CWE-184) and an attacker can still pass a semicolon, resulting in a chain with command injection (CWE-77)."},{"BodyText":"Additionally, the encoding routine is used inappropriately with command execution. An attacker doesn't even need to insert their own semicolon. The attacker can instead leverage the encoding routine to provide the semicolon to separate the commands. If an attacker supplies a string of the form:"},{"Nature":"Attack","ExampleCode":"```\n\t' pwd\n```"},{"BodyText":"then the program will encode the apostrophe and insert the semicolon, which functions as a command separator when passed to the system function. This allows the attacker to complete the command injection."}]}],"ObservedExamples":[{"Reference":"CVE-2021-41232","Description":"Chain: authentication routine in Go-based agile development product does not escape user name (CWE-116), allowing LDAP injection (CWE-90)","Link":"https://www.cve.org/CVERecord?id=CVE-2021-41232"},{"Reference":"CVE-2008-4636","Description":"OS command injection in backup software using shell metacharacters in a filename; correct behavior would require that this filename could not be changed.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-4636"},{"Reference":"CVE-2008-0769","Description":"Web application does not set the charset when sending a page to a browser, allowing for XSS exploitation when a browser chooses an unexpected encoding.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-0769"},{"Reference":"CVE-2008-0005","Description":"Program does not set the charset when sending a page to a browser, allowing for XSS exploitation when a browser chooses an unexpected encoding.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-0005"},{"Reference":"CVE-2008-5573","Description":"SQL injection via password parameter; a strong password might contain \"\u0026\"","Link":"https://www.cve.org/CVERecord?id=CVE-2008-5573"},{"Reference":"CVE-2008-3773","Description":"Cross-site scripting in chat application via a message subject, which normally might contain \"\u0026\" and other XSS-related characters.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-3773"},{"Reference":"CVE-2008-0757","Description":"Cross-site scripting in chat application via a message, which normally might be allowed to contain arbitrary content.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-0757"}],"TaxonomyMappings":[{"TaxonomyName":"WASC","EntryID":"22","EntryName":"Improper Output Handling"},{"TaxonomyName":"The CERT Oracle Secure Coding Standard for Java (2011)","EntryID":"IDS00-J","EntryName":"Sanitize untrusted data passed across a trust boundary","MappingFit":"Exact"},{"TaxonomyName":"The CERT Oracle Secure Coding Standard for Java (2011)","EntryID":"IDS05-J","EntryName":"Use a subset of ASCII for file and path names"},{"TaxonomyName":"SEI CERT Oracle Coding Standard for Java","EntryID":"IDS00-J","EntryName":"Prevent SQL injection","MappingFit":"Imprecise"},{"TaxonomyName":"SEI CERT Perl Coding Standard","EntryID":"IDS33-PL","EntryName":"Sanitize untrusted data passed across a trust boundary","MappingFit":"Exact"}],"RelatedAttackPatterns":["104","73","81","85"],"References":[{"ExternalReferenceID":"REF-45","Authors":["OWASP"],"Title":"OWASP Enterprise Security API (ESAPI) Project","URL":"https://owasp.org/www-project-enterprise-security-api/","URLDate":"2025-07-24"},{"ExternalReferenceID":"REF-46","Authors":["Joshbw"],"Title":"Output Sanitization","PublicationYear":"2008","PublicationMonth":"09","PublicationDay":"18","URL":"https://web.archive.org/web/20081208054333/http://analyticalengine.net/archives/58","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-47","Authors":["Niyaz PK"],"Title":"Sanitizing user data: How and where to do it","PublicationYear":"2008","PublicationMonth":"09","PublicationDay":"11","URL":"https://web.archive.org/web/20090105222005/http://www.diovo.com/2008/09/sanitizing-user-data-how-and-where-to-do-it/","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-48","Authors":["Jeremiah Grossman"],"Title":"Input validation or output filtering, which is better?","PublicationYear":"2007","PublicationMonth":"01","PublicationDay":"30","URL":"https://blog.jeremiahgrossman.com/2007/01/input-validation-or-output-filtering.html","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-49","Authors":["Jim Manico"],"Title":"Input Validation - Not That Important","PublicationYear":"2008","PublicationMonth":"08","PublicationDay":"10","URL":"https://manicode.blogspot.com/2008/08/input-validation-not-that-important.html","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-50","Authors":["Michael Eddington"],"Title":"Preventing XSS with Correct Output Encoding","URL":"http://phed.org/2008/05/19/preventing-xss-with-correct-output-encoding/"},{"ExternalReferenceID":"REF-7","Section":"Chapter 11, \"Canonical Representation Issues\" Page 363","Authors":["Michael Howard","David LeBlanc"],"Title":"Writing Secure Code","Edition":"2nd Edition","PublicationYear":"2002","PublicationMonth":"12","PublicationDay":"04","Publisher":"Microsoft Press","URL":"https://www.microsoftpressstore.com/store/writing-secure-code-9780735617223"}],"MappingNotes":{"Usage":"Allowed-with-Review","Rationale":"This CWE entry is a Class and might have Base-level children that would be more appropriate","Comments":"Examine children of this entry to see if there is a better fit","Reasons":["Abstraction"]},"Notes":[{"Type":"Relationship","Note":"This weakness is primary to all weaknesses related to injection (CWE-74) since the inherent nature of injection involves the violation of structured messages."},{"Type":"Relationship","Note":"\n\nCWE-116 and CWE-20 have a close association because, depending on the nature of the structured message, proper input validation can indirectly prevent special characters from changing the meaning of a structured message. For example, by validating that a numeric ID field should only contain the 0-9 characters, the programmer effectively prevents injection attacks.\n\n\nHowever, input validation is not always sufficient, especially when less stringent data types must be supported, such as free-form text. Consider a SQL injection scenario in which a last name is inserted into a query. The name \"O'Reilly\" would likely pass the validation step since it is a common last name in the English language. However, it cannot be directly inserted into the database because it contains the \"'\" apostrophe character, which would need to be escaped or otherwise neutralized. In this case, stripping the apostrophe might reduce the risk of SQL injection, but it would produce incorrect behavior because the wrong name would be recorded.\n"},{"Type":"Terminology","Note":"The usage of the \"encoding\" and \"escaping\" terms varies widely. For example, in some programming languages, the terms are used interchangeably, while other languages provide APIs that use both terms for different tasks. This overlapping usage extends to the Web, such as the \"escape\" JavaScript function whose purpose is stated to be encoding. The concepts of encoding and escaping predate the Web by decades. Given such a context, it is difficult for CWE to adopt a consistent vocabulary that will not be misinterpreted by some constituency."},{"Type":"Theoretical","Note":"This is a data/directive boundary error in which data boundaries are not sufficiently enforced before it is sent to a different control sphere."},{"Type":"Research Gap","Note":"While many published vulnerabilities are related to insufficient output encoding, there is such an emphasis on input validation as a protection mechanism that the underlying causes are rarely described. Within CVE, the focus is primarily on well-understood issues like cross-site scripting and SQL injection. It is likely that this weakness frequently occurs in custom protocols that support multiple encodings, which are not necessarily detectable with automated techniques."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Community","SubmissionDate":"2006-07-19","SubmissionComment":"Submitted by members of the CWE community to extend early CWE versions","SubmissionVersion":"Draft 3","SubmissionReleaseDate":"2006-07-19"},{"Type":"Modification","ModificationName":"Sean Eidemiller","ModificationOrganization":"Cigital","ModificationDate":"2008-07-01","ModificationComment":"added/updated demonstrative examples"},{"Type":"Modification","ModificationName":"Eric Dalci","ModificationOrganization":"Cigital","ModificationDate":"2008-07-01","ModificationComment":"updated Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2008-09-08","ModificationComment":"updated Name, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-01-12","ModificationComment":"updated Alternate_Terms, Applicable_Platforms, Common_Consequences, Demonstrative_Examples, Description, Likelihood_of_Exploit, Name, Observed_Examples, Potential_Mitigations, References, Relationship_Notes, Relationships, Research_Gaps, Terminology_Notes, Theoretical_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-03-10","ModificationComment":"updated Description, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-05-27","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-07-27","ModificationComment":"updated Demonstrative_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-10-29","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-12-28","ModificationComment":"updated Demonstrative_Examples, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-02-16","ModificationComment":"updated Detection_Factors, Potential_Mitigations, References, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-04-05","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-03-29","ModificationComment":"updated Relationship_Notes, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-09-13","ModificationComment":"updated Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated References, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-10-30","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-06-23","ModificationComment":"updated References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Demonstrative_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2015-12-07","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-01-19","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-05-03","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Applicable_Platforms, Common_Consequences, Demonstrative_Examples, Likelihood_of_Exploit, References, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2018-03-27","ModificationComment":"updated References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-06-25","ModificationComment":"updated Applicable_Platforms, Demonstrative_Examples, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-03-15","ModificationComment":"updated Relationships, Terminology_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-10-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated References, Relationships, Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-07-16","ModificationComment":"updated Applicable_Platforms","ModificationVersion":"4.15","ModificationReleaseDate":"2024-07-16"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-09-09","ModificationComment":"updated References","ModificationVersion":"4.18","ModificationReleaseDate":"2025-09-09"},{"Type":"Rename","PreviousEntryName":"Output Validation","Date":"2008-04-11"},{"Type":"Rename","PreviousEntryName":"Incorrect Output Sanitization","Date":"2008-09-09"},{"Type":"Rename","PreviousEntryName":"Insufficient Output Sanitization","Date":"2009-01-12"}]}