{"ID":"1248","Name":"Semiconductor Defects in Hardware Logic with Security-Sensitive Implications","Abstraction":"Base","Structure":"Simple","Status":"Incomplete","Description":"The security-sensitive hardware module contains semiconductor defects.","ExtendedDescription":"\n\nA semiconductor device can fail for various reasons. While some are manufacturing and packaging defects, the rest are due to prolonged use or usage under extreme conditions. Some mechanisms that lead to semiconductor defects include encapsulation failure, die-attach failure, wire-bond failure, bulk-silicon defects, oxide-layer faults, aluminum-metal faults (including electromigration, corrosion of aluminum, etc.), and thermal/electrical stress. These defects manifest as faults on chip-internal signals or registers, have the effect of inputs, outputs, or intermediate signals being always 0 or always 1, and do not switch as expected. If such faults occur in security-sensitive hardware modules, the security objectives of the hardware module may be compromised.\n","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"693","ViewID":"1000","Ordinal":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Operating_System","Class":"Not OS-Specific","Prevalence":"Undetermined"},{"Type":"Architecture","Class":"Not Architecture-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Not Technology-Specific","Prevalence":"Undetermined"}],"ModesOfIntroduction":[{"Phase":"Manufacturing","Note":"May be introduced due to issues in the manufacturing environment or improper handling of components, for example."},{"Phase":"Operation","Note":"May be introduced by improper handling or usage outside of rated operating environments (temperature, humidity, etc.)"}],"CommonConsequences":[{"Scope":["Availability","Access Control"],"Impact":["DoS: Instability"]}],"PotentialMitigations":[{"Phase":["Testing"],"Description":"\n\nWhile semiconductor-manufacturing companies implement several mechanisms to continuously improve the semiconductor manufacturing process to ensure reduction of defects, some defects can only be fixed after manufacturing. Post-manufacturing testing of silicon die is critical. Fault models such as stuck-at-0 or stuck-at-1 must be used to develop post-manufacturing test cases and achieve good coverage. Once the silicon packaging is done, extensive post-silicon testing must be performed to ensure that hardware logic implementing security functionalities is defect-free.\n"},{"Phase":["Operation"],"Description":"\n\nOperating the hardware outside device specification, such as at extremely high temperatures, voltage, etc., accelerates semiconductor degradation and results in defects. When these defects manifest as faults in security-critical, hardware modules, it results in compromise of security guarantees. Thus, operating the device within the specification is important.\n"}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"The network-on-chip implements a firewall for access control to peripherals from all IP cores capable of mastering transactions."},{"Nature":"Bad","Language":"Other","ExampleCode":"```\n\tA manufacturing defect in this logic manifests itself as a logical fault, which always sets the output of the filter to \"allow\" access.\n```"},{"BodyText":"Post-manufacture testing must be performed to ensure that hardware logic implementing security functionalities is defect-free."}]}],"RelatedAttackPatterns":["624","625"],"References":[{"ExternalReferenceID":"REF-1067","Authors":["Brian Bailey"],"Title":"Why Chips Die","URL":"https://semiengineering.com/why-chips-die/"},{"ExternalReferenceID":"REF-1068","Authors":["V. Lakshminarayan"],"Title":"What causes semiconductor devices to fail","URL":"Original","URLDate":"2023-04-07"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"Arun Kanuparthi, Hareesh Khattri, Parbati Kumar Manna, Narasimha Kumar V Mangipudi","SubmissionOrganization":"Intel Corporation","SubmissionDate":"2020-02-12","SubmissionVersion":"4.0","SubmissionReleaseDate":"2020-02-24"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Modes_of_Introduction, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-06-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Description, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}