{"ID":"1265","Name":"Unintended Reentrant Invocation of Non-reentrant Code Via Nested Calls","Abstraction":"Base","Structure":"Simple","Status":"Draft","Description":"During execution of non-reentrant code, the product performs a call that unintentionally produces a nested invocation of the non-reentrant code.","ExtendedDescription":"In a complex product, a single function call may lead to many different possible code paths, some of which may involve deeply nested calls. It may be difficult to foresee all possible code paths that could emanate from a given function call. In some systems, an external actor can manipulate inputs to the system and thereby achieve a wide range of possible control flows. This is frequently a concern in products that execute scripts from untrusted sources. Examples of such products are web browsers and PDF readers. A weakness is present when one of the possible code paths resulting from a function call alters program state that the original caller assumes to be unchanged during the call.","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"691","ViewID":"1000","Ordinal":"Primary"},{"Nature":"PeerOf","CweID":"663","ViewID":"1000"},{"Nature":"CanPrecede","CweID":"416","ViewID":"1000"}],"WeaknessOrdinalities":[{"Ordinality":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"}],"CommonConsequences":[{"Scope":["Integrity"],"Impact":["Unexpected State"],"Likelihood":["Unknown"],"Note":"Exploitation of this weakness can leave the application in an unexpected state and cause variables to be reassigned before the first invocation has completed. This may eventually result in memory corruption or unexpected code execution."}],"PotentialMitigations":[{"Phase":["Architecture and Design"],"Description":"When architecting a system that will execute untrusted code in response to events, consider executing the untrusted event handlers asynchronously (asynchronous message passing) as opposed to executing them synchronously at the time each event fires. The untrusted code should execute at the start of the next iteration of the thread's message loop. In this way, calls into non-reentrant code are strictly serialized, so that each operation completes fully before the next operation begins. Special attention must be paid to all places where type coercion may result in script execution. Performing all needed coercions at the very beginning of an operation can help reduce the chance of operations executing at unexpected junctures.","Effectiveness":"High"},{"Phase":["Implementation"],"Description":"Make sure the code (e.g., function or class) in question is reentrant by not leveraging non-local data, not modifying its own code, and not calling other non-reentrant code.","Effectiveness":"High"}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"The implementation of the Widget class in the following C++ code is an example of code that is not designed to be reentrant. If an invocation of a method of Widget inadvertently produces a second nested invocation of a method of Widget, then data member backgroundImage may unexpectedly change during execution of the outer call."},{"Nature":"Bad","Language":"C++","ExampleCode":"```\n\tclass Widget\n\t{\n\t\tprivate:\n\t\t\tImage* backgroundImage;\n\t\tpublic:\n\t\t\tvoid click()\n\t\t\t{\n\t\t\t\tif (backgroundImage)\n\t\t\t\t{\n\t\t\t\t\tbackgroundImage-\u003eclick();\n\t\t\t\t}\n\t\t\t}\n\t\t\tvoid changeBackgroundImage(Image* newImage)\n\t\t\t{\n\t\t\t\tif (backgroundImage)\n\t\t\t\t{\n\t\t\t\t\tdelete backgroundImage;\n\t\t\t\t}\n\t\t\t\tbackgroundImage = newImage;\n\t\t\t}\n\t}\n\tclass Image\n\t{\n\t\tpublic:\n\t\t\tvoid click()\n\t\t\t{\n\t\t\t\tscriptEngine-\u003efireOnImageClick();\n\t\t\t\t/* perform some operations using \"this\" pointer */\n\t\t\t}\n\t}\n```"},{"BodyText":"Looking closer at this example, Widget::click() calls backgroundImage-\u003eclick(), which in turn calls scriptEngine-\u003efireOnImageClick(). The code within fireOnImageClick() invokes the appropriate script handler routine as defined by the document being rendered. In this scenario this script routine is supplied by an adversary and this malicious script makes a call to Widget::changeBackgroundImage(), deleting the Image object pointed to by backgroundImage. When control returns to Image::click, the function's backgroundImage \"this\" pointer (which is the former value of backgroundImage) is a dangling pointer. The root of this weakness is that while one operation on Widget (click) is in the midst of executing, a second operation on the Widget object may be invoked (in this case, the second invocation is a call to different method, namely changeBackgroundImage) that modifies the non-local variable."}]},{"Entries":[{"IntroText":"This is another example of C++ code that is not designed to be reentrant."},{"Nature":"Bad","Language":"C++","ExampleCode":"```\n\tclass Request\n\t{\n\t\tprivate:\n\t\t\tstd::string uri;\n\t\t\t/* ... */\n\t\tpublic:\n\t\t\tvoid setup(ScriptObject* _uri)\n\t\t\t{\n\t\t\t\tthis-\u003euri = scriptEngine-\u003ecoerceToString(_uri);\n\t\t\t\t/* ... */\n\t\t\t}\n\t\t\tvoid send(ScriptObject* _data)\n\t\t\t{\n\t\t\t\tCredentials credentials = GetCredentials(uri);\n\t\t\t\tstd::string data = scriptEngine-\u003ecoerceToString(_data);\n\t\t\t\tdoSend(uri, credentials, data);\n\t\t\t}\n\t}\n```"},{"BodyText":"The expected order of operations is a call to Request::setup(), followed by a call to Request::send(). Request::send() calls scriptEngine-\u003ecoerceToString(_data) to coerce a script-provided parameter into a string. This operation may produce script execution. For example, if the script language is ECMAScript, arbitrary script execution may result if _data is an adversary-supplied ECMAScript object having a custom toString method. If the adversary's script makes a new call to Request::setup, then when control returns to Request::send, the field uri and the local variable credentials will no longer be consistent with one another. As a result, credentials for one resource will be shared improperly with a different resource. The root of this weakness is that while one operation on Request (send) is in the midst of executing, a second operation may be invoked (setup)."}]}],"ObservedExamples":[{"Reference":"CVE-2014-1772","Description":"In this vulnerability, by registering a malicious onerror handler, an adversary can produce unexpected re-entrance of a CDOMRange object. [REF-1098]","Link":"https://www.cve.org/CVERecord?id=CVE-2014-1772"},{"Reference":"CVE-2018-8174","Description":"This CVE covers several vulnerable scenarios enabled by abuse of the Class_Terminate feature in Microsoft VBScript. In one scenario, Class_Terminate is used to produce an undesirable re-entrance of ScriptingDictionary during execution of that object's destructor. In another scenario, a vulnerable condition results from a recursive entrance of a property setter method. This recursive invocation produces a second, spurious call to the Release method of a reference-counted object, causing a UAF when that object is freed prematurely. This vulnerability pattern has been popularized as \"Double Kill\". [REF-1099]","Link":"https://www.cve.org/CVERecord?id=CVE-2018-8174"}],"RelatedAttackPatterns":["74"],"References":[{"ExternalReferenceID":"REF-1098","Authors":["Jack Tang"],"Title":"Root Cause Analysis of CVE-2014-1772 - An Internet Explorer Use After Free Vulnerability","PublicationYear":"2014","PublicationMonth":"11","PublicationDay":"05","URL":"https://www.trendmicro.com/en_us/research.html","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-1099","Authors":["Simon Zuckerbraun"],"Title":"It's Time To Terminate The Terminator","PublicationYear":"2018","PublicationMonth":"05","PublicationDay":"15","URL":"https://www.zerodayinitiative.com/blog/2018/5/15/its-time-to-terminate-the-terminator"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"Simon Zuckerbraun","SubmissionOrganization":"Trend Micro","SubmissionDate":"2018-12-20","SubmissionVersion":"4.1","SubmissionReleaseDate":"2020-02-24"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Demonstrative_Examples, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}