{"ID":"1389","Name":"Incorrect Parsing of Numbers with Different Radices","Abstraction":"Base","Structure":"Simple","Status":"Incomplete","Description":"The product parses numeric input assuming base 10 (decimal) values, but it does not account for inputs that use a different base number (radix).","ExtendedDescription":"\n\nFrequently, a numeric input that begins with \"0\" is treated as octal, or \"0x\" causes it to be treated as hexadecimal, e.g. by the inet_addr() function. For example, \"023\" (octal) is 35 decimal, or \"0x31\" is 49 decimal. Other bases may be used as well. If the developer assumes decimal-only inputs, the code could produce incorrect numbers when the inputs are parsed using a different base. This can result in unexpected and/or dangerous behavior. For example, a \"0127.0.0.1\" IP address is parsed as octal due to the leading \"0\", whose numeric value would be the same as 87.0.0.1 (decimal), where the developer likely expected to use 127.0.0.1.\n\n\nThe consequences vary depending on the surrounding code in which this weakness occurs, but they can include bypassing network-based access control using unexpected IP addresses or netmasks, or causing apparently-symbolic identifiers to be processed as if they are numbers. In web applications, this can enable bypassing of SSRF restrictions.\n","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"704","ViewID":"1000","Ordinal":"Primary"}],"WeaknessOrdinalities":[{"Ordinality":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Not Technology-Specific","Prevalence":"Undetermined"}],"ModesOfIntroduction":[{"Phase":"Implementation","Note":"Input validation used may assume decimal bases during conditional checks, when it may not always be the case."},{"Phase":"Implementation","Note":"The application may rely on a service that supports different numerical bases."}],"CommonConsequences":[{"Scope":["Confidentiality"],"Impact":["Read Application Data"],"Likelihood":["Unknown"],"Note":"An attacker may use an unexpected numerical base to access private application resources."},{"Scope":["Integrity"],"Impact":["Bypass Protection Mechanism","Alter Execution Logic"],"Likelihood":["Unknown"],"Note":"An attacker may use an unexpected numerical base to bypass or manipulate access control mechanisms."}],"DetectionMethods":[{"DetectionMethodID":"DM-14","Method":"Automated Static Analysis","Description":"Automated static analysis, commonly referred to as Static Application Security Testing (SAST), can find some instances of this weakness by analyzing source code (or binary/compiled code) without having to execute it. Typically, this is done by building a model of data flow and control flow, then searching for potentially-vulnerable patterns that connect \"sources\" (origins of input) with \"sinks\" (destinations where the data interacts with external components, a lower layer such as the OS, etc.)"}],"PotentialMitigations":[{"Phase":["Implementation"],"Strategy":"Enforcement by Conversion","Description":"If only decimal-based values are expected in the application, conditional checks should be created in a way that prevent octal or hexadecimal strings from being checked. This can be achieved by converting any numerical string to an explicit base-10 integer prior to the conditional check, to prevent octal or hex values from ever being checked against the condition."},{"Phase":["Implementation"],"Strategy":"Input Validation","Description":"If various numerical bases do need to be supported, check for leading values indicating the non-decimal base you wish to support (such as 0x for hex) and convert the numeric strings to integers of the respective base. Reject any other alternative-base string that is not intentionally supported by the application."},{"Phase":["Implementation"],"Strategy":"Input Validation","Description":"If regular expressions are used to validate IP addresses, ensure that they are bounded using ^ and $ to prevent base-prepended IP addresses from being matched."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"The below demonstrative example uses an IP validator that splits up an IP address by octet, tests to ensure each octet can be casted into an integer, and then returns the original IP address if no exceptions are raised. This validated IP address is then tested using the \"ping\" command."},{"Nature":"Bad","Language":"Python","ExampleCode":"```\n\t import subprocess\n\t def validate_ip(ip: str):\n\t\t split_ip = ip.split('.')\n\t\t if len(split_ip) \u003e 4 or len(split_ip) == 0:\n\t\t\t raise ValueError(\"Invalid IP length\")\n\t\t for octet in split_ip:\n\t\t\t try:\n\t\t\t\t int(octet, 10)\n\t\t\t except ValueError as e:\n\t\t\t\t raise ValueError(f\"Cannot convert IP octet to int - {e}\")\n```\n# Returns original IP after ensuring no exceptions are raised* \n\t\t return ip\n\t\t\n\t def run_ping(ip: str):\n\t\n\t```\n\t\t validated = validate_ip(ip)\n```\n# The ping command treats zero-prepended IP addresses as octal* \n\t\t result = subprocess.call([\"ping\", validated])\n\t\t print(result)"},{"BodyText":"If run_ping() were to be called with one or more zero-prepended octets, validate_ip() will succeed as zero-prepended numerical strings can be interpreted as decimal by a cast (\"012\" would cast to 12). However, as the original IP with the prepended zeroes is returned rather than the casted IP, it will be used in the call to the ping command. Ping DOES check and support octal-based IP octets, so the IP reached via ping may be different than the IP assumed by the validator. For example, ping would considered \"0127.0.0.1\" the same as \"87.0.0.1\"."}]},{"ID":"DX-154","Entries":[{"IntroText":"This code uses a regular expression to validate an IP string prior to using it in a call to the \"ping\" command."},{"Nature":"Bad","Language":"Python","ExampleCode":"```\n\t import subprocess\n\t import re\n\t def validate_ip_regex(ip: str):\n\t\t ip_validator = re.compile(r\"((25[0-5]|(2[0-4]|1\\d|[1-9]|)\\d)\\.?\\b){4}\")\n\t\t if ip_validator.match(ip):\n\t\t\t return ip\n\t\t else:\n\t\t\t raise ValueError(\"IP address does not match valid pattern.\")\n\t def run_ping_regex(ip: str):\n\t\t validated = validate_ip_regex(ip)\n```\n# The ping command treats zero-prepended IP addresses as octal* \n\t\t result = subprocess.call([\"ping\", validated])\n\t\t print(result)"},{"BodyText":"Since the regular expression does not have anchors (CWE-777), i.e. is unbounded without ^ or $ characters, then prepending a 0 or 0x to the beginning of the IP address will still result in a matched regex pattern. Since the ping command supports octal and hex prepended IP addresses, it will use the unexpectedly valid IP address (CWE-1389). For example, \"0x63.63.63.63\" would be considered equivalent to \"99.63.63.63\". As a result, the attacker could potentially ping systems that the attacker cannot reach directly."}]},{"Entries":[{"IntroText":"Consider the following scenario, inspired by CWE team member Kelly Todd.\n\n\nKelly wants to set up monitoring systems for his two cats, who pose very different threats. One cat, Night, tweets embarrassing or critical comments about his owner in ways that could cause reputational damage, so Night's blog needs to be monitored regularly. The other cat, Taki, likes to distract Kelly and his coworkers during business meetings with cute meows, so Kelly monitors Taki's location using a different web site.\n\n\nSuppose /etc/hosts provides the site info as follows:"},{"Nature":"Bad","Language":"Other","ExampleCode":"```\n\t taki.example.com 10.1.0.7\n\t night.example.com 010.1.0.8 \n```"},{"BodyText":"The entry for night.example.com has a typo \"010\" in the first octet. When using ping to ensure the servers are up, the leading 0 causes the IP address to be converted using octal. So when Kelly's script attempts to access night.example.com, it inadvertently scans 8.1.0.8 instead of 10.1.0.8 (since \"010\" in octal is 8 in decimal), and Night is free to send new Tweets without being immediately detected."}]}],"ObservedExamples":[{"Reference":"CVE-2021-29662","Description":"Chain: Use of zero-prepended IP addresses in Perl-based IP validation module can lead to an access control bypass.","Link":"https://www.cve.org/CVERecord?id=CVE-2021-29662"},{"Reference":"CVE-2021-28918","Description":"Chain: Use of zero-prepended IP addresses in a product that manages IP blocks can lead to an SSRF.","Link":"https://www.cve.org/CVERecord?id=CVE-2021-28918"},{"Reference":"CVE-2021-29921","Description":"Chain: Use of zero-prepended IP addresses in a Python standard library package can lead to an SSRF.","Link":"https://www.cve.org/CVERecord?id=CVE-2021-29921"},{"Reference":"CVE-2021-29923","Description":"Chain: Use of zero-prepended IP addresses in the net Golang library can lead to an access control bypass.","Link":"https://www.cve.org/CVERecord?id=CVE-2021-29923"},{"Reference":"CVE-2021-29424","Description":"Chain: Use of zero-prepended IP addresses in Perl netmask module allows bypass of IP-based access control.","Link":"https://www.cve.org/CVERecord?id=CVE-2021-29424"},{"Reference":"CVE-2016-4029","Description":"Chain: incorrect validation of intended decimal-based IP address format (CWE-1286) enables parsing of octal or hexadecimal formats (CWE-1389), allowing bypass of an SSRF protection mechanism (CWE-918).","Link":"https://www.cve.org/CVERecord?id=CVE-2016-4029"},{"Reference":"CVE-2020-13776","Description":"Mishandling of hex-valued usernames leads to unexpected decimal conversion and privilege escalation in the systemd Linux suite.","Link":"https://www.cve.org/CVERecord?id=CVE-2020-13776"}],"References":[{"ExternalReferenceID":"REF-1284","Authors":["Sick Codes"],"Title":"Universal \"netmask\" npm package, used by 270,000+ projects, vulnerable to octal input data","PublicationYear":"2021","PublicationMonth":"03","PublicationDay":"28","URL":"https://sick.codes/universal-netmask-npm-package-used-by-270000-projects-vulnerable-to-octal-input-data-server-side-request-forgery-remote-file-inclusion-local-file-inclusion-and-more-cve-2021-28918/"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"Anonymous External Contributor","SubmissionDate":"2021-05-28","SubmissionVersion":"4.9","SubmissionReleaseDate":"2022-10-13"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Relationships, Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-12-11","ModificationComment":"updated Detection_Factors, Weakness_Ordinalities","ModificationVersion":"4.19","ModificationReleaseDate":"2025-12-11"}]}