{"ID":"1434","Name":"Insecure Setting of Generative AI/ML Model Inference Parameters","Abstraction":"Base","Structure":"Simple","Status":"Draft","Description":"The product has a component that relies on a\n\t  generative AI/ML model configured with inference parameters that\n\t  produce an unacceptably high rate of erroneous or unexpected\n\t  outputs.","ExtendedDescription":"\n\nGenerative AI/ML models, such as those used for text generation, image synthesis, and other creative tasks, rely on inference parameters that control model behavior, such as temperature, Top P, and Top K. These parameters affect the model's internal decision-making processes, learning rate, and probability distributions. Incorrect settings can lead to unusual behavior such as text \"hallucinations,\" unrealistic images, or failure to converge during training. The impact of such misconfigurations can compromise the integrity of the application. If the results are used in security-critical operations or decisions, then this could violate the intended security policy, i.e., introduce a vulnerability.\n","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"440","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"665","ViewID":"1000"},{"Nature":"CanPrecede","CweID":"684","ViewID":"1000"},{"Nature":"PeerOf","CweID":"691","ViewID":"1000"}],"WeaknessOrdinalities":[{"Ordinality":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Architecture","Class":"Not Architecture-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Name":"AI/ML","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Not Technology-Specific","Prevalence":"Undetermined"}],"ModesOfIntroduction":[{"Phase":"Build and Compilation","Note":"During model training, hyperparameters may be set without adequate validation or understanding of their impact."},{"Phase":"Installation","Note":"During deployment, model parameters may be adjusted to optimize performance without comprehensive testing."},{"Phase":"Patching and Maintenance","Note":"Updates or modifications may be made to the model that alter its behavior without thorough re-evaluation."}],"CommonConsequences":[{"Scope":["Integrity","Other"],"Impact":["Varies by Context","Unexpected State"],"Note":"The product can generate inaccurate, misleading, or nonsensical information."},{"Scope":["Other"],"Impact":["Alter Execution Logic","Unexpected State","Varies by Context"],"Note":"If outputs are used in critical decision-making processes, errors could be propagated to other systems or components."}],"DetectionMethods":[{"Method":"Automated Dynamic Analysis","Description":"Manipulate inference parameters and perform comparative evaluation to assess the impact of selected values. Build a suite of systems using targeted tools that detect problems such as prompt injection (CWE-1427) and other problems. Consider statistically measuring token distribution to see if it is consistent with expected results.","Effectiveness":"Moderate","EffectivenessNotes":"Given the large variety of outcomes, it can be difficult to design testing to be comprehensive enough, and there is still a risk of unpredictable behavior."},{"Method":"Manual Dynamic Analysis","Description":"Manipulate inference parameters and perform comparative evaluation to assess the impact of selected values. Build a suite of systems using targeted tools that detect problems such as prompt injection (CWE-1427) and other problems. Consider statistically measuring token distribution to see if it is consistent with expected results.","Effectiveness":"Moderate","EffectivenessNotes":"Given the large variety of outcomes, it can be difficult to design testing to be comprehensive enough, and there is still a risk of unpredictable behavior."}],"PotentialMitigations":[{"Phase":["Implementation","System Configuration","Operation"],"Description":"Develop and adhere to robust parameter tuning processes that include extensive testing and validation."},{"Phase":["Implementation","System Configuration","Operation"],"Description":"Implement feedback mechanisms to continuously assess and adjust model performance."},{"Phase":["Documentation"],"Description":"Provide comprehensive documentation and guidelines for parameter settings to ensure consistent and accurate model behavior."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"Assume the product offers an LLM-based AI coding assistant to help users to write code as part of an Integrated Development Environment (IDE). Assume the model has been trained on real-world code, and the model behaves normally under its default settings. Suppose there is a default temperature of 1, with a range of temperature values from 0 (most deterministic) to 2.\n\n\nConsider the following configuration."},{"Nature":"Bad","Language":"JSON","ExampleCode":"{\n\n```\n\t \"model\": \"my-coding-model\",\n\t \"context_window\": 8192,\n\t \"max_output_tokens\": 4096,\n\t \"temperature\", 1.5,\n\t ...\n }\n```"},{"BodyText":"The problem is that the configuration contains a temperature hyperparameter that is higher than the default. This significantly increases the likelihood that the LLM will suggest a package that did not exist at training time, a behavior sometimes referred to as \"package hallucination.\" Note that other possible behaviors could arise from higher temperature, not just package hallucination.\n\n\nAn adversary could anticipate which package names could be generated and create a malicious package. For example, it has been observed that the same LLM might hallucinate the same package regularly. Any code that is generated by the LLM, when run by the user, would download and execute the malicious package. This is similar to typosquatting.\n\n\nThe risk could be reduced by lowering the temperature so that it reduces the unpredictable outputs and has a better chance of staying more in line with the training data. If the temperature is set too low, then some of the power of the model will be lost, and it may be less capable of producing solutions for rarely-encountered problems that are not reflected in the training data. However, if the temperature is not set low enough, the risk of hallucinating package names may still be too high. Unfortunately, the \"best\" temperature cannot be determined a priori, and sufficient empirical testing is needed."},{"Nature":"Good","Language":"JSON","ExampleCode":"{\n\n```\n\t ...\n\t \"temperature\", 0.2,\n\t ...\n }\n```"},{"BodyText":"In addition to more restrictive temperature settings, consider adding guardrails that test that independently verify any referenced package to ensure that it exists, is not obsolete, and comes from a trusted party.\n\n\nNote that reducing temperature does not entirely eliminate the risk of package hallucination. Even with very low temperatures or other settings, there is still a small chance that a non-existent package name will be generated."}]}],"References":[{"ExternalReferenceID":"REF-1487","Authors":["Joseph Spracklen","Raveen Wijewickrama","A H M Nazmus Sakib","Anindya Maiti","Bimal Viswanath","Murtuza Jadliwala"],"Title":"We Have a Package for You! A Comprehensive Analysis of Package Hallucinations by Code Generating LLMs","PublicationYear":"2025","PublicationMonth":"03","PublicationDay":"02","URL":"https://arxiv.org/abs/2406.10279","URLDate":"2025-09-08"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"Notes":[{"Type":"Research Gap","Note":"This weakness might be under-reported as of CWE 4.18, since there are no clear observed examples in CVE. However, inference parameters may be the root cause for various vulnerabilities - or important factors - but the vulnerability reports may concentrate more on the negative impact (e.g. code execution) or the weaknesses that the insecure settings contribute to. Alternately, dynamic techniques might not reveal the root cause if the researcher does not have access to the underlying source code and environment."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"Lily Wong","SubmissionOrganization":"MITRE","SubmissionDate":"2024-06-28","SubmissionVersion":"4.18","SubmissionReleaseDate":"2025-09-09"},{"Type":"Contribution","ContributionName":"AI WG \"New Entry\" subgroup","ContributionDate":"2025-02-28","ContributionComment":"Participated in regular meetings from February to August 2025 to develop and refine most elements of this entry.","ContributionType":"Content","ContributionVersion":"4.18","ContributionReleaseDate":"2025-09-09"}]}