{"ID":"23","Name":"Relative Path Traversal","Abstraction":"Base","Structure":"Simple","Status":"Draft","Diagram":"/data/images/CWE-23-Diagram.png","Description":"The product uses external input to construct a pathname that should be within a restricted directory, but it does not properly neutralize sequences such as \"..\" that can resolve to a location that is outside of that directory.","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"22","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"22","ViewID":"1305","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"22","ViewID":"1340","Ordinal":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Name":"AI/ML","Prevalence":"Undetermined"}],"AlternateTerms":[{"Term":"Zip Slip","Description":"\"Zip slip\" is an attack that uses file archives (e.g., ZIP, tar, rar, etc.) that contain filenames with path traversal sequences that cause the files to be written outside of the directory under which the archive is expected to be extracted [REF-1282]. It is most commonly used for relative path traversal (CWE-23) and link following (CWE-59)."}],"ModesOfIntroduction":[{"Phase":"Implementation"}],"CommonConsequences":[{"Scope":["Integrity","Confidentiality","Availability"],"Impact":["Execute Unauthorized Code or Commands"],"Note":"The attacker may be able to create or overwrite critical files that are used to execute code, such as programs or libraries."},{"Scope":["Integrity"],"Impact":["Modify Files or Directories"],"Note":"The attacker may be able to overwrite or create critical files, such as programs, libraries, or important data. If the targeted file is used for a security mechanism, then the attacker may be able to bypass that mechanism. For example, appending a new account at the end of a password file may allow an attacker to bypass authentication."},{"Scope":["Confidentiality"],"Impact":["Read Files or Directories"],"Note":"The attacker may be able read the contents of unexpected files and expose sensitive data by traversing the file system to access files or directories that are outside of the restricted directory. If the targeted file is used for a security mechanism, then the attacker may be able to bypass that mechanism. For example, by reading a password file, the attacker could conduct brute force password guessing attacks in order to break into an account on the system."},{"Scope":["Availability"],"Impact":["DoS: Crash, Exit, or Restart"],"Note":"The attacker may be able to overwrite, delete, or corrupt unexpected critical files such as programs, libraries, or important data. This may prevent the product from working at all and in the case of a protection mechanisms such as authentication, it has the potential to lockout every user of the product."}],"DetectionMethods":[{"DetectionMethodID":"DM-14","Method":"Automated Static Analysis","Description":"Automated static analysis, commonly referred to as Static Application Security Testing (SAST), can find some instances of this weakness by analyzing source code (or binary/compiled code) without having to execute it. Typically, this is done by building a model of data flow and control flow, then searching for potentially-vulnerable patterns that connect \"sources\" (origins of input) with \"sinks\" (destinations where the data interacts with external components, a lower layer such as the OS, etc.)","Effectiveness":"High"}],"PotentialMitigations":[{"MitigationID":"MIT-5.1","Phase":["Implementation"],"Strategy":"Input Validation","Description":"\n\nAssume all input is malicious. Use an \"accept known good\" input validation strategy, i.e., use a list of acceptable inputs that strictly conform to specifications. Reject any input that does not strictly conform to specifications, or transform it into something that does.\n\n\nWhen performing input validation, consider all potentially relevant properties, including length, type of input, the full range of acceptable values, missing or extra inputs, syntax, consistency across related fields, and conformance to business rules. As an example of business rule logic, \"boat\" may be syntactically valid because it only contains alphanumeric characters, but it is not valid if the input is only expected to contain colors such as \"red\" or \"blue.\"\n\n\nDo not rely exclusively on looking for malicious or malformed inputs. This is likely to miss at least one undesirable input, especially if the code's environment changes. This can give attackers enough room to bypass the intended validation. However, denylists can be useful for detecting potential attacks or determining which inputs are so malformed that they should be rejected outright.\n\n\nWhen validating filenames, use stringent allowlists that limit the character set to be used. If feasible, only allow a single \".\" character in the filename to avoid weaknesses such as CWE-23, and exclude directory separators such as \"/\" to avoid CWE-36. Use a list of allowable file extensions, which will help to avoid CWE-434.\n\n\nDo not rely exclusively on a filtering mechanism that removes potentially dangerous characters. This is equivalent to a denylist, which may be incomplete (CWE-184). For example, filtering \"/\" is insufficient protection if the filesystem also supports the use of \"\\\" as a directory separator. Another possible error could occur when the filtering is applied in a way that still produces dangerous data (CWE-182). For example, if \"../\" sequences are removed from the \".../...//\" string in a sequential fashion, two instances of \"../\" would be removed from the original string, but the remaining characters would still form the \"../\" string.\n"},{"MitigationID":"MIT-20.1","Phase":["Implementation"],"Strategy":"Input Validation","Description":"\n\nInputs should be decoded and canonicalized to the application's current internal representation before being validated (CWE-180). Make sure that the application does not decode the same input twice (CWE-174). Such errors could be used to bypass allowlist validation schemes by introducing dangerous inputs after they have been checked.\n\n\nUse a built-in path canonicalization function (such as realpath() in C) that produces the canonical version of the pathname, which effectively removes \"..\" sequences and symbolic links (CWE-23, CWE-59). This includes:\n\n\n  - realpath() in C\n\n  - getCanonicalPath() in Java\n\n  - GetFullPath() in ASP.NET\n\n  - realpath() or abs_path() in Perl\n\n  - realpath() in PHP\n\n"},{"MitigationID":"MIT-29","Phase":["Operation"],"Strategy":"Firewall","Description":"Use an application firewall that can detect attacks against this weakness. It can be beneficial in cases in which the code cannot be fixed (because it is controlled by a third party), as an emergency prevention measure while more comprehensive software assurance measures are applied, or to provide defense in depth [REF-1481].","Effectiveness":"Moderate","EffectivenessNotes":"An application firewall might not cover all possible input vectors. In addition, attack techniques might be available to bypass the protection mechanism, such as using malformed inputs that can still be processed by the component that receives those inputs. Depending on functionality, an application firewall might inadvertently reject or modify legitimate requests. Finally, some manual effort may be required for customization."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"The following URLs are vulnerable to this attack:"},{"Nature":"Bad","Language":"Other","ExampleCode":"```\n\thttp://example.com/get-files.jsp?file=report.pdf\n\thttp://example.com/get-page.php?home=aaa.html\n\thttp://example.com/some-page.asp?page=index.html\n```"},{"BodyText":"A simple way to execute this attack is like this:"},{"Nature":"Attack","Language":"Other","ExampleCode":"```\n\thttp://example.com/get-files?file=../../../../somedir/somefile\n\thttp://example.com/../../../../etc/shadow\n\thttp://example.com/get-files?file=../../../../etc/passwd\n```"}]},{"ID":"DX-27","Entries":[{"IntroText":"The following code could be for a social networking application in which each user's profile information is stored in a separate file. All files are stored in a single directory."},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\tmy $dataPath = \"/users/cwe/profiles\";\n\tmy $username = param(\"user\");\n\tmy $profilePath = $dataPath . \"/\" . $username;\n\topen(my $fh, \"\u003c\", $profilePath) || ExitError(\"profile read error: $profilePath\");\n\tprint \"\u003cul\u003e\\n\";\n\twhile (\u003c$fh\u003e) {\n\t\tprint \"\u003cli\u003e$_\u003c/li\u003e\\n\";\n\t}\n\tprint \"\u003c/ul\u003e\\n\";\n```"},{"BodyText":"While the programmer intends to access files such as \"/users/cwe/profiles/alice\" or \"/users/cwe/profiles/bob\", there is no verification of the incoming user parameter. An attacker could provide a string such as:"},{"Nature":"Attack","ExampleCode":"```\n\t../../../etc/passwd\n```"},{"BodyText":"The program would generate a profile pathname like this:"},{"Nature":"Result","ExampleCode":"```\n\t/users/cwe/profiles/../../../etc/passwd\n```"},{"BodyText":"When the file is opened, the operating system resolves the \"../\" during path canonicalization and actually accesses this file:"},{"Nature":"Result","ExampleCode":"```\n\t/etc/passwd\n```"},{"BodyText":"As a result, the attacker could read the entire text of the password file."},{"BodyText":"Notice how this code also contains an error message information leak (CWE-209) if the user parameter does not produce a file that exists: the full pathname is provided. Because of the lack of output encoding of the file that is retrieved, there might also be a cross-site scripting problem (CWE-79) if profile contains any HTML, but other code would need to be examined."}]},{"ID":"DX-22","Entries":[{"IntroText":"The following code demonstrates the unrestricted upload of a file with a Java servlet and a path traversal vulnerability. The action attribute of an HTML form is sending the upload file request to the Java servlet."},{"Nature":"Good","Language":"HTML","ExampleCode":"```\n\t\u003cform action=\"FileUploadServlet\" method=\"post\" enctype=\"multipart/form-data\"\u003e\n\tChoose a file to upload:\n\t\u003cinput type=\"file\" name=\"filename\"/\u003e\n\t\u003cbr/\u003e\n\t\u003cinput type=\"submit\" name=\"submit\" value=\"Submit\"/\u003e\n\t\u003c/form\u003e\n```"},{"BodyText":"When submitted the Java servlet's doPost method will receive the request, extract the name of the file from the Http request header, read the file contents from the request and output the file to the local upload directory."},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tpublic class FileUploadServlet extends HttpServlet {\n\t\t\t...\n\t\t\tprotected void doPost(HttpServletRequest request, HttpServletResponse response) throws ServletException, IOException {\n\t\t\t\t\tresponse.setContentType(\"text/html\");\n\t\t\t\t\tPrintWriter out = response.getWriter();\n\t\t\t\t\tString contentType = request.getContentType();\n\t\t\t\t\t// the starting position of the boundary header\n\t\t\t\t\tint ind = contentType.indexOf(\"boundary=\");\n\t\t\t\t\tString boundary = contentType.substring(ind+9);\n\t\t\t\t\tString pLine = new String();\n\t\t\t\t\tString uploadLocation = new String(UPLOAD_DIRECTORY_STRING); //Constant value\n\t\t\t\t\t// verify that content type is multipart form data\n\t\t\t\t\tif (contentType != null \u0026\u0026 contentType.indexOf(\"multipart/form-data\") != -1) {\n\t\t\t\t\t\t\t// extract the filename from the Http header\n\t\t\t\t\t\t\tBufferedReader br = new BufferedReader(new InputStreamReader(request.getInputStream()));\n\t\t\t\t\t\t\t...\n\t\t\t\t\t\t\tpLine = br.readLine();\n\t\t\t\t\t\t\tString filename = pLine.substring(pLine.lastIndexOf(\"\\\\\"), pLine.lastIndexOf(\"\\\"\"));\n\t\t\t\t\t\t\t...\n\t\t\t\t\t\t\t// output the file to the local upload directory\n\t\t\t\t\t\t\ttry {\n\t\t\t\t\t\t\t\t\tBufferedWriter bw = new BufferedWriter(new FileWriter(uploadLocation+filename, true));\n\t\t\t\t\t\t\t\t\tfor (String line; (line=br.readLine())!=null; ) {\n\t\t\t\t\t\t\t\t\t\tif (line.indexOf(boundary) == -1) {\n\t\t\t\t\t\t\t\t\t\t\tbw.write(line);\n\t\t\t\t\t\t\t\t\t\t\tbw.newLine();\n\t\t\t\t\t\t\t\t\t\t\tbw.flush();\n\t\t\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t\t\t} //end of for loop\n\t\t\t\t\t\t\t\t\tbw.close();\n\t\t\t\t\t\t\t} catch (IOException ex) {...}\n\t\t\t\t\t\t\t// output successful upload response HTML page\n\t\t\t\t\t}\n\t\t\t\t\t// output unsuccessful upload response HTML page\n\t\t\t\t\telse\n\t\t\t\t\t{...}\n\t\t\t}\n\t\t\t\t...\n\t}\n```"},{"BodyText":"This code does not perform a check on the type of the file being uploaded (CWE-434). This could allow an attacker to upload any executable file or other file with malicious code."},{"BodyText":"Additionally, the creation of the BufferedWriter object is subject to relative path traversal (CWE-23). Since the code does not check the filename that is provided in the header, an attacker can use \"../\" sequences to write to files outside of the intended directory. Depending on the executing environment, the attacker may be able to specify arbitrary files to write to, leading to a wide variety of consequences, from code execution, XSS (CWE-79), or system crash."}]}],"ObservedExamples":[{"Reference":"CVE-2024-37032","Description":"Large language model (LLM) management tool does not validate the format of a digest value (CWE-1287) from a private, untrusted model registry, enabling relative path traversal (CWE-23), a.k.a. Probllama","Link":"https://www.cve.org/CVERecord?id=CVE-2024-37032"},{"Reference":"CVE-2024-0520","Description":"Product for managing datasets for AI model training and evaluation allows both relative (CWE-23) and absolute (CWE-36) path traversal to overwrite files via the Content-Disposition header","Link":"https://www.cve.org/CVERecord?id=CVE-2024-0520"},{"Reference":"CVE-2022-45918","Description":"Chain: a learning management tool debugger uses external input to locate previous session logs (CWE-73) and does not properly validate the given path (CWE-20), allowing for filesystem path traversal using \"../\" sequences (CWE-24)","Link":"https://www.cve.org/CVERecord?id=CVE-2022-45918"},{"Reference":"CVE-2019-20916","Description":"Python package manager does not correctly restrict the filename specified in a Content-Disposition header, allowing arbitrary file read using path traversal sequences such as \"../\"","Link":"https://www.cve.org/CVERecord?id=CVE-2019-20916"},{"Reference":"CVE-2022-24877","Description":"directory traversal in Go-based Kubernetes operator app allows accessing data from the controller's pod file system via ../ sequences in a yaml file","Link":"https://www.cve.org/CVERecord?id=CVE-2022-24877"},{"Reference":"CVE-2020-4053","Description":"a Kubernetes package manager written in Go allows malicious plugins to inject path traversal sequences into a plugin archive (\"Zip slip\") to copy a file outside the intended directory","Link":"https://www.cve.org/CVERecord?id=CVE-2020-4053"},{"Reference":"CVE-2021-21972","Description":"Chain: Cloud computing virtualization platform does not require authentication for upload of a tar format file (CWE-306), then uses .. path traversal sequences (CWE-23) in the file to access unexpected files, as exploited in the wild per CISA KEV.","Link":"https://www.cve.org/CVERecord?id=CVE-2021-21972"},{"Reference":"CVE-2019-10743","Description":"Go-based archive library allows extraction of files to locations outside of the target folder with \"../\" path traversal sequences in filenames in a zip file, aka \"Zip Slip\"","Link":"https://www.cve.org/CVERecord?id=CVE-2019-10743"},{"Reference":"CVE-2002-0298","Description":"Server allows remote attackers to cause a denial of service via certain HTTP GET requests containing a %2e%2e (encoded dot-dot), several \"/../\" sequences, or several \"../\" in a URI.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0298"},{"Reference":"CVE-2002-0661","Description":"\"\\\" not in denylist for web server, allowing path traversal attacks when the server is run in Windows and other OSes.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0661"},{"Reference":"CVE-2002-0946","Description":"Arbitrary files may be read files via ..\\ (dot dot) sequences in an HTTP request.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0946"},{"Reference":"CVE-2002-1042","Description":"Directory traversal vulnerability in search engine for web server allows remote attackers to read arbitrary files via \"..\\\" sequences in queries.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-1042"},{"Reference":"CVE-2002-1209","Description":"Directory traversal vulnerability in FTP server allows remote attackers to read arbitrary files via \"..\\\" sequences in a GET request.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-1209"},{"Reference":"CVE-2002-1178","Description":"Directory traversal vulnerability in servlet allows remote attackers to execute arbitrary commands via \"..\\\" sequences in an HTTP request.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-1178"},{"Reference":"CVE-2002-1987","Description":"Protection mechanism checks for \"/..\" but doesn't account for Windows-specific \"\\..\" allowing read of arbitrary files.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-1987"},{"Reference":"CVE-2005-2142","Description":"Directory traversal vulnerability in FTP server allows remote authenticated attackers to list arbitrary directories via a \"\\..\" sequence in an LS command.","Link":"https://www.cve.org/CVERecord?id=CVE-2005-2142"},{"Reference":"CVE-2002-0160","Description":"The administration function in Access Control Server allows remote attackers to read HTML, Java class, and image files outside the web root via a \"..\\..\" sequence in the URL to port 2002.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0160"},{"Reference":"CVE-2001-0467","Description":"\"\\...\" in web server","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0467"},{"Reference":"CVE-2001-0963","Description":"\"...\" in cd command in FTP server","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0963"},{"Reference":"CVE-2001-1193","Description":"\"...\" in cd command in FTP server","Link":"https://www.cve.org/CVERecord?id=CVE-2001-1193"},{"Reference":"CVE-2001-1131","Description":"\"...\" in cd command in FTP server","Link":"https://www.cve.org/CVERecord?id=CVE-2001-1131"},{"Reference":"CVE-2001-0480","Description":"read of arbitrary files and directories using GET or CD with \"...\" in Windows-based FTP server.","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0480"},{"Reference":"CVE-2002-0288","Description":"read files using \".\" and Unicode-encoded \"/\" or \"\\\" characters in the URL.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0288"},{"Reference":"CVE-2003-0313","Description":"Directory listing of web server using \"...\"","Link":"https://www.cve.org/CVERecord?id=CVE-2003-0313"},{"Reference":"CVE-2005-1658","Description":"Triple dot","Link":"https://www.cve.org/CVERecord?id=CVE-2005-1658"},{"Reference":"CVE-2000-0240","Description":"read files via \"/........../\" in URL","Link":"https://www.cve.org/CVERecord?id=CVE-2000-0240"},{"Reference":"CVE-2000-0773","Description":"read files via \"....\" in web server","Link":"https://www.cve.org/CVERecord?id=CVE-2000-0773"},{"Reference":"CVE-1999-1082","Description":"read files via \"......\" in web server (doubled triple dot?)","Link":"https://www.cve.org/CVERecord?id=CVE-1999-1082"},{"Reference":"CVE-2004-2121","Description":"read files via \"......\" in web server (doubled triple dot?)","Link":"https://www.cve.org/CVERecord?id=CVE-2004-2121"},{"Reference":"CVE-2001-0491","Description":"multiple attacks using \"..\", \"...\", and \"....\" in different commands","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0491"},{"Reference":"CVE-2001-0615","Description":"\"...\" or \"....\" in chat server","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0615"},{"Reference":"CVE-2005-2169","Description":"chain: \".../...//\" bypasses protection mechanism using regexp's that remove \"../\" resulting in collapse into an unsafe value \"../\" (CWE-182) and resultant path traversal.","Link":"https://www.cve.org/CVERecord?id=CVE-2005-2169"},{"Reference":"CVE-2005-0202","Description":"\".../....///\" bypasses regexp's that remove \"./\" and \"../\"","Link":"https://www.cve.org/CVERecord?id=CVE-2005-0202"},{"Reference":"CVE-2004-1670","Description":"Mail server allows remote attackers to create arbitrary directories via a \"..\" or rename arbitrary files via a \"....//\" in user supplied parameters.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-1670"}],"FunctionalAreas":["File Processing"],"AffectedResources":["File or Directory"],"TaxonomyMappings":[{"TaxonomyName":"PLOVER","EntryName":"Relative Path Traversal"},{"TaxonomyName":"Software Fault Patterns","EntryID":"SFP16","EntryName":"Path Traversal"}],"RelatedAttackPatterns":["139","76"],"References":[{"ExternalReferenceID":"REF-192","Authors":["OWASP"],"Title":"OWASP Attack listing","URL":"http://www.owasp.org/index.php/Relative_Path_Traversal"},{"ExternalReferenceID":"REF-62","Section":"Chapter 9, \"Filenames and Paths\", Page 503","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"},{"ExternalReferenceID":"REF-1282","Authors":["Snyk"],"Title":"Zip Slip Vulnerability","PublicationYear":"2018","PublicationMonth":"06","PublicationDay":"05","URL":"https://security.snyk.io/research/zip-slip-vulnerability"},{"ExternalReferenceID":"REF-1448","Authors":["Cybersecurity and Infrastructure Security Agency"],"Title":"Secure by Design Alert: Eliminating Directory Traversal Vulnerabilities in Software","PublicationYear":"2024","PublicationMonth":"05","PublicationDay":"02","URL":"https://www.cisa.gov/resources-tools/resources/secure-design-alert-eliminating-directory-traversal-vulnerabilities-software","URLDate":"2024-07-14"},{"ExternalReferenceID":"REF-1481","Authors":["D3FEND"],"Title":"D3FEND: Application Layer Firewall","URL":"https://d3fend.mitre.org/dao/artifact/d3f:ApplicationLayerFirewall/","URLDate":"2025-09-06"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"PLOVER","SubmissionDate":"2006-07-19","SubmissionVersion":"Draft 3","SubmissionReleaseDate":"2006-07-19"},{"Type":"Modification","ModificationName":"Eric Dalci","ModificationOrganization":"Cigital","ModificationDate":"2008-07-01","ModificationComment":"updated References, Demonstrative_Example, Potential_Mitigations, Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2008-09-08","ModificationComment":"updated Relationships, References, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2008-10-14","ModificationComment":"updated Description"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-07-27","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-02-16","ModificationComment":"updated Demonstrative_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Description, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-03-29","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated Common_Consequences, Demonstrative_Examples, Observed_Examples, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-01-19","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Applicable_Platforms"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Potential_Mitigations, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-06-25","ModificationComment":"updated Observed_Examples, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-12-10","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-03-15","ModificationComment":"updated Demonstrative_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-10-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-06-28","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Alternate_Terms, Observed_Examples, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Common_Consequences, Description"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Detection_Factors, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-10-26","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-07-16","ModificationComment":"updated Observed_Examples, References","ModificationVersion":"4.15","ModificationReleaseDate":"2024-07-16"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-04-03","ModificationComment":"updated Demonstrative_Examples","ModificationVersion":"4.17","ModificationReleaseDate":"2025-04-03"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-09-09","ModificationComment":"updated Affected_Resources, Applicable_Platforms, Common_Consequences, Description, Diagram, Functional_Areas, Observed_Examples, Potential_Mitigations, References","ModificationVersion":"4.18","ModificationReleaseDate":"2025-09-09"},{"Type":"Contribution","ContributionName":"Nick Johnston","ContributionDate":"2022-07-11","ContributionComment":"Identified weakness in Perl demonstrative example","ContributionType":"Feedback"}]}