{"ID":"285","Name":"Improper Authorization","Abstraction":"Class","Structure":"Simple","Status":"Draft","Description":"The product does not perform or incorrectly performs an authorization check when an actor attempts to access a resource or perform an action.","ExtendedDescription":"\n\nAssuming a user with a given identity, authorization is the process of determining whether that user can access a given resource, based on the user's privileges and any permissions or other access-control specifications that apply to the resource.\n\n\nWhen access control checks are not applied consistently - or not at all - users are able to access data or perform actions that they should not be allowed to perform. This can lead to a wide range of problems, including information exposures, denial of service, and arbitrary code execution.\n","LikelihoodOfExploit":"High","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"284","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"284","ViewID":"1340","Ordinal":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Name":"Web Server","Prevalence":"Often"},{"Type":"Technology","Name":"Database Server","Prevalence":"Often"}],"BackgroundDetails":["An access control list (ACL) represents who/what has permissions to a given object. Different operating systems implement (ACLs) in different ways. In UNIX, there are three types of permissions: read, write, and execute. Users are divided into three classes for file access: owner, group owner, and all other users where each class has a separate set of rights. In Windows NT, there are four basic types of permissions for files: \"No access\", \"Read access\", \"Change access\", and \"Full control\". Windows NT extends the concept of three types of users in UNIX to include a list of users and groups along with their associated permissions. A user can create an object (file) and assign specified permissions to that object."],"AlternateTerms":[{"Term":"AuthZ","Description":"\"AuthZ\" is typically used as an abbreviation of \"authorization\" within the web application security community. It is distinct from \"AuthN\" (or, sometimes, \"AuthC\") which is an abbreviation of \"authentication.\" The use of \"Auth\" as an abbreviation is discouraged, since it could be used for either authentication or authorization."}],"ModesOfIntroduction":[{"Phase":"Implementation","Note":"\n\nREALIZATION: This weakness is caused during implementation of an architectural security tactic.\n\n\nA developer may introduce authorization weaknesses because of a lack of understanding about the underlying technologies. For example, a developer may assume that attackers cannot modify certain inputs such as headers or cookies.\n"},{"Phase":"Architecture and Design","Note":"\n\nAuthorization weaknesses may arise when a single-user application is ported to a multi-user environment.\n"},{"Phase":"Operation"}],"CommonConsequences":[{"Scope":["Confidentiality"],"Impact":["Read Application Data","Read Files or Directories"],"Note":"An attacker could read sensitive data, either by reading the data directly from a data store that is not properly restricted, or by accessing insufficiently-protected, privileged functionality to read the data."},{"Scope":["Integrity"],"Impact":["Modify Application Data","Modify Files or Directories"],"Note":"An attacker could modify sensitive data, either by writing the data directly to a data store that is not properly restricted, or by accessing insufficiently-protected, privileged functionality to write the data."},{"Scope":["Access Control"],"Impact":["Gain Privileges or Assume Identity"],"Note":"An attacker could gain privileges by modifying or reading critical data directly, or by accessing insufficiently-protected, privileged functionality."}],"DetectionMethods":[{"DetectionMethodID":"DM-6","Method":"Automated Static Analysis","Description":"\n\nAutomated static analysis is useful for detecting commonly-used idioms for authorization. A tool may be able to analyze related configuration files, such as .htaccess in Apache web servers, or detect the usage of commonly-used authorization libraries.\n\n\nGenerally, automated static analysis tools have difficulty detecting custom authorization schemes. In addition, the software's design may include some functionality that is accessible to any user and does not require an authorization check; an automated technique that detects the absence of authorization may report false positives.\n","Effectiveness":"Limited"},{"Method":"Automated Dynamic Analysis","Description":"Automated dynamic analysis may find many or all possible interfaces that do not require authorization, but manual analysis is required to determine if the lack of authorization violates business logic"},{"Method":"Manual Analysis","Description":"\n\nThis weakness can be detected using tools and techniques that require manual (human) analysis, such as penetration testing, threat modeling, and interactive tools that allow the tester to record and modify an active session.\n\n\nSpecifically, manual static analysis is useful for evaluating the correctness of custom authorization mechanisms.\n","Effectiveness":"Moderate","EffectivenessNotes":"These may be more effective than strictly automated techniques. This is especially the case with weaknesses that are related to design and business rules. However, manual efforts might not achieve desired code coverage within limited time constraints."},{"Method":"Manual Static Analysis - Binary or Bytecode","Description":"\n\nAccording to SOAR, the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tBinary / Bytecode disassembler - then use manual analysis for vulnerabilities \u0026 anomalies","Effectiveness":"SOAR Partial"},{"Method":"Dynamic Analysis with Automated Results Interpretation","Description":"\n\nAccording to SOAR, the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tWeb Application Scanner\n\t\tWeb Services Scanner\n\t\tDatabase Scanners","Effectiveness":"SOAR Partial"},{"Method":"Dynamic Analysis with Manual Results Interpretation","Description":"\n\nAccording to SOAR, the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tHost Application Interface Scanner\n\t\tFuzz Tester\n\t\tFramework-based Fuzzer\n\t\tForced Path Execution\n\t\tMonitored Virtual Environment - run potentially malicious code in sandbox / wrapper / virtual machine, see if it does anything suspicious","Effectiveness":"SOAR Partial"},{"Method":"Manual Static Analysis - Source Code","Description":"\n\nAccording to SOAR, the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tFocused Manual Spotcheck - Focused manual analysis of source\n\t\tManual Source Code Review (not inspections)","Effectiveness":"SOAR Partial"},{"Method":"Automated Static Analysis - Source Code","Description":"\n\nAccording to SOAR, the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tContext-configured Source Code Weakness Analyzer","Effectiveness":"SOAR Partial"},{"Method":"Architecture or Design Review","Description":"\n\nAccording to SOAR, the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tFormal Methods / Correct-By-Construction\n\t```\n\t\tCost effective for partial coverage:\n```\n\n\t\tInspection (IEEE 1028 standard) (can apply to requirements, design, source code, etc.)","Effectiveness":"High"}],"PotentialMitigations":[{"Phase":["Architecture and Design"],"Description":"\n\nDivide the product into anonymous, normal, privileged, and administrative areas. Reduce the attack surface by carefully mapping roles with data and functionality. Use role-based access control (RBAC) to enforce the roles at the appropriate boundaries.\n\n\nNote that this approach may not protect against horizontal authorization, i.e., it will not protect a user from attacking others with the same role.\n"},{"Phase":["Architecture and Design"],"Description":"Ensure that you perform access control checks related to your business logic. These checks may be different than the access control checks that you apply to more generic resources such as files, connections, processes, memory, and database records. For example, a database may restrict access for medical records to a specific database user, but each record might only be intended to be accessible to the patient and the patient's doctor."},{"MitigationID":"MIT-4.4","Phase":["Architecture and Design"],"Strategy":"Libraries or Frameworks","Description":"\n\nUse a vetted library or framework that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid.\n\n\nFor example, consider using authorization frameworks such as the JAAS Authorization Framework [REF-233] and the OWASP ESAPI Access Control feature [REF-45].\n"},{"Phase":["Architecture and Design"],"Description":"\n\nFor web applications, make sure that the access control mechanism is enforced correctly at the server side on every page. Users should not be able to access any unauthorized functionality or information by simply requesting direct access to that page.\n\n\nOne way to do this is to ensure that all pages containing sensitive information are not cached, and that all such pages restrict access to requests that are accompanied by an active and authenticated session token associated with a user who has the required permissions to access that page.\n"},{"Phase":["System Configuration","Installation"],"Description":"Use the access control capabilities of your operating system and server environment and define your access control lists accordingly. Use a \"default deny\" policy when defining these ACLs."}],"DemonstrativeExamples":[{"ID":"DX-95","Entries":[{"IntroText":"This function runs an arbitrary SQL query on a given database, returning the result of the query."},{"Nature":"Bad","Language":"PHP","ExampleCode":"```\n\tfunction runEmployeeQuery($dbName, $name){\n\t\tmysql_select_db($dbName,$globalDbHandle) or die(\"Could not open Database\".$dbName);\n```\n//Use a prepared statement to avoid CWE-89* \n\t\t$preparedStatement = $globalDbHandle-\u003eprepare('SELECT * FROM employees WHERE name = :name');\n\t\t$preparedStatement-\u003eexecute(array(':name' =\u003e $name));\n\t\treturn $preparedStatement-\u003efetchAll();}\n\t\n\t */.../* \n\t\n\t$employeeRecord = runEmployeeQuery('EmployeeDB',$_GET['EmployeeName']);"},{"BodyText":"While this code is careful to avoid SQL Injection, the function does not confirm the user sending the query is authorized to do so. An attacker may be able to obtain sensitive employee information from the database."}]},{"ID":"DX-96","Entries":[{"IntroText":"The following program could be part of a bulletin board system that allows users to send private messages to each other. This program intends to authenticate the user before deciding whether a private message should be displayed. Assume that LookupMessageObject() ensures that the $id argument is numeric, constructs a filename based on that id, and reads the message details from that file. Also assume that the program stores all private messages for all users in the same directory."},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\tsub DisplayPrivateMessage {\n\t\tmy($id) = @_;\n\t\tmy $Message = LookupMessageObject($id);\n\t\tprint \"From: \" . encodeHTML($Message-\u003e{from}) . \"\u003cbr\u003e\\n\";\n\t\tprint \"Subject: \" . encodeHTML($Message-\u003e{subject}) . \"\\n\";\n\t\tprint \"\u003chr\u003e\\n\";\n\t\tprint \"Body: \" . encodeHTML($Message-\u003e{body}) . \"\\n\";\n\t}\n\tmy $q = new CGI;\n```\n# For purposes of this example, assume that CWE-309 and* \n\t\n\t\n\t\n\t *# CWE-523 do not apply.* \n\tif (! AuthenticateUser($q-\u003eparam('username'), $q-\u003eparam('password'))) {\n\t```\n\t\tExitError(\"invalid username or password\");\n\t}\n\tmy $id = $q-\u003eparam('id');\n\tDisplayPrivateMessage($id);\n```"},{"BodyText":"While the program properly exits if authentication fails, it does not ensure that the message is addressed to the user. As a result, an authenticated attacker could provide any arbitrary identifier and read private messages that were intended for other users."},{"BodyText":"One way to avoid this problem would be to ensure that the \"to\" field in the message object matches the username of the authenticated user."}]}],"ObservedExamples":[{"Reference":"CVE-2022-24730","Description":"Go-based continuous deployment product does not check that a user has certain privileges to update or create an app, allowing adversaries to read sensitive repository information","Link":"https://www.cve.org/CVERecord?id=CVE-2022-24730"},{"Reference":"CVE-2009-3168","Description":"Web application does not restrict access to admin scripts, allowing authenticated users to reset administrative passwords.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3168"},{"Reference":"CVE-2009-2960","Description":"Web application does not restrict access to admin scripts, allowing authenticated users to modify passwords of other users.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-2960"},{"Reference":"CVE-2009-3597","Description":"Web application stores database file under the web root with insufficient access control (CWE-219), allowing direct request.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3597"},{"Reference":"CVE-2009-2282","Description":"Terminal server does not check authorization for guest access.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-2282"},{"Reference":"CVE-2009-3230","Description":"Database server does not use appropriate privileges for certain sensitive operations.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3230"},{"Reference":"CVE-2009-2213","Description":"Gateway uses default \"Allow\" configuration for its authorization settings.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-2213"},{"Reference":"CVE-2009-0034","Description":"Chain: product does not properly interpret a configuration option for a system group, allowing users to gain privileges.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-0034"},{"Reference":"CVE-2008-6123","Description":"Chain: SNMP product does not properly parse a configuration option for which hosts are allowed to connect, allowing unauthorized IP addresses to connect.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-6123"},{"Reference":"CVE-2008-5027","Description":"System monitoring software allows users to bypass authorization by creating custom forms.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-5027"},{"Reference":"CVE-2008-7109","Description":"Chain: reliance on client-side security (CWE-602) allows attackers to bypass authorization using a custom client.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-7109"},{"Reference":"CVE-2008-3424","Description":"Chain: product does not properly handle wildcards in an authorization policy list, allowing unintended access.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-3424"},{"Reference":"CVE-2009-3781","Description":"Content management system does not check access permissions for private files, allowing others to view those files.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3781"},{"Reference":"CVE-2008-4577","Description":"ACL-based protection mechanism treats negative access rights as if they are positive, allowing bypass of intended restrictions.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-4577"},{"Reference":"CVE-2008-6548","Description":"Product does not check the ACL of a page accessed using an \"include\" directive, allowing attackers to read unauthorized files.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-6548"},{"Reference":"CVE-2007-2925","Description":"Default ACL list for a DNS server does not set certain ACLs, allowing unauthorized DNS queries.","Link":"https://www.cve.org/CVERecord?id=CVE-2007-2925"},{"Reference":"CVE-2006-6679","Description":"Product relies on the X-Forwarded-For HTTP header for authorization, allowing unintended access by spoofing the header.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-6679"},{"Reference":"CVE-2005-3623","Description":"OS kernel does not check for a certain privilege before setting ACLs for files.","Link":"https://www.cve.org/CVERecord?id=CVE-2005-3623"},{"Reference":"CVE-2005-2801","Description":"Chain: file-system code performs an incorrect comparison (CWE-697), preventing default ACLs from being properly applied.","Link":"https://www.cve.org/CVERecord?id=CVE-2005-2801"},{"Reference":"CVE-2001-1155","Description":"Chain: product does not properly check the result of a reverse DNS lookup because of operator precedence (CWE-783), allowing bypass of DNS-based access restrictions.","Link":"https://www.cve.org/CVERecord?id=CVE-2001-1155"}],"TaxonomyMappings":[{"TaxonomyName":"7 Pernicious Kingdoms","EntryName":"Missing Access Control"},{"TaxonomyName":"OWASP Top Ten 2007","EntryID":"A10","EntryName":"Failure to Restrict URL Access","MappingFit":"CWE More Specific"},{"TaxonomyName":"OWASP Top Ten 2004","EntryID":"A2","EntryName":"Broken Access Control","MappingFit":"CWE More Specific"},{"TaxonomyName":"Software Fault Patterns","EntryID":"SFP35","EntryName":"Insecure resource access"}],"RelatedAttackPatterns":["1","104","127","13","17","39","402","45","5","51","59","60","647","668","76","77","87"],"References":[{"ExternalReferenceID":"REF-6","Authors":["Katrina Tsipenyuk","Brian Chess","Gary McGraw"],"Title":"Seven Pernicious Kingdoms: A Taxonomy of Software Security Errors","Publication":"NIST Workshop on Software Security Assurance Tools Techniques and Metrics","PublicationYear":"2005","PublicationMonth":"11","PublicationDay":"07","Publisher":"NIST","URL":"https://samate.nist.gov/SSATTM_Content/papers/Seven%20Pernicious%20Kingdoms%20-%20Taxonomy%20of%20Sw%20Security%20Errors%20-%20Tsipenyuk%20-%20Chess%20-%20McGraw.pdf"},{"ExternalReferenceID":"REF-229","Authors":["NIST"],"Title":"Role Based Access Control and Role Based Security","URL":"https://csrc.nist.gov/projects/role-based-access-control","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-7","Section":"Chapter 4, \"Authorization\" Page 114; Chapter 6, \"Determining\n                  Appropriate Access Control\" Page 171","Authors":["Michael Howard","David LeBlanc"],"Title":"Writing Secure Code","Edition":"2nd Edition","PublicationYear":"2002","PublicationMonth":"12","PublicationDay":"04","Publisher":"Microsoft Press","URL":"https://www.microsoftpressstore.com/store/writing-secure-code-9780735617223"},{"ExternalReferenceID":"REF-231","Authors":["Frank Kim"],"Title":"Top 25 Series - Rank 5 - Improper Access Control (Authorization)","PublicationYear":"2010","PublicationMonth":"03","PublicationDay":"04","Publisher":"SANS Software Security Institute","URL":"https://www.sans.org/blog/top-25-series-rank-5-improper-access-control-authorization/","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-45","Authors":["OWASP"],"Title":"OWASP Enterprise Security API (ESAPI) Project","URL":"http://www.owasp.org/index.php/ESAPI"},{"ExternalReferenceID":"REF-233","Authors":["Rahul Bhattacharjee"],"Title":"Authentication using JAAS","URL":"https://javaranch.com/journal/2008/04/authentication-using-JAAS.html","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-62","Section":"Chapter 2, \"Common Vulnerabilities of Authorization\", Page 39","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"},{"ExternalReferenceID":"REF-62","Section":"Chapter 11, \"ACL Inheritance\", Page 649","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"}],"MappingNotes":{"Usage":"Discouraged","Rationale":"CWE-285 is high-level and lower-level CWEs can frequently be used instead. It is a level-1 Class (i.e., a child of a Pillar).","Comments":"Look at CWE-285's children and consider mapping to CWEs such as CWE-862: Missing Authorization, CWE-863: Incorrect Authorization, CWE-732: Incorrect Permission Assignment for Critical Resource, or others.","Reasons":["Abstraction"],"Suggestions":[{"CweID":"862","Comment":"Missing Authorization"},{"CweID":"863","Comment":"Incorrect Authorization"},{"CweID":"732","Comment":"Incorrect Permission Assignment for Critical Resource"}]},"ContentHistory":[{"Type":"Submission","SubmissionName":"7 Pernicious Kingdoms","SubmissionDate":"2006-07-19","SubmissionVersion":"Draft 3","SubmissionReleaseDate":"2006-07-19"},{"Type":"Modification","ModificationName":"Eric Dalci","ModificationOrganization":"Cigital","ModificationDate":"2008-07-01","ModificationComment":"updated Time_of_Introduction"},{"Type":"Modification","ModificationOrganization":"Veracode","ModificationDate":"2008-08-15","ModificationComment":"Suggested OWASP Top Ten 2004 mapping"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2008-09-08","ModificationComment":"updated Relationships, Other_Notes, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-01-12","ModificationComment":"updated Common_Consequences, Description, Likelihood_of_Exploit, Name, Other_Notes, Potential_Mitigations, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-03-10","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-05-27","ModificationComment":"updated Description, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-07-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-10-29","ModificationComment":"updated Type"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-12-28","ModificationComment":"updated Applicable_Platforms, Common_Consequences, Demonstrative_Examples, Detection_Factors, Modes_of_Introduction, Observed_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-02-16","ModificationComment":"updated Alternate_Terms, Detection_Factors, Potential_Mitigations, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-04-05","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Common_Consequences, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-09-27","ModificationComment":"updated Description"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-03-24","ModificationComment":"Changed name and description; clarified difference between \"access control\" and \"authorization.\""},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-03-29","ModificationComment":"updated Background_Details, Demonstrative_Examples, Description, Name, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences, Observed_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated Demonstrative_Examples, Potential_Mitigations, References, Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-10-30","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2013-07-17","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Detection_Factors, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2015-12-07","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Applicable_Platforms, Modes_of_Introduction, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2018-03-27","ModificationComment":"updated References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-12-10","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-03-15","ModificationComment":"updated Alternate_Terms"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-07-20","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-10-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-04-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Rename","PreviousEntryName":"Missing or Inconsistent Access Control","Date":"2009-01-12"},{"Type":"Rename","PreviousEntryName":"Improper Access Control (Authorization)","Date":"2011-03-29"}]}