{"ID":"732","Name":"Incorrect Permission Assignment for Critical Resource","Abstraction":"Class","Structure":"Simple","Status":"Draft","Description":"The product specifies permissions for a security-critical resource in a way that allows that resource to be read or modified by unintended actors.","ExtendedDescription":"When a resource is given a permission setting that provides access to a wider range of actors than required, it could lead to the exposure of sensitive information, or the modification of that resource by unintended parties. This is especially dangerous when the resource is related to program configuration, execution, or sensitive user data. For example, consider a misconfigured storage account for the cloud that can be read or written by a public or anonymous user.","LikelihoodOfExploit":"High","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"285","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"668","ViewID":"1000"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Not Technology-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Cloud Computing","Prevalence":"Often"}],"ModesOfIntroduction":[{"Phase":"Architecture and Design"},{"Phase":"Implementation","Note":"\n\nREALIZATION: This weakness is caused during implementation of an architectural security tactic.\n\n\nThe developer might make certain assumptions about the environment in which the product operates - e.g., that the software is running on a single-user system, or the software is only accessible to trusted administrators. When the software is running in a different environment, the permissions become a problem.\n"},{"Phase":"Installation","Note":"The developer may set loose permissions in order to minimize problems when the user first runs the program, then create documentation stating that permissions should be tightened. Since system administrators and users do not always read the documentation, this can result in insecure permissions being left unchanged."},{"Phase":"Operation"}],"CommonConsequences":[{"Scope":["Confidentiality"],"Impact":["Read Application Data","Read Files or Directories"],"Note":"An attacker may be able to read sensitive information from the associated resource, such as credentials or configuration information stored in a file."},{"Scope":["Access Control"],"Impact":["Gain Privileges or Assume Identity"],"Note":"An attacker may be able to modify critical properties of the associated resource to gain privileges, such as replacing a world-writable executable with a Trojan horse."},{"Scope":["Integrity","Other"],"Impact":["Modify Application Data","Other"],"Note":"An attacker may be able to destroy or corrupt critical data in the associated resource, such as deletion of records from a database."}],"DetectionMethods":[{"Method":"Automated Static Analysis","Description":"\n\nAutomated static analysis may be effective in detecting permission problems for system resources such as files, directories, shared memory, device interfaces, etc. Automated techniques may be able to detect the use of library functions that modify permissions, then analyze function calls for arguments that contain potentially insecure values.\n\n\nHowever, since the software's intended security policy might allow loose permissions for certain operations (such as publishing a file on a web server), automated static analysis may produce some false positives - i.e., warnings that do not have any security consequences or require any code changes.\n\n\nWhen custom permissions models are used - such as defining who can read messages in a particular forum in a bulletin board system - these can be difficult to detect using automated static analysis. It may be possible to define custom signatures that identify any custom functions that implement the permission checks and assignments.\n"},{"Method":"Automated Dynamic Analysis","Description":"\n\nAutomated dynamic analysis may be effective in detecting permission problems for system resources such as files, directories, shared memory, device interfaces, etc.\n\n\nHowever, since the software's intended security policy might allow loose permissions for certain operations (such as publishing a file on a web server), automated dynamic analysis may produce some false positives - i.e., warnings that do not have any security consequences or require any code changes.\n\n\nWhen custom permissions models are used - such as defining who can read messages in a particular forum in a bulletin board system - these can be difficult to detect using automated dynamic analysis. It may be possible to define custom signatures that identify any custom functions that implement the permission checks and assignments.\n"},{"DetectionMethodID":"DM-7","Method":"Manual Analysis","Description":"This weakness can be detected using tools and techniques that require manual (human) analysis, such as penetration testing, threat modeling, and interactive tools that allow the tester to record and modify an active session.","EffectivenessNotes":"These may be more effective than strictly automated techniques. This is especially the case with weaknesses that are related to design and business rules."},{"Method":"Manual Static Analysis","Description":"Manual static analysis may be effective in detecting the use of custom permissions models and functions. The code could then be examined to identifying usage of the related functions. Then the human analyst could evaluate permission assignments in the context of the intended security model of the software."},{"Method":"Manual Dynamic Analysis","Description":"Manual dynamic analysis may be effective in detecting the use of custom permissions models and functions. The program could then be executed with a focus on exercising code paths that are related to the custom permissions. Then the human analyst could evaluate permission assignments in the context of the intended security model of the software."},{"Method":"Fuzzing","Description":"Fuzzing is not effective in detecting this weakness."},{"DetectionMethodID":"DM-11.1","Method":"Black Box","Description":"\n\nUse monitoring tools that examine the software's process as it interacts with the operating system and the network. This technique is useful in cases when source code is unavailable, if the software was not developed by you, or if you want to verify that the build phase did not introduce any new weaknesses. Examples include debuggers that directly attach to the running process; system-call tracing utilities such as truss (Solaris) and strace (Linux); system activity monitors such as FileMon, RegMon, Process Monitor, and other Sysinternals utilities (Windows); and sniffers and protocol analyzers that monitor network traffic.\n\n\nAttach the monitor to the process and watch for library functions or system calls on OS resources such as files, directories, and shared memory. Examine the arguments to these calls to infer which permissions are being used.\n","EffectivenessNotes":"Note that this technique is only useful for permissions issues related to system resources. It is not likely to detect application-level business rules that are related to permissions, such as if a user of a blog system marks a post as \"private,\" but the blog system inadvertently marks it as \"public.\""},{"Method":"Automated Static Analysis - Binary or Bytecode","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tInter-application Flow Analysis","Effectiveness":"SOAR Partial"},{"Method":"Manual Static Analysis - Binary or Bytecode","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tBinary / Bytecode disassembler - then use manual analysis for vulnerabilities \u0026 anomalies","Effectiveness":"SOAR Partial"},{"Method":"Dynamic Analysis with Automated Results Interpretation","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tHost-based Vulnerability Scanners - Examine configuration for flaws, verifying that audit mechanisms work, ensure host configuration meets certain predefined criteria\n\t\tWeb Application Scanner\n\t\tWeb Services Scanner\n\t\tDatabase Scanners","Effectiveness":"SOAR Partial"},{"Method":"Dynamic Analysis with Manual Results Interpretation","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tHost Application Interface Scanner\n\t```\n\t\tCost effective for partial coverage:\n```\n\n\t\tFuzz Tester\n\t\tFramework-based Fuzzer\n\t\tAutomated Monitored Execution\n\t\tForced Path Execution","Effectiveness":"High"},{"Method":"Manual Static Analysis - Source Code","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tManual Source Code Review (not inspections)\n\t```\n\t\tCost effective for partial coverage:\n```\n\n\t\tFocused Manual Spotcheck - Focused manual analysis of source","Effectiveness":"High"},{"Method":"Automated Static Analysis - Source Code","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tContext-configured Source Code Weakness Analyzer","Effectiveness":"SOAR Partial"},{"Method":"Automated Static Analysis","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tConfiguration Checker","Effectiveness":"SOAR Partial"},{"Method":"Architecture or Design Review","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tFormal Methods / Correct-By-Construction\n\t```\n\t\tCost effective for partial coverage:\n```\n\n\t\tInspection (IEEE 1028 standard) (can apply to requirements, design, source code, etc.)","Effectiveness":"High"}],"PotentialMitigations":[{"Phase":["Implementation"],"Description":"When using a critical resource such as a configuration file, check to see if the resource has insecure permissions (such as being modifiable by any regular user) [REF-62], and generate an error or even exit the software if there is a possibility that the resource could have been modified by an unauthorized party."},{"Phase":["Architecture and Design"],"Description":"Divide the software into anonymous, normal, privileged, and administrative areas. Reduce the attack surface by carefully defining distinct user groups, privileges, and/or roles. Map these against data, functionality, and the related resources. Then set the permissions accordingly. This will allow you to maintain more fine-grained control over your resources. [REF-207]","Effectiveness":"Moderate","EffectivenessNotes":"This can be an effective strategy. However, in practice, it may be difficult or time consuming to define these areas when there are many different resources or user types, or if the applications features change rapidly."},{"MitigationID":"MIT-22","Phase":["Architecture and Design","Operation"],"Strategy":"Sandbox or Jail","Description":"\n\nRun the code in a \"jail\" or similar sandbox environment that enforces strict boundaries between the process and the operating system. This may effectively restrict which files can be accessed in a particular directory or which commands can be executed by the software.\n\n\nOS-level examples include the Unix chroot jail, AppArmor, and SELinux. In general, managed code may provide some protection. For example, java.io.FilePermission in the Java SecurityManager allows the software to specify restrictions on file operations.\n\n\nThis may not be a feasible solution, and it only limits the impact to the operating system; the rest of the application may still be subject to compromise.\n\n\nBe careful to avoid CWE-243 and other weaknesses related to jails.\n","Effectiveness":"Limited","EffectivenessNotes":"The effectiveness of this mitigation depends on the prevention capabilities of the specific sandbox or jail being used and might only help to reduce the scope of an attack, such as restricting the attacker to certain system calls or limiting the portion of the file system that can be accessed."},{"Phase":["Implementation","Installation"],"Description":"During program startup, explicitly set the default permissions or umask to the most restrictive setting possible. Also set the appropriate permissions during program installation. This will prevent you from inheriting insecure permissions from any user who installs or runs the program.","Effectiveness":"High"},{"Phase":["System Configuration"],"Description":"For all configuration files, executables, and libraries, make sure that they are only readable and writable by the software's administrator.","Effectiveness":"High"},{"Phase":["Documentation"],"Description":"Do not suggest insecure configuration changes in documentation, especially if those configurations can extend to resources and other programs that are outside the scope of the application."},{"Phase":["Installation"],"Description":"Do not assume that a system administrator will manually change the configuration to the settings that are recommended in the software's manual."},{"MitigationID":"MIT-37","Phase":["Operation","System Configuration"],"Strategy":"Environment Hardening","Description":"Ensure that the software runs properly under the United States Government Configuration Baseline (USGCB) [REF-199] or an equivalent hardening configuration guide, which many organizations use to limit the attack surface and potential risk of deployed software."},{"Phase":["Implementation","System Configuration","Operation"],"Description":"When storing data in the cloud (e.g., S3 buckets, Azure blobs, Google Cloud Storage, etc.), use the provider's controls to disable public access."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"The following code sets the umask of the process to 0 before creating a file and writing \"Hello world\" into the file."},{"Nature":"Bad","Language":"C","ExampleCode":"```\n\t#define OUTFILE \"hello.out\"\n\tumask(0);\n\tFILE *out;\n```\n/* Ignore link following (CWE-59) for brevity */* \n\t\n\tout = fopen(OUTFILE, \"w\");\n\tif (out) {\n\t```\n\t\tfprintf(out, \"hello world!\\n\");\n\t\tfclose(out);\n\t}\n```"},{"BodyText":"After running this program on a UNIX system, running the \"ls -l\" command might return the following output:"},{"Nature":"Result","ExampleCode":"```\n\t-rw-rw-rw- 1 username 13 Nov 24 17:58 hello.out\n```"},{"BodyText":"The \"rw-rw-rw-\" string indicates that the owner, group, and world (all users) can read the file and write to it."}]},{"Entries":[{"IntroText":"This code creates a home directory for a new user, and makes that user the owner of the directory. If the new directory cannot be owned by the user, the directory is deleted."},{"Nature":"Bad","Language":"PHP","ExampleCode":"```\n\tfunction createUserDir($username){\n\t\t$path = '/home/'.$username;\n\t\tif(!mkdir($path)){\n\t\t\treturn false;\n\t\t}\n\t\tif(!chown($path,$username)){\n\t\t\trmdir($path);\n\t\t\treturn false;\n\t\t}\n\t\treturn true;\n\t}\n```"},{"BodyText":"Because the optional \"mode\" argument is omitted from the call to mkdir(), the directory is created with the default permissions 0777. Simply setting the new user as the owner of the directory does not explicitly change the permissions of the directory, leaving it with the default. This default allows any user to read and write to the directory, allowing an attack on the user's files. The code also fails to change the owner group of the directory, which may result in access by unexpected groups."},{"BodyText":"This code may also be vulnerable to Path Traversal (CWE-22) attacks if an attacker supplies a non alphanumeric username."}]},{"Entries":[{"IntroText":"The following code snippet might be used as a monitor to periodically record whether a web site is alive. To ensure that the file can always be modified, the code uses chmod() to make the file world-writable."},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\t$fileName = \"secretFile.out\";\n\tif (-e $fileName) {\n\t\tchmod 0777, $fileName;\n\t}\n\tmy $outFH;\n\tif (! open($outFH, \"\u003e\u003e$fileName\")) {\n\t\tExitError(\"Couldn't append to $fileName: $!\");\n\t}\n\tmy $dateString = FormatCurrentTime();\n\tmy $status = IsHostAlive(\"cwe.mitre.org\");\n\tprint $outFH \"$dateString cwe status: $status!\\n\";\n\tclose($outFH);\n```"},{"BodyText":"The first time the program runs, it might create a new file that inherits the permissions from its environment. A file listing might look like:"},{"Nature":"Result","ExampleCode":"```\n\t-rw-r--r-- 1 username 13 Nov 24 17:58 secretFile.out\n```"},{"BodyText":"This listing might occur when the user has a default umask of 022, which is a common setting. Depending on the nature of the file, the user might not have intended to make it readable by everyone on the system."},{"BodyText":"The next time the program runs, however - and all subsequent executions - the chmod will set the file's permissions so that the owner, group, and world (all users) can read the file and write to it:"},{"Nature":"Result","ExampleCode":"```\n\t-rw-rw-rw- 1 username 13 Nov 24 17:58 secretFile.out\n```"},{"BodyText":"Perhaps the programmer tried to do this because a different process uses different permissions that might prevent the file from being updated."}]},{"Entries":[{"IntroText":"This program creates and reads from an admin file to determine privilege information."},{"BodyText":"If the admin file doesn't exist, the program will create one. In order to create the file, the program must have write privileges to write to the file. After the file is created, the permissions need to be changed to read only."},{"Nature":"Bad","Language":"Go","ExampleCode":"```\n\t const adminFile = \"/etc/admin-users\"\n\t func createAdminFileIfNotExists() error { \n\t\t file, err := os.Create(adminFile)\n\t\t if err != nil {\n\t\t\t return err \n\t\t }\n\t\t return nil\n\t }\n\t func changeModeOfAdminFile() error { \n\t\t fileMode := os.FileMode(0440)\n\t\t if err := os.Chmod(adminFile, fileMode); err != nil {\n\t\t\t return err \n\t\t }\n\t\t return nil\n\t }\n```"},{"BodyText":"os.Create will create a file with 0666 permissions before umask if the specified file does not exist. A typical umask of 0022 would result in the file having 0644 permissions. That is, the file would have world-writable and world-readable permissions."},{"BodyText":"In this scenario, it is advised to use the more customizable method of os.OpenFile with the os.O_WRONLY and os.O_CREATE flags specifying 0640 permissions to create the admin file."},{"BodyText":"This is because on a typical system where the umask is 0022, the perm 0640 applied in os.OpenFile will result in a file of 0620 where only the owner and group can write."}]},{"Entries":[{"IntroText":"The following command recursively sets world-readable permissions for a directory and all of its children:"},{"Nature":"Bad","Language":"Shell","ExampleCode":"```\n\tchmod -R ugo+r DIRNAME\n```"},{"BodyText":"If this command is run from a program, the person calling the program might not expect that all the files under the directory will be world-readable. If the directory is expected to contain private data, this could become a security problem."}]},{"ID":"DX-160","Entries":[{"IntroText":"The following Azure command updates the settings for a storage account:"},{"Nature":"Bad","Language":"Shell","ExampleCode":"```\n\taz storage account update --name \u003cstorage-account\u003e --resource-group \u003cresource-group\u003e --allow-blob-public-access true\n```"},{"BodyText":"However, \"Allow Blob Public Access\" is set to true, meaning that anonymous/public users can access blobs."},{"BodyText":"The command could be modified to disable \"Allow Blob Public Access\" by setting it to false."},{"Nature":"Good","Language":"Shell","ExampleCode":"```\n\taz storage account update --name \u003cstorage-account\u003e --resource-group \u003cresource-group\u003e --allow-blob-public-access false\n```"}]},{"ID":"DX-161","Entries":[{"IntroText":"The following Google Cloud Storage command gets the settings for a storage account named 'BUCKET_NAME':"},{"Nature":"Informative","Language":"Shell","ExampleCode":"```\n\t gsutil iam get gs://BUCKET_NAME\n```"},{"BodyText":"Suppose the command returns the following result:"},{"Nature":"Bad","Language":"JSON","ExampleCode":"{\n\n```\n\t \"bindings\":[{\n\t\t \"members\":[\n\t\t\t \"projectEditor: PROJECT-ID\",\n\t\t\t \"projectOwner: PROJECT-ID\" \n\t\t ],\n\t\t \"role\":\"roles/storage.legacyBucketOwner\"\n\t },\n\t {\n\t\t \"members\":[ \n\t\t\t \"allUsers\",\n\t\t\t \"projectViewer: PROJECT-ID\"\n\t\t\t ],\n\t\t\t \"role\":\"roles/storage.legacyBucketReader\"\n\t\t }\n\t ]\n }\n```"},{"BodyText":"This result includes the \"allUsers\" or IAM role added as members, causing this policy configuration to allow public access to cloud storage resources. There would be a similar concern if \"allAuthenticatedUsers\" was present."},{"BodyText":"The command could be modified to remove \"allUsers\" and/or \"allAuthenticatedUsers\" as follows:"},{"Nature":"Good","Language":"Shell","ExampleCode":"gsutil iam ch -d allUsers gs://BUCKET_NAME\n gsutil iam ch -d allAuthenticatedUsers gs://BUCKET_NAME"}]}],"ObservedExamples":[{"Reference":"CVE-2022-29527","Description":"Go application for cloud management creates a world-writable sudoers file that allows local attackers to inject sudo rules and escalate privileges to root by winning a race condition.","Link":"https://www.cve.org/CVERecord?id=CVE-2022-29527"},{"Reference":"CVE-2009-3482","Description":"Anti-virus product sets insecure \"Everyone: Full Control\" permissions for files under the \"Program Files\" folder, allowing attackers to replace executables with Trojan horses.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3482"},{"Reference":"CVE-2009-3897","Description":"Product creates directories with 0777 permissions at installation, allowing users to gain privileges and access a socket used for authentication.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3897"},{"Reference":"CVE-2009-3489","Description":"Photo editor installs a service with an insecure security descriptor, allowing users to stop or start the service, or execute commands as SYSTEM.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3489"},{"Reference":"CVE-2020-15708","Description":"socket created with insecure permissions","Link":"https://www.cve.org/CVERecord?id=CVE-2020-15708"},{"Reference":"CVE-2009-3289","Description":"Library function copies a file to a new target and uses the source file's permissions for the target, which is incorrect when the source file is a symbolic link, which typically has 0777 permissions.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3289"},{"Reference":"CVE-2009-0115","Description":"Device driver uses world-writable permissions for a socket file, allowing attackers to inject arbitrary commands.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-0115"},{"Reference":"CVE-2009-1073","Description":"LDAP server stores a cleartext password in a world-readable file.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-1073"},{"Reference":"CVE-2009-0141","Description":"Terminal emulator creates TTY devices with world-writable permissions, allowing an attacker to write to the terminals of other users.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-0141"},{"Reference":"CVE-2008-0662","Description":"VPN product stores user credentials in a registry key with \"Everyone: Full Control\" permissions, allowing attackers to steal the credentials.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-0662"},{"Reference":"CVE-2008-0322","Description":"Driver installs its device interface with \"Everyone: Write\" permissions.","Link":"https://www.cve.org/CVERecord?id=CVE-2008-0322"},{"Reference":"CVE-2009-3939","Description":"Driver installs a file with world-writable permissions.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3939"},{"Reference":"CVE-2009-3611","Description":"Product changes permissions to 0777 before deleting a backup; the permissions stay insecure for subsequent backups.","Link":"https://www.cve.org/CVERecord?id=CVE-2009-3611"},{"Reference":"CVE-2007-6033","Description":"Product creates a share with \"Everyone: Full Control\" permissions, allowing arbitrary program execution.","Link":"https://www.cve.org/CVERecord?id=CVE-2007-6033"},{"Reference":"CVE-2007-5544","Description":"Product uses \"Everyone: Full Control\" permissions for memory-mapped files (shared memory) in inter-process communication, allowing attackers to tamper with a session.","Link":"https://www.cve.org/CVERecord?id=CVE-2007-5544"},{"Reference":"CVE-2005-4868","Description":"Database product uses read/write permissions for everyone for its shared memory, allowing theft of credentials.","Link":"https://www.cve.org/CVERecord?id=CVE-2005-4868"},{"Reference":"CVE-2004-1714","Description":"Security product uses \"Everyone: Full Control\" permissions for its configuration files.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-1714"},{"Reference":"CVE-2001-0006","Description":"\"Everyone: Full Control\" permissions assigned to a mutex allows users to disable network connectivity.","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0006"},{"Reference":"CVE-2002-0969","Description":"Chain: database product contains buffer overflow that is only reachable through a .ini configuration file - which has \"Everyone: Full Control\" permissions.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0969"}],"TaxonomyMappings":[{"TaxonomyName":"The CERT Oracle Secure Coding Standard for Java (2011)","EntryID":"FIO03-J","EntryName":"Create files with appropriate access permission"},{"TaxonomyName":"The CERT Oracle Secure Coding Standard for Java (2011)","EntryID":"SEC01-J","EntryName":"Do not allow tainted variables in privileged blocks"},{"TaxonomyName":"The CERT Oracle Secure Coding Standard for Java (2011)","EntryID":"ENV03-J","EntryName":"Do not grant dangerous combinations of permissions"},{"TaxonomyName":"CERT C Secure Coding","EntryID":"FIO06-C","EntryName":"Create files with appropriate access permissions"}],"RelatedAttackPatterns":["1","122","127","17","180","206","234","60","61","62","642"],"References":[{"ExternalReferenceID":"REF-62","Section":"Chapter 9, \"File Permissions.\" Page 495","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"},{"ExternalReferenceID":"REF-207","Section":"Chapter 8, \"Access Control.\" Page 194","Authors":["John Viega","Gary McGraw"],"Title":"Building Secure Software: How to Avoid Security Problems the Right Way","Edition":"1st Edition","PublicationYear":"2002","Publisher":"Addison-Wesley"},{"ExternalReferenceID":"REF-594","Authors":["Jason Lam"],"Title":"Top 25 Series - Rank 21 - Incorrect Permission Assignment for Critical Response","PublicationYear":"2010","PublicationMonth":"03","PublicationDay":"24","Publisher":"SANS Software Security Institute","URL":"https://www.sans.org/blog/top-25-series-rank-21-incorrect-permission-assignment-for-critical-response","URLDate":"2025-07-29"},{"ExternalReferenceID":"REF-199","Authors":["NIST"],"Title":"United States Government Configuration Baseline (USGCB)","URL":"https://csrc.nist.gov/Projects/United-States-Government-Configuration-Baseline","URLDate":"2023-03-28"},{"ExternalReferenceID":"REF-1287","Section":"Details of Problematic Mappings","Authors":["MITRE"],"Title":"Supplemental Details - 2022 CWE Top 25","PublicationYear":"2022","PublicationMonth":"06","PublicationDay":"28","URL":"https://cwe.mitre.org/top25/archive/2022/2022_cwe_top25_supplemental.html#problematicMappingDetails","URLDate":"2024-11-17"},{"ExternalReferenceID":"REF-1307","Section":"Section 3.7","Authors":["Center for Internet Security"],"Title":"CIS Microsoft Azure Foundations Benchmark version 1.5.0","PublicationYear":"2022","PublicationMonth":"08","PublicationDay":"16","URL":"https://www.cisecurity.org/benchmark/azure","URLDate":"2023-01-19"},{"ExternalReferenceID":"REF-1327","Section":"Section 5.1","Authors":["Center for Internet Security"],"Title":"CIS Google Cloud Computing Platform Benchmark version 1.3.0","PublicationYear":"2022","PublicationMonth":"03","PublicationDay":"31","URL":"https://www.cisecurity.org/benchmark/google_cloud_computing_platform","URLDate":"2023-04-24"},{"ExternalReferenceID":"REF-1479","Authors":["Gregory Larsen","E. Kenneth Hong Fong","David A. Wheeler","Rama S. Moorthy"],"Title":"State-of-the-Art Resources (SOAR) for Software Vulnerability Detection, Test, and Evaluation","PublicationYear":"2014","PublicationMonth":"07","URL":"https://www.ida.org/-/media/feature/publications/s/st/stateoftheart-resources-soar-for-software-vulnerability-detection-test-and-evaluation/p-5061.ashx","URLDate":"2025-09-05"}],"MappingNotes":{"Usage":"Allowed-with-Review","Rationale":"While the name itself indicates an assignment of permissions for resources, this is often misused for vulnerabilities in which \"permissions\" are not checked, which is an \"authorization\" weakness (CWE-285 or descendants) within CWE's model [REF-1287].","Comments":"Closely analyze the specific mistake that is allowing the resource to be exposed, and perform a CWE mapping for that mistake.","Reasons":["Frequent Misuse"]},"Notes":[{"Type":"Maintenance","Note":"The relationships between privileges, permissions, and actors (e.g. users and groups) need further refinement within the Research view. One complication is that these concepts apply to two different pillars, related to control of resources (CWE-664) and protection mechanism failures (CWE-693)."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2008-09-08","SubmissionComment":"new weakness-focused entry for Research view.","SubmissionVersion":"1.0","SubmissionReleaseDate":"2008-09-09"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-01-12","ModificationComment":"updated Description, Likelihood_of_Exploit, Name, Potential_Mitigations, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-03-10","ModificationComment":"updated Potential_Mitigations, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-05-27","ModificationComment":"updated Name"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-12-28","ModificationComment":"updated Applicable_Platforms, Common_Consequences, Demonstrative_Examples, Detection_Factors, Modes_of_Introduction, Observed_Examples, Potential_Mitigations, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-02-16","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-04-05","ModificationComment":"updated Potential_Mitigations, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Common_Consequences, Detection_Factors, Potential_Mitigations, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-09-27","ModificationComment":"updated Potential_Mitigations, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-12-13","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-03-29","ModificationComment":"updated Demonstrative_Examples, Description, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-09-13","ModificationComment":"updated Potential_Mitigations, References, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated References, Related_Attack_Patterns, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-10-30","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2013-07-17","ModificationComment":"updated References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Detection_Factors, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-01-19","ModificationComment":"updated Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Likelihood_of_Exploit, Modes_of_Introduction, References, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated Related_Attack_Patterns, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-09-19","ModificationComment":"updated Maintenance_Notes, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Applicable_Platforms, Description, Detection_Factors, Modes_of_Introduction, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-12-10","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-07-20","ModificationComment":"updated Observed_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Demonstrative_Examples, Observed_Examples, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Applicable_Platforms, Description, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Demonstrative_Examples, Description, Potential_Mitigations, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-09-09","ModificationComment":"updated Detection_Factors, References","ModificationVersion":"4.18","ModificationReleaseDate":"2025-09-09"},{"Type":"Rename","PreviousEntryName":"Insecure Permission Assignment for Resource","Date":"2009-01-12"},{"Type":"Rename","PreviousEntryName":"Insecure Permission Assignment for Critical Resource","Date":"2009-05-27"}]}