{"ID":"754","Name":"Improper Check for Unusual or Exceptional Conditions","Abstraction":"Class","Structure":"Simple","Status":"Incomplete","Description":"The product does not check or incorrectly checks for unusual or exceptional conditions that are not expected to occur frequently during day to day operation of the product.","ExtendedDescription":"\n\nThe programmer may assume that certain events or conditions will never occur or do not need to be worried about, such as low memory conditions, lack of access to resources due to restrictive permissions, or misbehaving clients or components. However, attackers may intentionally trigger these unusual conditions, thus violating the programmer's assumptions, possibly introducing instability, incorrect behavior, or a vulnerability.\n\n\nNote that this entry is not exclusively about the use of exceptions and exception handling, which are mechanisms for both checking and handling unusual or unexpected conditions.\n","LikelihoodOfExploit":"Medium","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"703","ViewID":"1000","Ordinal":"Primary"},{"Nature":"CanPrecede","CweID":"416","ViewID":"1000","Ordinal":"Primary"}],"WeaknessOrdinalities":[{"Ordinality":"Primary"},{"Ordinality":"Resultant"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Not Technology-Specific","Prevalence":"Undetermined"}],"BackgroundDetails":["Many functions will return some value about the success of their actions. This will alert the program whether or not to handle any errors caused by that function."],"ModesOfIntroduction":[{"Phase":"Implementation","Note":"REALIZATION: This weakness is caused during implementation of an architectural security tactic."}],"CommonConsequences":[{"Scope":["Integrity","Availability"],"Impact":["DoS: Crash, Exit, or Restart","Unexpected State"],"Note":"The data which were produced as a result of a function call could be in a bad state upon return. If the return value is not checked, then this bad data may be used in operations, possibly leading to a crash or other unintended behaviors."}],"DetectionMethods":[{"Method":"Automated Static Analysis","Description":"Automated static analysis may be useful for detecting unusual conditions involving system resources or common programming idioms, but not for violations of business rules.","Effectiveness":"Moderate"},{"DetectionMethodID":"DM-12","Method":"Manual Dynamic Analysis","Description":"Identify error conditions that are not likely to occur during normal usage and trigger them. For example, run the program under low memory conditions, run with insufficient privileges or permissions, interrupt a transaction before it is completed, or disable connectivity to basic network services such as DNS. Monitor the software for any unexpected behavior. If you trigger an unhandled exception or similar error that was discovered and handled by the application's environment, it may still indicate unexpected conditions that were not handled by the application itself."}],"PotentialMitigations":[{"MitigationID":"MIT-3","Phase":["Requirements"],"Strategy":"Language Selection","Description":"\n\nUse a language that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid.\n\n\nChoose languages with features such as exception handling that force the programmer to anticipate unusual conditions that may generate exceptions. Custom exceptions may need to be developed to handle unusual business-logic conditions. Be careful not to pass sensitive exceptions back to the user (CWE-209, CWE-248).\n"},{"Phase":["Implementation"],"Description":"Check the results of all functions that return a value and verify that the value is expected.","Effectiveness":"High","EffectivenessNotes":"Checking the return value of the function will typically be sufficient, however beware of race conditions (CWE-362) in a concurrent environment."},{"Phase":["Implementation"],"Description":"If using exception handling, catch and throw specific exceptions instead of overly-general exceptions (CWE-396, CWE-397). Catch and handle exceptions as locally as possible so that exceptions do not propagate too far up the call stack (CWE-705). Avoid unchecked or uncaught exceptions where feasible (CWE-248).","Effectiveness":"High","EffectivenessNotes":"Using specific exceptions, and ensuring that exceptions are checked, helps programmers to anticipate and appropriately handle many unusual events that could occur."},{"MitigationID":"MIT-39","Phase":["Implementation"],"Description":"\n\nEnsure that error messages only contain minimal details that are useful to the intended audience and no one else. The messages need to strike the balance between being too cryptic (which can confuse users) or being too detailed (which may reveal more than intended). The messages should not reveal the methods that were used to determine the error. Attackers can use detailed information to refine or optimize their original attack, thereby increasing their chances of success.\n\n\nIf errors must be captured in some detail, record them in log messages, but consider what could occur if the log messages can be viewed by attackers. Highly sensitive information such as passwords should never be saved to log files.\n\n\nAvoid inconsistent messaging that might accidentally tip off an attacker about internal state, such as whether a user account exists or not.\n\n\nExposing additional information to a potential attacker in the context of an exceptional condition can help the attacker determine what attack vectors are most likely to succeed beyond DoS.\n"},{"MitigationID":"MIT-5","Phase":["Implementation"],"Strategy":"Input Validation","Description":"\n\nAssume all input is malicious. Use an \"accept known good\" input validation strategy, i.e., use a list of acceptable inputs that strictly conform to specifications. Reject any input that does not strictly conform to specifications, or transform it into something that does.\n\n\nWhen performing input validation, consider all potentially relevant properties, including length, type of input, the full range of acceptable values, missing or extra inputs, syntax, consistency across related fields, and conformance to business rules. As an example of business rule logic, \"boat\" may be syntactically valid because it only contains alphanumeric characters, but it is not valid if the input is only expected to contain colors such as \"red\" or \"blue.\"\n\n\nDo not rely exclusively on looking for malicious or malformed inputs. This is likely to miss at least one undesirable input, especially if the code's environment changes. This can give attackers enough room to bypass the intended validation. However, denylists can be useful for detecting potential attacks or determining which inputs are so malformed that they should be rejected outright.\n","EffectivenessNotes":"Performing extensive input validation does not help with handling unusual conditions, but it will minimize their occurrences and will make it more difficult for attackers to trigger them."},{"MitigationID":"MIT-38","Phase":["Architecture and Design","Implementation"],"Description":"If the program must fail, ensure that it fails gracefully (fails closed). There may be a temptation to simply let the program fail poorly in cases such as low memory conditions, but an attacker may be able to assert control before the software has fully exited. Alternately, an uncontrolled failure could cause cascading problems with other downstream components; for example, the program could send a signal to a downstream process so the process immediately knows that a problem has occurred and has a better chance of recovery."},{"Phase":["Architecture and Design"],"Description":"Use system limits, which should help to prevent resource exhaustion. However, the product should still handle low resource conditions since they may still occur."}],"DemonstrativeExamples":[{"ID":"DX-7","Entries":[{"IntroText":"Consider the following code segment:"},{"Nature":"Bad","Language":"C","ExampleCode":"```\n\tchar buf[10], cp_buf[10];\n\tfgets(buf, 10, stdin);\n\tstrcpy(cp_buf, buf);\n```"},{"BodyText":"The programmer expects that when fgets() returns, buf will contain a null-terminated string of length 9 or less. But if an I/O error occurs, fgets() will not null-terminate buf. Furthermore, if the end of the file is reached before any characters are read, fgets() returns without writing anything to buf. In both of these situations, fgets() signals that something unusual has happened by returning NULL, but in this code, the warning will not be noticed. The lack of a null terminator in buf can result in a buffer overflow in the subsequent call to strcpy()."}]},{"ID":"DX-8","Entries":[{"IntroText":"The following code does not check to see if memory allocation succeeded before attempting to use the pointer returned by malloc()."},{"Nature":"Bad","Language":"C","ExampleCode":"```\n\tbuf = (char*) malloc(req_size);\n\tstrncpy(buf, xfer, req_size);\n```"},{"BodyText":"The traditional defense of this coding error is: \"If my program runs out of memory, it will fail. It doesn't matter whether I handle the error or simply allow the program to die with a segmentation fault when it tries to dereference the null pointer.\" This argument ignores three important considerations:"},{"BodyText":"- Depending upon the type and size of the application, it may be possible to free memory that is being used elsewhere so that execution can continue.\n\n  - It is impossible for the program to perform a graceful exit if required. If the program is performing an atomic operation, it can leave the system in an inconsistent state.\n\n  - The programmer has lost the opportunity to record diagnostic information. Did the call to malloc() fail because req_size was too large or because there were too many requests being handled at the same time? Or was it caused by a memory leak that has built up over time? Without handling the error, there is no way to know."}]},{"ID":"DX-9","Entries":[{"IntroText":"The following examples read a file into a byte array."},{"Nature":"Bad","Language":"C#","ExampleCode":"```\n\tchar[] byteArray = new char[1024];\n\tfor (IEnumerator i=users.GetEnumerator(); i.MoveNext() ;i.Current()) {\n\t\tString userName = (String) i.Current();\n\t\tString pFileName = PFILE_ROOT + \"/\" + userName;\n\t\tStreamReader sr = new StreamReader(pFileName);\n\t\tsr.Read(byteArray,0,1024);//the file is always 1k bytes\n\t\tsr.Close();\n\t\tprocessPFile(userName, byteArray);\n\t}\n```"},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tFileInputStream fis;\n\tbyte[] byteArray = new byte[1024];\n\tfor (Iterator i=users.iterator(); i.hasNext();) {\n\t\t\tString userName = (String) i.next();\n\t\t\tString pFileName = PFILE_ROOT + \"/\" + userName;\n\t\t\tFileInputStream fis = new FileInputStream(pFileName);\n\t\t\tfis.read(byteArray); // the file is always 1k bytes\n\t\t\tfis.close();\n\t\t\tprocessPFile(userName, byteArray);\n```"},{"BodyText":"The code loops through a set of users, reading a private data file for each user. The programmer assumes that the files are always 1 kilobyte in size and therefore ignores the return value from Read(). If an attacker can create a smaller file, the program will recycle the remainder of the data from the previous user and treat it as though it belongs to the attacker."}]},{"ID":"DX-10","Entries":[{"IntroText":"The following code does not check to see if the string returned by getParameter() is null before calling the member function compareTo(), potentially causing a NULL dereference."},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tString itemName = request.getParameter(ITEM_NAME);\n\tif (itemName.compareTo(IMPORTANT_ITEM) == 0) {\n\t\t...\n\t}\n\t...\n```"},{"BodyText":"The following code does not check to see if the string returned by the Item property is null before calling the member function Equals(), potentially causing a NULL dereference."},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tString itemName = request.Item(ITEM_NAME);\n\tif (itemName.Equals(IMPORTANT_ITEM)) {\n\t\t...\n\t}\n\t...\n```"},{"BodyText":"The traditional defense of this coding error is: \"I know the requested value will always exist because.... If it does not exist, the program cannot perform the desired behavior so it doesn't matter whether I handle the error or simply allow the program to die dereferencing a null value.\" But attackers are skilled at finding unexpected paths through programs, particularly when exceptions are involved."}]},{"ID":"DX-11","Entries":[{"IntroText":"The following code shows a system property that is set to null and later dereferenced by a programmer who mistakenly assumes it will always be defined."},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tSystem.clearProperty(\"os.name\");\n\t...\n\tString os = System.getProperty(\"os.name\");\n\tif (os.equalsIgnoreCase(\"Windows 95\")) System.out.println(\"Not supported\");\n```"},{"BodyText":"The traditional defense of this coding error is: \"I know the requested value will always exist because.... If it does not exist, the program cannot perform the desired behavior so it doesn't matter whether I handle the error or simply allow the program to die dereferencing a null value.\" But attackers are skilled at finding unexpected paths through programs, particularly when exceptions are involved."}]},{"ID":"DX-12","Entries":[{"IntroText":"The following VB.NET code does not check to make sure that it has read 50 bytes from myfile.txt. This can cause DoDangerousOperation() to operate on an unexpected value."},{"Nature":"Bad","Language":"C#","ExampleCode":"```\n\tDim MyFile As New FileStream(\"myfile.txt\", FileMode.Open, FileAccess.Read, FileShare.Read)\n\tDim MyArray(50) As Byte\n\tMyFile.Read(MyArray, 0, 50)\n\tDoDangerousOperation(MyArray(20))\n```"},{"BodyText":"In .NET, it is not uncommon for programmers to misunderstand Read() and related methods that are part of many System.IO classes. The stream and reader classes do not consider it to be unusual or exceptional if only a small amount of data becomes available. These classes simply add the small amount of data to the return buffer, and set the return value to the number of bytes or characters read. There is no guarantee that the amount of data returned is equal to the amount of data requested."}]},{"ID":"DX-1","Entries":[{"IntroText":"This example takes an IP address from a user, verifies that it is well formed and then looks up the hostname and copies it into a buffer."},{"Nature":"Bad","Language":"C","ExampleCode":"```\n\tvoid host_lookup(char *user_supplied_addr){\n\t\t\tstruct hostent *hp;\n\t\t\tin_addr_t *addr;\n\t\t\tchar hostname[64];\n\t\t\tin_addr_t inet_addr(const char *cp);\n```\n/*routine that ensures user_supplied_addr is in the right format for conversion */* \n\t\t\t\n\t\t\tvalidate_addr_form(user_supplied_addr);\n\t\t\taddr = inet_addr(user_supplied_addr);\n\t\t\thp = gethostbyaddr( addr, sizeof(struct in_addr), AF_INET);\n\t\t\tstrcpy(hostname, hp-\u003eh_name);}"},{"BodyText":"If an attacker provides an address that appears to be well-formed, but the address does not resolve to a hostname, then the call to gethostbyaddr() will return NULL. Since the code does not check the return value from gethostbyaddr (CWE-252), a NULL pointer dereference (CWE-476) would then occur in the call to strcpy()."},{"BodyText":"Note that this code is also vulnerable to a buffer overflow (CWE-119)."}]},{"Entries":[{"IntroText":"In the following C/C++ example the method outputStringToFile opens a file in the local filesystem and outputs a string to the file. The input parameters output and filename contain the string to output to the file and the name of the file respectively."},{"Nature":"Bad","Language":"C++","ExampleCode":"```\n\tint outputStringToFile(char *output, char *filename) {\n\t\t\topenFileToWrite(filename);\n\t\t\twriteToFile(output);\n\t\t\tcloseFile(filename);\n\t}\n```"},{"BodyText":"However, this code does not check the return values of the methods openFileToWrite, writeToFile, closeFile to verify that the file was properly opened and closed and that the string was successfully written to the file. The return values for these methods should be checked to determine if the method was successful and allow for detection of errors or unexpected conditions as in the following example."},{"Nature":"Good","Language":"C++","ExampleCode":"```\n\tint outputStringToFile(char *output, char *filename) {\n\t\t\tint isOutput = SUCCESS;\n\t\t\tint isOpen = openFileToWrite(filename);\n\t\t\tif (isOpen == FAIL) {\n\t\t\t\tprintf(\"Unable to open file %s\", filename);\n\t\t\t\tisOutput = FAIL;\n\t\t\t}\n\t\t\telse {\n\t\t\t\t\tint isWrite = writeToFile(output);\n\t\t\t\t\tif (isWrite == FAIL) {\n\t\t\t\t\t\tprintf(\"Unable to write to file %s\", filename);\n\t\t\t\t\t\tisOutput = FAIL;\n\t\t\t\t\t}\n\t\t\t\t\tint isClose = closeFile(filename);\n\t\t\t\t\tif (isClose == FAIL)\n\t\t\t\t\t\tisOutput = FAIL;\n\t\t\t}\n\t\t\treturn isOutput;\n\t}\n```"}]},{"Entries":[{"IntroText":"In the following Java example the method readFromFile uses a FileReader object to read the contents of a file. The FileReader object is created using the File object readFile, the readFile object is initialized using the setInputFile method. The setInputFile method should be called before calling the readFromFile method."},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tprivate File readFile = null;\n\tpublic void setInputFile(String inputFile) {\n```\n// create readFile File object from string containing name of file* \n\t\t\t}\n\t\n\tpublic void readFromFile() {\n\t```\n\t\t\ttry {\n\t\t\t\t\treader = new FileReader(readFile);\n```\n// read input file* \n\t\t\t\t\t} catch (FileNotFoundException ex) {...}}"},{"BodyText":"However, the readFromFile method does not check to see if the readFile object is null, i.e. has not been initialized, before creating the FileReader object and reading from the input file. The readFromFile method should verify whether the readFile object is null and output an error message and raise an exception if the readFile object is null, as in the following code."},{"Nature":"Good","Language":"Java","ExampleCode":"```\n\tprivate File readFile = null;\n\tpublic void setInputFile(String inputFile) {\n```\n// create readFile File object from string containing name of file* \n\t\t\t}\n\t\n\tpublic void readFromFile() {\n\t```\n\t\t\ttry {\n\t\t\t\t\tif (readFile == null) {\n\t\t\t\t\t\tSystem.err.println(\"Input file has not been set, call setInputFile method before calling openInputFile\");\n\t\t\t\t\t\tthrow NullPointerException;\n\t\t\t\t\t}\n\t\t\t\t\treader = new FileReader(readFile);\n```\n// read input file* \n\t\t\t\t\t} catch (FileNotFoundException ex) {...}\n\t\t\tcatch (NullPointerException ex) {...}}"}]}],"ObservedExamples":[{"Reference":"CVE-2023-49286","Description":"Chain: function in web caching proxy does not correctly check a return value (CWE-253) leading to a reachable assertion (CWE-617)","Link":"https://www.cve.org/CVERecord?id=CVE-2023-49286"},{"Reference":"CVE-2007-3798","Description":"Unchecked return value leads to resultant integer overflow and code execution.","Link":"https://www.cve.org/CVERecord?id=CVE-2007-3798"},{"Reference":"CVE-2006-4447","Description":"Program does not check return value when invoking functions to drop privileges, which could leave users with higher privileges than expected by forcing those functions to fail.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-4447"},{"Reference":"CVE-2006-2916","Description":"Program does not check return value when invoking functions to drop privileges, which could leave users with higher privileges than expected by forcing those functions to fail.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-2916"}],"TaxonomyMappings":[{"TaxonomyName":"SEI CERT Perl Coding Standard","EntryID":"EXP31-PL","EntryName":"Do not suppress or ignore exceptions","MappingFit":"CWE More Abstract"},{"TaxonomyName":"ISA/IEC 62443","EntryID":"Part 4-2","EntryName":"Req CR 3.5"},{"TaxonomyName":"ISA/IEC 62443","EntryID":"Part 4-2","EntryName":"Req CR 3.7"}],"References":[{"ExternalReferenceID":"REF-62","Section":"Chapter 7, \"Program Building Blocks\" Page 341","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"},{"ExternalReferenceID":"REF-62","Section":"Chapter 1, \"Exceptional Conditions,\" Page 22","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"},{"ExternalReferenceID":"REF-44","Section":"\"Sin 11: Failure to Handle Errors Correctly.\" Page 183","Authors":["Michael Howard","David LeBlanc","John Viega"],"Title":"24 Deadly Sins of Software Security","Publication":"McGraw-Hill","PublicationYear":"2010"},{"ExternalReferenceID":"REF-622","Authors":["Frank Kim"],"Title":"Top 25 Series - Rank 15 - Improper Check for Unusual or Exceptional Conditions","PublicationYear":"2010","PublicationMonth":"03","PublicationDay":"15","Publisher":"SANS Software Security Institute","URL":"https://www.sans.org/blog/top-25-series-rank-15-improper-check-for-unusual-or-exceptional-conditions/","URLDate":"2023-04-07"}],"MappingNotes":{"Usage":"Allowed-with-Review","Rationale":"This CWE entry is a Class and might have Base-level children that would be more appropriate","Comments":"Examine children of this entry to see if there is a better fit","Reasons":["Abstraction"]},"Notes":[{"Type":"Relationship","Note":"Sometimes, when a return value can be used to indicate an error, an unchecked return value is a code-layer instance of a missing application-layer check for exceptional conditions. However, return values are not always needed to communicate exceptional conditions. For example, expiration of resources, values passed by reference, asynchronously modified data, sockets, etc. may indicate exceptional conditions without the use of a return value."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2009-03-03","SubmissionComment":"New entry for reorganization of CWE-703.","SubmissionVersion":"1.3","SubmissionReleaseDate":"2009-03-10"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-07-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-12-28","ModificationComment":"updated Applicable_Platforms, Likelihood_of_Exploit, Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-02-16","ModificationComment":"updated Background_Details, Common_Consequences, Demonstrative_Examples, Description, Detection_Factors, Name, Observed_Examples, Potential_Mitigations, References, Related_Attack_Patterns, Relationship_Notes, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-04-05","ModificationComment":"updated Demonstrative_Examples, Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Common_Consequences, Detection_Factors, Potential_Mitigations, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-09-27","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-12-13","ModificationComment":"updated Relationship_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-03-29","ModificationComment":"updated Description, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-27","ModificationComment":"updated Common_Consequences, Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-09-13","ModificationComment":"updated Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-10-30","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2013-02-21","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Demonstrative_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2015-12-07","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-01-19","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Modes_of_Introduction, References, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Description, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Potential_Mitigations, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-06-25","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-12-10","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-03-15","ModificationComment":"updated Demonstrative_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-07-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-04-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated References, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-02-29","ModificationComment":"updated Observed_Examples","ModificationVersion":"4.14","ModificationReleaseDate":"2024-02-29"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-07-16","ModificationComment":"updated Relationships","ModificationVersion":"4.15","ModificationReleaseDate":"2024-07-16"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-12-11","ModificationComment":"updated Applicable_Platforms, Relationships, Weakness_Ordinalities","ModificationVersion":"4.19","ModificationReleaseDate":"2025-12-11"},{"Type":"Contribution","ContributionName":"\"Mapping CWE to 62443\" Sub-Working Group","ContributionOrganization":"CWE-CAPEC ICS/OT SIG","ContributionDate":"2023-04-25","ContributionComment":"Suggested mappings to ISA/IEC 62443.","ContributionType":"Content"},{"Type":"Rename","PreviousEntryName":"Improper Check for Exceptional Conditions","Date":"2010-02-16"}]}