{"ID":"798","Name":"Use of Hard-coded Credentials","Abstraction":"Base","Structure":"Simple","Status":"Draft","Diagram":"/data/images/CWE-798-Diagram.png","Description":"The product contains hard-coded credentials, such as a password or cryptographic key.","ExtendedDescription":"\n\nThere are two main variations:\n\n\n  - Inbound: the product contains an authentication mechanism that checks the input credentials against a hard-coded set of credentials. In this variant, a default administration account is created, and a simple password is hard-coded into the product and associated with that account. This hard-coded password is the same for each installation of the product, and it usually cannot be changed or disabled by system administrators without manually modifying the program, or otherwise patching the product. It can also be difficult for the administrator to detect.\n\n  - Outbound: the product connects to another system or component, and it contains hard-coded credentials for connecting to that component. This variant applies to front-end systems that authenticate with a back-end service. The back-end service may require a fixed password that can be easily discovered. The programmer may simply hard-code those back-end credentials into the front-end product.\n\n","LikelihoodOfExploit":"High","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"1391","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"287","ViewID":"1003","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"344","ViewID":"1000"},{"Nature":"ChildOf","CweID":"671","ViewID":"1000"},{"Nature":"PeerOf","CweID":"257","ViewID":"1000"}],"WeaknessOrdinalities":[{"Ordinality":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"Mobile","Prevalence":"Undetermined"},{"Type":"Technology","Class":"ICS/OT","Prevalence":"Often"}],"ModesOfIntroduction":[{"Phase":"Architecture and Design","Note":"REALIZATION: This weakness is caused during implementation of an architectural security tactic."}],"CommonConsequences":[{"Scope":["Access Control"],"Impact":["Bypass Protection Mechanism"],"Note":"\n\nIf hard-coded passwords are used, it is almost certain that malicious users will gain access to the account in question.\n\n\nAny user of the product that hard-codes passwords may be able to extract the password. Client-side systems with hard-coded passwords pose even more of a threat, since the extraction of a password from a binary is usually very simple.\n"},{"Scope":["Integrity","Confidentiality","Availability","Access Control","Other"],"Impact":["Read Application Data","Gain Privileges or Assume Identity","Execute Unauthorized Code or Commands","Other"],"Note":"\n\nThis weakness can lead to the exposure of resources or functionality to unintended actors, possibly providing attackers with sensitive information or even execute arbitrary code.\n\n\nIf the password is ever discovered or published (a common occurrence on the Internet), then anybody with knowledge of this password can access the product. Finally, since all installations of the product will have the same password, even across different organizations, this enables massive attacks such as worms to take place.\n"}],"DetectionMethods":[{"Method":"Black Box","Description":"Credential storage in configuration files is findable using black box methods, but the use of hard-coded credentials for an incoming authentication routine typically involves an account that is not visible outside of the code.","Effectiveness":"Moderate"},{"Method":"Automated Static Analysis","Description":"Automated white box techniques have been published for detecting hard-coded credentials for incoming authentication, but there is some expert disagreement regarding their effectiveness and applicability to a broad range of methods."},{"Method":"Manual Static Analysis","Description":"This weakness may be detectable using manual code analysis. Unless authentication is decentralized and applied throughout the product, there can be sufficient time for the analyst to find incoming authentication routines and examine the program logic looking for usage of hard-coded credentials. Configuration files could also be analyzed.","EffectivenessNotes":"These may be more effective than strictly automated techniques. This is especially the case with weaknesses that are related to design and business rules."},{"Method":"Manual Dynamic Analysis","Description":"\n\nFor hard-coded credentials in incoming authentication: use monitoring tools that examine the product's process as it interacts with the operating system and the network. This technique is useful in cases when source code is unavailable, if the product was not developed by you, or if you want to verify that the build phase did not introduce any new weaknesses. Examples include debuggers that directly attach to the running process; system-call tracing utilities such as truss (Solaris) and strace (Linux); system activity monitors such as FileMon, RegMon, Process Monitor, and other Sysinternals utilities (Windows); and sniffers and protocol analyzers that monitor network traffic.\n\n\nAttach the monitor to the process and perform a login. Using call trees or similar artifacts from the output, examine the associated behaviors and see if any of them appear to be comparing the input to a fixed string or value.\n"},{"Method":"Automated Static Analysis - Binary or Bytecode","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tBytecode Weakness Analysis - including disassembler + source code weakness analysis\n\t\tBinary Weakness Analysis - including disassembler + source code weakness analysis","Effectiveness":"SOAR Partial"},{"Method":"Manual Static Analysis - Binary or Bytecode","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tBinary / Bytecode disassembler - then use manual analysis for vulnerabilities \u0026 anomalies","Effectiveness":"High"},{"Method":"Dynamic Analysis with Manual Results Interpretation","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tNetwork Sniffer\n\t\tForced Path Execution","Effectiveness":"SOAR Partial"},{"Method":"Manual Static Analysis - Source Code","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tFocused Manual Spotcheck - Focused manual analysis of source\n\t\tManual Source Code Review (not inspections)","Effectiveness":"High"},{"Method":"Automated Static Analysis - Source Code","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tSource code Weakness Analyzer\n\t\tContext-configured Source Code Weakness Analyzer","Effectiveness":"High"},{"Method":"Automated Static Analysis","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tCost effective for partial coverage:\n```\n\n\t\tConfiguration Checker","Effectiveness":"SOAR Partial"},{"Method":"Architecture or Design Review","Description":"\n\nAccording to SOAR [REF-1479], the following detection techniques may be useful:\n\n```\n\t\tHighly cost effective:\n```\n\n\t\tInspection (IEEE 1028 standard) (can apply to requirements, design, source code, etc.)\n\t\tFormal Methods / Correct-By-Construction","Effectiveness":"High"}],"PotentialMitigations":[{"Phase":["Architecture and Design"],"Description":"\n\nFor outbound authentication: store passwords, keys, and other credentials outside of the code in a strongly-protected, encrypted configuration file or database that is protected from access by all outsiders, including other local users on the same system. Properly protect the key (CWE-320). If you cannot use encryption to protect the file, then make sure that the permissions are as restrictive as possible [REF-7].\n\n\nIn Windows environments, the Encrypted File System (EFS) may provide some protection.\n"},{"Phase":["Architecture and Design"],"Description":"For inbound authentication: Rather than hard-code a default username and password, key, or other authentication credentials for first time logins, utilize a \"first login\" mode that requires the user to enter a unique strong password or key."},{"Phase":["Architecture and Design"],"Description":"If the product must contain hard-coded credentials or they cannot be removed, perform access control checks and limit which entities can access the feature that requires the hard-coded credentials. For example, a feature might only be enabled through the system console instead of through a network connection."},{"Phase":["Architecture and Design"],"Description":"\n\nFor inbound authentication using passwords: apply strong one-way hashes to passwords and store those hashes in a configuration file or database with appropriate access control. That way, theft of the file/database still requires the attacker to try to crack the password. When handling an incoming password during authentication, take the hash of the password and compare it to the saved hash.\n\n\nUse randomly assigned salts for each separate hash that is generated. This increases the amount of computation that an attacker needs to conduct a brute-force attack, possibly limiting the effectiveness of the rainbow table method.\n"},{"Phase":["Architecture and Design"],"Description":"\n\nFor front-end to back-end connections: Three solutions are possible, although none are complete.\n\n\n  - The first suggestion involves the use of generated passwords or keys that are changed automatically and must be entered at given time intervals by a system administrator. These passwords will be held in memory and only be valid for the time intervals.\n\n  - Next, the passwords or keys should be limited at the back end to only performing actions valid for the front end, as opposed to having full access.\n\n  - Finally, the messages sent should be tagged and checksummed with time sensitive values so as to prevent replay-style attacks.\n\n"}],"DemonstrativeExamples":[{"ID":"DX-13","Entries":[{"IntroText":"The following code uses a hard-coded password to connect to a database:"},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\t...\n\tDriverManager.getConnection(url, \"scott\", \"tiger\");\n\t...\n```"},{"BodyText":"This is an example of an external hard-coded password on the client-side of a connection. This code will run successfully, but anyone who has access to it will have access to the password. Once the program has shipped, there is no going back from the database user \"scott\" with a password of \"tiger\" unless the program is patched. A devious employee with access to this information can use it to break into the system. Even worse, if attackers have access to the bytecode for application, they can use the javap -c command to access the disassembled code, which will contain the values of the passwords used. The result of this operation might look something like the following for the example above:"},{"Nature":"Attack","ExampleCode":"```\n\tjavap -c ConnMngr.class\n\t\t22: ldc #36; //String jdbc:mysql://ixne.com/rxsql\n\t\t24: ldc #38; //String scott\n\t\t26: ldc #17; //String tiger\n```"}]},{"ID":"DX-14","Entries":[{"IntroText":"The following code is an example of an internal hard-coded password in the back-end:"},{"Nature":"Bad","Language":"C","ExampleCode":"```\n\tint VerifyAdmin(char *password) {\n\t\t\tif (strcmp(password, \"Mew!\")) {\n\t\t\t\t\t printf(\"Incorrect Password!\\n\");\n\t\t\t\t\treturn(0)\n\t\t\t}\n\t\t\tprintf(\"Entering Diagnostic Mode...\\n\");\n\t\t\treturn(1);\n\t}\n```"},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tint VerifyAdmin(String password) {\n\t\tif (!password.equals(\"Mew!\")) {\n\t\t\treturn(0)\n\t\t}\n\t\t//Diagnostic Mode\n\t\treturn(1);\n\t}\n```"},{"BodyText":"Every instance of this program can be placed into diagnostic mode with the same password. Even worse is the fact that if this program is distributed as a binary-only distribution, it is very difficult to change that password or disable this \"functionality.\""}]},{"ID":"DX-92","Entries":[{"IntroText":"The following code examples attempt to verify a password using a hard-coded cryptographic key."},{"Nature":"Bad","Language":"C","ExampleCode":"```\n\tint VerifyAdmin(char *password) {\n\t\t\tif (strcmp(password,\"68af404b513073584c4b6f22b6c63e6b\")) {\n\t\t\t\t\tprintf(\"Incorrect Password!\\n\");\n\t\t\t\t\treturn(0);\n\t\t\t}\n\t\t\tprintf(\"Entering Diagnostic Mode...\\n\");\n\t\t\treturn(1);\n\t}\n```"},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n\tpublic boolean VerifyAdmin(String password) {\n\t\tif (password.equals(\"68af404b513073584c4b6f22b6c63e6b\")) {\n\t\t\tSystem.out.println(\"Entering Diagnostic Mode...\");\n\t\t\treturn true;\n\t\t}\n\t\tSystem.out.println(\"Incorrect Password!\");\n\t\treturn false;\n```"},{"Nature":"Bad","Language":"C#","ExampleCode":"```\n\tint VerifyAdmin(String password) {\n\t\tif (password.Equals(\"68af404b513073584c4b6f22b6c63e6b\")) {\n\t\t\tConsole.WriteLine(\"Entering Diagnostic Mode...\");\n\t\t\treturn(1);\n\t\t}\n\t\tConsole.WriteLine(\"Incorrect Password!\");\n\t\treturn(0);\n\t}\n```"},{"BodyText":"The cryptographic key is within a hard-coded string value that is compared to the password. It is likely that an attacker will be able to read the key and compromise the system."}]},{"ID":"DX-43","Entries":[{"IntroText":"The following examples show a portion of properties and configuration files for Java and ASP.NET applications. The files include username and password information but they are stored in cleartext."},{"BodyText":"This Java example shows a properties file with a cleartext username / password pair."},{"Nature":"Bad","Language":"Java","ExampleCode":"```\n```\n# Java Web App ResourceBundle properties file* \n\t...\n\twebapp.ldap.username=secretUsername\n\twebapp.ldap.password=secretPassword\n\t..."},{"BodyText":"The following example shows a portion of a configuration file for an ASP.Net application. This configuration file includes username and password information for a connection to a database but the pair is stored in cleartext."},{"Nature":"Bad","Language":"ASP.NET","ExampleCode":"```\n\t...\n\t\u003cconnectionStrings\u003e\n\t\t\u003cadd name=\"ud_DEV\" connectionString=\"connectDB=uDB; uid=db2admin; pwd=password; dbalias=uDB;\" providerName=\"System.Data.Odbc\" /\u003e\n\t\u003c/connectionStrings\u003e\n\t...\n```"},{"BodyText":"Username and password information should not be included in a configuration file or a properties file in cleartext as this will allow anyone who can read the file access to the resource. If possible, encrypt this information."}]},{"ID":"DX-153","Entries":[{"IntroText":"In 2022, the OT:ICEFALL study examined products by 10 different Operational Technology (OT) vendors. The researchers reported 56 vulnerabilities and said that the products were \"insecure by design\" [REF-1283]. If exploited, these vulnerabilities often allowed adversaries to change how the products operated, ranging from denial of service to changing the code that the products executed. Since these products were often used in industries such as power, electrical, water, and others, there could even be safety implications."},{"BodyText":"Multiple vendors used hard-coded credentials in their OT products."}]}],"ObservedExamples":[{"Reference":"CVE-2022-40263","Description":"Software for biological cell analysus has hard-coded credentials, leading to leak of Protected Health Information (PHI)","Link":"https://www.cve.org/CVERecord?id=CVE-2022-40263"},{"Reference":"CVE-2022-29953","Description":"Condition Monitor firmware has a maintenance interface with hard-coded credentials","Link":"https://www.cve.org/CVERecord?id=CVE-2022-29953"},{"Reference":"CVE-2022-29960","Description":"Engineering Workstation uses hard-coded cryptographic keys that could allow for unathorized filesystem access and privilege escalation","Link":"https://www.cve.org/CVERecord?id=CVE-2022-29960"},{"Reference":"CVE-2022-29964","Description":"Distributed Control System (DCS) has hard-coded passwords for local shell access","Link":"https://www.cve.org/CVERecord?id=CVE-2022-29964"},{"Reference":"CVE-2022-30997","Description":"Programmable Logic Controller (PLC) has a maintenance service that uses undocumented, hard-coded credentials","Link":"https://www.cve.org/CVERecord?id=CVE-2022-30997"},{"Reference":"CVE-2022-30314","Description":"Firmware for a Safety Instrumented System (SIS) has hard-coded credentials for access to boot configuration","Link":"https://www.cve.org/CVERecord?id=CVE-2022-30314"},{"Reference":"CVE-2022-30271","Description":"Remote Terminal Unit (RTU) uses a hard-coded SSH private key that is likely to be used in typical deployments","Link":"https://www.cve.org/CVERecord?id=CVE-2022-30271"},{"Reference":"CVE-2021-37555","Description":"Telnet service for IoT feeder for dogs and cats has hard-coded password [REF-1288]","Link":"https://www.cve.org/CVERecord?id=CVE-2021-37555"},{"Reference":"CVE-2021-35033","Description":"Firmware for a WiFi router uses a hard-coded password for a BusyBox shell, allowing bypass of authentication through the UART port","Link":"https://www.cve.org/CVERecord?id=CVE-2021-35033"},{"Reference":"CVE-2012-3503","Description":"Installation script has a hard-coded secret token value, allowing attackers to bypass authentication","Link":"https://www.cve.org/CVERecord?id=CVE-2012-3503"},{"Reference":"CVE-2010-2772","Description":"SCADA system uses a hard-coded password to protect back-end database containing authorization information, exploited by Stuxnet worm","Link":"https://www.cve.org/CVERecord?id=CVE-2010-2772"},{"Reference":"CVE-2010-2073","Description":"FTP server library uses hard-coded usernames and passwords for three default accounts","Link":"https://www.cve.org/CVERecord?id=CVE-2010-2073"},{"Reference":"CVE-2010-1573","Description":"Chain: Router firmware uses hard-coded username and password for access to debug functionality, which can be used to execute arbitrary code","Link":"https://www.cve.org/CVERecord?id=CVE-2010-1573"},{"Reference":"CVE-2008-2369","Description":"Server uses hard-coded authentication key","Link":"https://www.cve.org/CVERecord?id=CVE-2008-2369"},{"Reference":"CVE-2008-0961","Description":"Backup product uses hard-coded username and password, allowing attackers to bypass authentication via the RPC interface","Link":"https://www.cve.org/CVERecord?id=CVE-2008-0961"},{"Reference":"CVE-2008-1160","Description":"Security appliance uses hard-coded password allowing attackers to gain root access","Link":"https://www.cve.org/CVERecord?id=CVE-2008-1160"},{"Reference":"CVE-2006-7142","Description":"Drive encryption product stores hard-coded cryptographic keys for encrypted configuration files in executable programs","Link":"https://www.cve.org/CVERecord?id=CVE-2006-7142"},{"Reference":"CVE-2005-3716","Description":"VoIP product uses hard-coded public credentials that cannot be changed, which allows attackers to obtain sensitive information","Link":"https://www.cve.org/CVERecord?id=CVE-2005-3716"},{"Reference":"CVE-2005-3803","Description":"VoIP product uses hard coded public and private SNMP community strings that cannot be changed, which allows remote attackers to obtain sensitive information","Link":"https://www.cve.org/CVERecord?id=CVE-2005-3803"},{"Reference":"CVE-2005-0496","Description":"Backup product contains hard-coded credentials that effectively serve as a back door, which allows remote attackers to access the file system","Link":"https://www.cve.org/CVERecord?id=CVE-2005-0496"}],"TaxonomyMappings":[{"TaxonomyName":"The CERT Oracle Secure Coding Standard for Java (2011)","EntryID":"MSC03-J","EntryName":"Never hard code sensitive information"},{"TaxonomyName":"OMG ASCSM","EntryID":"ASCSM-CWE-798"},{"TaxonomyName":"ISA/IEC 62443","EntryID":"Part 3-3","EntryName":"Req SR 1.5"},{"TaxonomyName":"ISA/IEC 62443","EntryID":"Part 4-2","EntryName":"Req CR 1.5"}],"RelatedAttackPatterns":["191","70"],"References":[{"ExternalReferenceID":"REF-7","Section":"Chapter 8, \"Key Management Issues\" Page 272","Authors":["Michael Howard","David LeBlanc"],"Title":"Writing Secure Code","Edition":"2nd Edition","PublicationYear":"2002","PublicationMonth":"12","PublicationDay":"04","Publisher":"Microsoft Press","URL":"https://www.microsoftpressstore.com/store/writing-secure-code-9780735617223"},{"ExternalReferenceID":"REF-729","Authors":["Johannes Ullrich"],"Title":"Top 25 Series - Rank 11 - Hardcoded Credentials","PublicationYear":"2010","PublicationMonth":"03","PublicationDay":"10","Publisher":"SANS Software Security Institute","URL":"https://www.sans.org/blog/top-25-series-rank-11-hardcoded-credentials/","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-172","Authors":["Chris Wysopal"],"Title":"Mobile App Top 10 List","PublicationYear":"2010","PublicationMonth":"12","PublicationDay":"13","URL":"https://www.veracode.com/blog/2010/12/mobile-app-top-10-list","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-962","Section":"ASCSM-CWE-798","Authors":["Object Management Group (OMG)"],"Title":"Automated Source Code Security Measure (ASCSM)","PublicationYear":"2016","PublicationMonth":"01","URL":"http://www.omg.org/spec/ASCSM/1.0/"},{"ExternalReferenceID":"REF-1283","Authors":["Forescout Vedere Labs"],"Title":"OT:ICEFALL: The legacy of \"insecure by design\" and its implications for certifications and risk management","PublicationYear":"2022","PublicationMonth":"06","PublicationDay":"20","URL":"https://www.forescout.com/resources/ot-icefall-report/"},{"ExternalReferenceID":"REF-1288","Authors":["Julia Lokrantz"],"Title":"Ethical hacking of a Smart Automatic Feed Dispenser","PublicationYear":"2021","PublicationMonth":"06","PublicationDay":"07","URL":"http://kth.diva-portal.org/smash/get/diva2:1561552/FULLTEXT01.pdf"},{"ExternalReferenceID":"REF-1304","Authors":["ICS-CERT"],"Title":"ICS Alert (ICS-ALERT-13-164-01): Medical Devices Hard-Coded Passwords","PublicationYear":"2013","PublicationMonth":"06","PublicationDay":"13","URL":"https://www.cisa.gov/news-events/ics-alerts/ics-alert-13-164-01","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-1479","Authors":["Gregory Larsen","E. Kenneth Hong Fong","David A. Wheeler","Rama S. Moorthy"],"Title":"State-of-the-Art Resources (SOAR) for Software Vulnerability Detection, Test, and Evaluation","PublicationYear":"2014","PublicationMonth":"07","URL":"https://www.ida.org/-/media/feature/publications/s/st/stateoftheart-resources-soar-for-software-vulnerability-detection-test-and-evaluation/p-5061.ashx","URLDate":"2025-09-05"}],"MappingNotes":{"Usage":"Allowed-with-Review","Rationale":"While this entry is at a Base level of abstraction, it has lower-level children that cover specific kinds of credentials.","Comments":"Consider children such as CWE-259 and CWE-321.","Reasons":["Abstraction","Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2010-01-15","SubmissionComment":"More abstract entry for hard-coded password and hard-coded cryptographic key.","SubmissionVersion":"1.8","SubmissionReleaseDate":"2010-02-16"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-04-05","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Common_Consequences, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-09-27","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-12-13","ModificationComment":"updated Description"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-27","ModificationComment":"updated Observed_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-09-13","ModificationComment":"updated Potential_Mitigations, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated Demonstrative_Examples, Related_Attack_Patterns, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-10-30","ModificationComment":"updated Demonstrative_Examples, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2013-02-21","ModificationComment":"updated Applicable_Platforms, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Demonstrative_Examples, Detection_Factors"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2015-12-07","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-01-19","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Causal_Nature, Demonstrative_Examples, Likelihood_of_Exploit, Modes_of_Introduction, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2018-03-27","ModificationComment":"updated References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated References, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-09-19","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Applicable_Platforms, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-12-10","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-03-15","ModificationComment":"updated Demonstrative_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-07-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-10-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-06-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Applicable_Platforms, Demonstrative_Examples, Observed_Examples, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description, Detection_Factors, Maintenance_Notes, Potential_Mitigations, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-02-29","ModificationComment":"updated Observed_Examples","ModificationVersion":"4.14","ModificationReleaseDate":"2024-02-29"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-07-16","ModificationComment":"updated Common_Consequences, Description, Diagram","ModificationVersion":"4.15","ModificationReleaseDate":"2024-07-16"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-11-19","ModificationComment":"updated Relationships","ModificationVersion":"4.16","ModificationReleaseDate":"2024-11-19"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-09-09","ModificationComment":"updated Detection_Factors, References","ModificationVersion":"4.18","ModificationReleaseDate":"2025-09-09"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-12-11","ModificationComment":"updated Maintenance_Notes, Mapping_Notes, Observed_Examples, Relationships","ModificationVersion":"4.19","ModificationReleaseDate":"2025-12-11"},{"Type":"Contribution","ContributionName":"\"Mapping CWE to 62443\" Sub-Working Group","ContributionOrganization":"CWE-CAPEC ICS/OT SIG","ContributionDate":"2023-01-24","ContributionComment":"Suggested mappings to ISA/IEC 62443.","ContributionType":"Content","ContributionVersion":"4.10","ContributionReleaseDate":"2023-01-31"},{"Type":"Contribution","ContributionName":"Abhi Balakrishnan","ContributionDate":"2024-02-29","ContributionComment":"Provided diagram to improve CWE usability","ContributionType":"Content","ContributionVersion":"4.15","ContributionReleaseDate":"2024-07-16"}]}