{"ID":"88","Name":"Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')","Abstraction":"Base","Structure":"Simple","Status":"Draft","Description":"The product constructs a string for a command to be executed by a separate component\nin another control sphere, but it does not properly delimit the\nintended arguments, options, or switches within that command string.","ExtendedDescription":"\n\nWhen creating commands using interpolation into a string, developers may assume that only the arguments/options that they specify will be processed. This assumption may be even stronger when the programmer has encoded the command in a way that prevents separate commands from being provided maliciously, e.g. in the case of shell metacharacters. When constructing the command, the developer may use whitespace or other delimiters that are required to separate arguments when the command. However, if an attacker can provide an untrusted input that contains argument-separating delimiters, then the resulting command will have more arguments than intended by the developer. The attacker may then be able to change the behavior of the command. Depending on the functionality supported by the extraneous arguments, this may have security-relevant consequences.\n","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"77","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"74","ViewID":"1003","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"77","ViewID":"1305","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"77","ViewID":"1340","Ordinal":"Primary"}],"WeaknessOrdinalities":[{"Ordinality":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Language","Name":"PHP","Prevalence":"Often"}],"ModesOfIntroduction":[{"Phase":"Implementation","Note":"REALIZATION: This weakness is caused during implementation of an architectural security tactic."}],"CommonConsequences":[{"Scope":["Confidentiality","Integrity","Availability","Other"],"Impact":["Execute Unauthorized Code or Commands","Alter Execution Logic","Read Application Data","Modify Application Data"],"Note":"An attacker could include arguments that allow unintended commands or code to be executed, allow sensitive data to be read or modified or could cause other unintended behavior."}],"DetectionMethods":[{"DetectionMethodID":"DM-14","Method":"Automated Static Analysis","Description":"Automated static analysis, commonly referred to as Static Application Security Testing (SAST), can find some instances of this weakness by analyzing source code (or binary/compiled code) without having to execute it. Typically, this is done by building a model of data flow and control flow, then searching for potentially-vulnerable patterns that connect \"sources\" (origins of input) with \"sinks\" (destinations where the data interacts with external components, a lower layer such as the OS, etc.)","Effectiveness":"High"}],"PotentialMitigations":[{"Phase":["Implementation"],"Strategy":"Parameterization","Description":"Where possible, avoid building a single string that contains the command and its arguments. Some languages or frameworks have functions that support specifying independent arguments, e.g. as an array, which is used to automatically perform the appropriate quoting or escaping while building the command. For example, in PHP, escapeshellarg() can be used to escape a single argument to system(), or exec() can be called with an array of arguments. In C, code can often be refactored from using system() - which accepts a single string - to using exec(), which requires separate function arguments for each parameter.","Effectiveness":"High"},{"Phase":["Architecture and Design"],"Strategy":"Input Validation","Description":"Understand all the potential areas where untrusted inputs can enter your product: parameters or arguments, cookies, anything read from the network, environment variables, request headers as well as content, URL components, e-mail, files, databases, and any external systems that provide data to the application. Perform input validation at well-defined interfaces."},{"MitigationID":"MIT-5","Phase":["Implementation"],"Strategy":"Input Validation","Description":"\n\nAssume all input is malicious. Use an \"accept known good\" input validation strategy, i.e., use a list of acceptable inputs that strictly conform to specifications. Reject any input that does not strictly conform to specifications, or transform it into something that does.\n\n\nWhen performing input validation, consider all potentially relevant properties, including length, type of input, the full range of acceptable values, missing or extra inputs, syntax, consistency across related fields, and conformance to business rules. As an example of business rule logic, \"boat\" may be syntactically valid because it only contains alphanumeric characters, but it is not valid if the input is only expected to contain colors such as \"red\" or \"blue.\"\n\n\nDo not rely exclusively on looking for malicious or malformed inputs. This is likely to miss at least one undesirable input, especially if the code's environment changes. This can give attackers enough room to bypass the intended validation. However, denylists can be useful for detecting potential attacks or determining which inputs are so malformed that they should be rejected outright.\n"},{"Phase":["Implementation"],"Description":"Directly convert your input type into the expected data type, such as using a conversion function that translates a string into a number. After converting to the expected data type, ensure that the input's values fall within the expected range of allowable values and that multi-field consistencies are maintained."},{"Phase":["Implementation"],"Description":"\n\nInputs should be decoded and canonicalized to the application's current internal representation before being validated (CWE-180, CWE-181). Make sure that your application does not inadvertently decode the same input twice (CWE-174). Such errors could be used to bypass allowlist schemes by introducing dangerous inputs after they have been checked. Use libraries such as the OWASP ESAPI Canonicalization control.\n\n\nConsider performing repeated canonicalization until your input does not change any more. This will avoid double-decoding and similar scenarios, but it might inadvertently modify inputs that are allowed to contain properly-encoded dangerous content.\n"},{"Phase":["Implementation"],"Description":"When exchanging data between components, ensure that both components are using the same character encoding. Ensure that the proper encoding is applied at each interface. Explicitly set the encoding you are using whenever the protocol allows you to do so."},{"Phase":["Implementation"],"Description":"When your application combines data from multiple sources, perform the validation after the sources have been combined. The individual data elements may pass the validation step but violate the intended restrictions after they have been combined."},{"Phase":["Testing"],"Description":"Use automated static analysis tools that target this type of weakness. Many modern techniques use data flow analysis to minimize the number of false positives. This is not a perfect solution, since 100% accuracy and coverage are not feasible."},{"Phase":["Testing"],"Description":"Use dynamic tools and techniques that interact with the product using large test suites with many diverse inputs, such as fuzz testing (fuzzing), robustness testing, and fault injection. The product's operation may slow down, but it should not become unstable, crash, or generate incorrect results."}],"DemonstrativeExamples":[{"ID":"DX-150","Entries":[{"IntroText":"Consider the following program. It intends to perform an \"ls -l\" on an input filename. The validate_name() subroutine performs validation on the input to make sure that only alphanumeric and \"-\" characters are allowed, which avoids path traversal (CWE-22) and OS command injection (CWE-78) weaknesses. Only filenames like \"abc\" or \"d-e-f\" are intended to be allowed."},{"Nature":"Bad","Language":"Perl","ExampleCode":"```\n\t my $arg = GetArgument(\"filename\");\n\t do_listing($arg);\n\t sub do_listing {\n\t\t my($fname) = @_;\n\t\t if (! validate_name($fname)) {\n\t\t\t print \"Error: name is not well-formed!\\n\";\n\t\t\t return;\n\t\t }\n```\n# build command* \n\t\t my $cmd = \"/bin/ls -l $fname\";\n\t\t system($cmd);\n\t\t } \n\t\n\t sub validate_name {\n\t\n\t```\n\t\t my($name) = @_;\n\t\t if ($name =~ /^[\\w\\-]+$/) {\n\t\t\t return(1);\n\t\t }\n\t\t else {\n\t\t\t return(0);\n\t\t }\n\t } \n```"},{"BodyText":"However, validate_name() allows filenames that begin with a \"-\". An adversary could supply a filename like \"-aR\", producing the \"ls -l -aR\" command (CWE-88), thereby getting a full recursive listing of the entire directory and all of its sub-directories.\n\n\nThere are a couple possible mitigations for this weakness. One would be to refactor the code to avoid using system() altogether, instead relying on internal functions.\n\n\nAnother option could be to add a \"--\" argument to the ls command, such as \"ls -l --\", so that any remaining arguments are treated as filenames, causing any leading \"-\" to be treated as part of a filename instead of another option.\n\n\nAnother fix might be to change the regular expression used in validate_name to force the first character of the filename to be a letter or number, such as:"},{"Nature":"Good","Language":"Perl","ExampleCode":"```\n\t if ($name =~ /^\\w[\\w\\-]+$/) ... \n```"}]},{"Entries":[{"IntroText":"CVE-2016-10033 / [REF-1249] provides a useful real-world example of this weakness within PHPMailer."},{"BodyText":"The program calls PHP's mail() function to compose and send mail. The fifth argument to mail() is a set of parameters. The program intends to provide a \"-fSENDER\" parameter, where SENDER is expected to be a well-formed email address. The program has already validated the e-mail address before invoking mail(), but there is a lot of flexibility in what constitutes a well-formed email address, including whitespace. With some additional allowed characters to perform some escaping, the adversary can specify an additional \"-o\" argument (listing an output file) and a \"-X\" argument (giving a program to execute). Additional details for this kind of exploit are in [REF-1250]."}]}],"ObservedExamples":[{"Reference":"CVE-2022-36069","Description":"Python-based dependency management tool avoids OS command injection when generating Git commands but allows injection of optional arguments with input beginning with a dash (CWE-88), potentially allowing for code execution.","Link":"https://www.cve.org/CVERecord?id=CVE-2022-36069"},{"Reference":"CVE-1999-0113","Description":"Canonical Example - \"-froot\" argument is passed on to another program, where the \"-f\" causes execution as user \"root\"","Link":"https://www.cve.org/CVERecord?id=CVE-1999-0113"},{"Reference":"CVE-2001-0150","Description":"Web browser executes Telnet sessions using command line arguments that are specified by the web site, which could allow remote attackers to execute arbitrary commands.","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0150"},{"Reference":"CVE-2001-0667","Description":"Web browser allows remote attackers to execute commands by spawning Telnet with a log file option on the command line and writing arbitrary code into an executable file which is later executed.","Link":"https://www.cve.org/CVERecord?id=CVE-2001-0667"},{"Reference":"CVE-2002-0985","Description":"Argument injection vulnerability in the mail function for PHP may allow attackers to bypass safe mode restrictions and modify command line arguments to the MTA (e.g. sendmail) possibly executing commands.","Link":"https://www.cve.org/CVERecord?id=CVE-2002-0985"},{"Reference":"CVE-2003-0907","Description":"Help and Support center in windows does not properly validate HCP URLs, which allows remote attackers to execute arbitrary code via quotation marks in an \"hcp://\" URL.","Link":"https://www.cve.org/CVERecord?id=CVE-2003-0907"},{"Reference":"CVE-2004-0121","Description":"Mail client does not sufficiently filter parameters of mailto: URLs when using them as arguments to mail executable, which allows remote attackers to execute arbitrary programs.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-0121"},{"Reference":"CVE-2004-0473","Description":"Web browser doesn't filter \"-\" when invoking various commands, allowing command-line switches to be specified.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-0473"},{"Reference":"CVE-2004-0480","Description":"Mail client allows remote attackers to execute arbitrary code via a URI that uses a UNC network share pathname to provide an alternate configuration file.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-0480"},{"Reference":"CVE-2004-0489","Description":"SSH URI handler for web browser allows remote attackers to execute arbitrary code or conduct port forwarding via the a command line option.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-0489"},{"Reference":"CVE-2004-0411","Description":"Web browser doesn't filter \"-\" when invoking various commands, allowing command-line switches to be specified.","Link":"https://www.cve.org/CVERecord?id=CVE-2004-0411"},{"Reference":"CVE-2005-4699","Description":"Argument injection vulnerability in TellMe 1.2 and earlier allows remote attackers to modify command line arguments for the Whois program and obtain sensitive information via \"--\" style options in the q_Host parameter.","Link":"https://www.cve.org/CVERecord?id=CVE-2005-4699"},{"Reference":"CVE-2006-1865","Description":"Beagle before 0.2.5 can produce certain insecure command lines to launch external helper applications while indexing, which allows attackers to execute arbitrary commands. NOTE: it is not immediately clear whether this issue involves argument injection, shell metacharacters, or other issues.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-1865"},{"Reference":"CVE-2006-2056","Description":"Argument injection vulnerability in Internet Explorer 6 for Windows XP SP2 allows user-assisted remote attackers to modify command line arguments to an invoked mail client via \" (double quote) characters in a mailto: scheme handler, as demonstrated by launching Microsoft Outlook with an arbitrary filename as an attachment. NOTE: it is not clear whether this issue is implementation-specific or a problem in the Microsoft API.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-2056"},{"Reference":"CVE-2006-2057","Description":"Argument injection vulnerability in Mozilla Firefox 1.0.6 allows user-assisted remote attackers to modify command line arguments to an invoked mail client via \" (double quote) characters in a mailto: scheme handler, as demonstrated by launching Microsoft Outlook with an arbitrary filename as an attachment. NOTE: it is not clear whether this issue is implementation-specific or a problem in the Microsoft API.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-2057"},{"Reference":"CVE-2006-2058","Description":"Argument injection vulnerability in Avant Browser 10.1 Build 17 allows user-assisted remote attackers to modify command line arguments to an invoked mail client via \" (double quote) characters in a mailto: scheme handler, as demonstrated by launching Microsoft Outlook with an arbitrary filename as an attachment. NOTE: it is not clear whether this issue is implementation-specific or a problem in the Microsoft API.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-2058"},{"Reference":"CVE-2006-2312","Description":"Argument injection vulnerability in the URI handler in Skype 2.0.*.104 and 2.5.*.0 through 2.5.*.78 for Windows allows remote authorized attackers to download arbitrary files via a URL that contains certain command-line switches.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-2312"},{"Reference":"CVE-2006-3015","Description":"Argument injection vulnerability in WinSCP 3.8.1 build 328 allows remote attackers to upload or download arbitrary files via encoded spaces and double-quote characters in a scp or sftp URI.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-3015"},{"Reference":"CVE-2006-4692","Description":"Argument injection vulnerability in the Windows Object Packager (packager.exe) in Microsoft Windows XP SP1 and SP2 and Server 2003 SP1 and earlier allows remote user-assisted attackers to execute arbitrary commands via a crafted file with a \"/\" (slash) character in the filename of the Command Line property, followed by a valid file extension, which causes the command before the slash to be executed, aka \"Object Packager Dialogue Spoofing Vulnerability.\"","Link":"https://www.cve.org/CVERecord?id=CVE-2006-4692"},{"Reference":"CVE-2006-6597","Description":"Argument injection vulnerability in HyperAccess 8.4 allows user-assisted remote attackers to execute arbitrary vbscript and commands via the /r option in a telnet:// URI, which is configured to use hawin32.exe.","Link":"https://www.cve.org/CVERecord?id=CVE-2006-6597"},{"Reference":"CVE-2007-0882","Description":"Argument injection vulnerability in the telnet daemon (in.telnetd) in Solaris 10 and 11 (SunOS 5.10 and 5.11) misinterprets certain client \"-f\" sequences as valid requests for the login program to skip authentication, which allows remote attackers to log into certain accounts, as demonstrated by the bin account.","Link":"https://www.cve.org/CVERecord?id=CVE-2007-0882"},{"Reference":"CVE-2001-1246","Description":"Language interpreter's mail function accepts another argument that is concatenated to a string used in a dangerous popen() call. Since there is no neutralization of this argument, both OS Command Injection (CWE-78) and Argument Injection (CWE-88) are possible.","Link":"https://www.cve.org/CVERecord?id=CVE-2001-1246"},{"Reference":"CVE-2019-13475","Description":"Argument injection allows execution of arbitrary commands by injecting a \"-exec\" option, which is executed by the command.","Link":"https://www.cve.org/CVERecord?id=CVE-2019-13475"},{"Reference":"CVE-2016-10033","Description":"Argument injection in mail-processing function allows writing unxpected files and executing programs using tecnically-valid email addresses that insert \"-o\" and \"-X\" switches.","Link":"https://www.cve.org/CVERecord?id=CVE-2016-10033"}],"FunctionalAreas":["Program Invocation"],"AffectedResources":["System Process"],"TaxonomyMappings":[{"TaxonomyName":"PLOVER","EntryName":"Argument Injection or Modification"},{"TaxonomyName":"CERT C Secure Coding","EntryID":"ENV03-C","EntryName":"Sanitize the environment when invoking external programs"},{"TaxonomyName":"CERT C Secure Coding","EntryID":"ENV33-C","EntryName":"Do not call system()","MappingFit":"Imprecise"},{"TaxonomyName":"CERT C Secure Coding","EntryID":"STR02-C","EntryName":"Sanitize data passed to complex subsystems"},{"TaxonomyName":"WASC","EntryID":"30","EntryName":"Mail Command Injection"}],"RelatedAttackPatterns":["137","174","41","460","88"],"References":[{"ExternalReferenceID":"REF-859","Authors":["Steven Christey"],"Title":"Argument injection issues","URL":"https://seclists.org/bugtraq/2007/Feb/234ed","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-62","Section":"Chapter 10, \"The Argument Array\", Page 567","Authors":["Mark Dowd","John McDonald","Justin Schuh"],"Title":"The Art of Software Security Assessment","Edition":"1st Edition","PublicationYear":"2006","Publisher":"Addison Wesley"},{"ExternalReferenceID":"REF-1030","Authors":["Eldar Marcussen"],"Title":"Security issues with using PHP's escapeshellarg","PublicationYear":"2013","PublicationMonth":"11","PublicationDay":"13","URL":"https://baesystemsai.blogspot.com/2013/11/security-issues-with-using-phps.html"},{"ExternalReferenceID":"REF-1249","Authors":["Dawid Golunski"],"Title":"PHPMailer \u003c 5.2.18 Remote Code Execution [CVE-2016-10033]","PublicationYear":"2016","PublicationMonth":"12","PublicationDay":"25","URL":"https://legalhackers.com/advisories/PHPMailer-Exploit-Remote-Code-Exec-CVE-2016-10033-Vuln.html"},{"ExternalReferenceID":"REF-1250","Authors":["Dawid Golunski"],"Title":"Pwning PHP mail() function For Fun And RCE","PublicationYear":"2017","PublicationMonth":"05","PublicationDay":"03","URL":"https://exploitbox.io/paper/Pwning-PHP-Mail-Function-For-Fun-And-RCE.html"}],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"Notes":[{"Type":"Relationship","Note":"At one layer of abstraction, this can overlap other weaknesses that have whitespace problems, e.g. injection of javascript into attributes of HTML tags."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"PLOVER","SubmissionDate":"2006-07-19","SubmissionVersion":"Draft 3","SubmissionReleaseDate":"2006-07-19"},{"Type":"Modification","ModificationName":"Eric Dalci","ModificationOrganization":"Cigital","ModificationDate":"2008-07-01","ModificationComment":"updated Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2008-09-08","ModificationComment":"updated Relationships, Other_Notes, Taxonomy_Mappings, Weakness_Ordinalities"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2008-11-24","ModificationComment":"updated Observed_Examples, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-07-27","ModificationComment":"updated Other_Notes, Relationship_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2009-10-29","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-02-16","ModificationComment":"updated Potential_Mitigations, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-04-05","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-06-21","ModificationComment":"updated Observed_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2010-09-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-06-01","ModificationComment":"updated Common_Consequences"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2011-09-13","ModificationComment":"updated Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-05-11","ModificationComment":"updated Common_Consequences, Demonstrative_Examples, Observed_Examples, References, Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2012-10-30","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-06-23","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2014-07-30","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2015-12-07","ModificationComment":"updated Demonstrative_Examples, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2017-11-08","ModificationComment":"updated Applicable_Platforms, Causal_Nature, Modes_of_Introduction, Relationships, Taxonomy_Mappings"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2018-03-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-01-03","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-06-20","ModificationComment":"updated Related_Attack_Patterns, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-09-19","ModificationComment":"updated Description, Name, References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2019-09-23","ModificationComment":"updated Description, Name, Observed_Examples, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated Potential_Mitigations, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-06-25","ModificationComment":"updated Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-12-10","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-10-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-04-28","ModificationComment":"updated Applicable_Platforms, Demonstrative_Examples, Observed_Examples, References"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Observed_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-01-31","ModificationComment":"updated Description, Potential_Mitigations"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Description, Detection_Factors, References, Relationships, Time_of_Introduction"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2024-07-16","ModificationComment":"updated Observed_Examples","ModificationVersion":"4.15","ModificationReleaseDate":"2024-07-16"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2025-09-09","ModificationComment":"updated Functional_Areas","ModificationVersion":"4.18","ModificationReleaseDate":"2025-09-09"},{"Type":"Contribution","ContributionName":"Anonymous External Contributor","ContributionDate":"2021-05-28","ContributionComment":"Identified inappropriate demonstrative example, suggested new observed example, applicable language.","ContributionType":"Feedback"},{"Type":"Rename","PreviousEntryName":"Argument Injection or Modification","Date":"2019-09-19"},{"Type":"Rename","PreviousEntryName":"Improper Delimitation of Arguments in a Command ('Argument Injection')","Date":"2019-09-23"}]}