{"ID":"1178","Name":"Weaknesses Addressed by the SEI CERT Perl Coding Standard","Type":"Graph","Status":"Stable","Objective":"CWE entries in this view (graph) are fully or partially eliminated by following the guidance presented in the online wiki that reflects that current rules and recommendations of the SEI CERT Perl Coding Standard.","Audience":[{"Type":"Software Developers","Description":"By following the SEI CERT Perl Coding Standard, developers will be able to fully or partially prevent the weaknesses that are identified in this view. In addition, developers can use a CWE coverage graph to determine which weaknesses are not directly addressed by the standard, which will help identify and resolve remaining gaps in training, tool acquisition, or other approaches for reducing weaknesses."},{"Type":"Product Customers","Description":"If a software developer claims to be following the SEI CERT Perl Coding Standard, then customers can search for the weaknesses in this view in order to formulate independent evidence of that claim."},{"Type":"Educators","Description":"Educators can use this view in multiple ways. For example, if there is a focus on teaching weaknesses, the educator could link them to the relevant Secure Coding Standard."}],"Members":[{"CweID":"1179","ViewID":"1178"},{"CweID":"1180","ViewID":"1178"},{"CweID":"1181","ViewID":"1178"},{"CweID":"1182","ViewID":"1178"},{"CweID":"1183","ViewID":"1178"},{"CweID":"1184","ViewID":"1178"},{"CweID":"1185","ViewID":"1178"},{"CweID":"1186","ViewID":"1178"}],"References":[{"ExternalReferenceID":"REF-1011"}],"MappingNotes":{"Usage":"Prohibited","Rationale":"This entry is a View. Views are not weaknesses and therefore inappropriate to describe the root causes of vulnerabilities.","Comments":"Use this View or other Views to search and navigate for the appropriate weakness.","Reasons":["View"]},"Notes":[{"Type":"Relationship","Note":"The relationships in this view were determined based on specific statements within the rules from the standard. Not all rules have direct relationships to individual weaknesses, although they likely have chaining relationships in specific circumstances."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2019-01-08","SubmissionVersion":"3.3","SubmissionReleaseDate":"2019-06-20"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-02-24","ModificationComment":"updated View_Audience"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}