{"ID":"1344","Name":"Weaknesses in OWASP Top Ten (2021)","Type":"Graph","Status":"Incomplete","Objective":"CWE entries in this view (graph) are associated with the OWASP Top Ten, as released in 2021.","Audience":[{"Type":"Software Developers","Description":"This view outlines the most important issues as identified by the OWASP Top Ten (2021 version), providing a good starting point for web application developers who want to code more securely."},{"Type":"Product Customers","Description":"This view outlines the most important issues as identified by the OWASP Top Ten (2021 version), providing product customers with a way of asking their software development teams to follow minimum expectations for secure code."},{"Type":"Educators","Description":"Since the OWASP Top Ten covers the most frequently encountered issues, this view can be used by educators as training material for students."}],"Members":[{"CweID":"1345","ViewID":"1344"},{"CweID":"1346","ViewID":"1344"},{"CweID":"1347","ViewID":"1344"},{"CweID":"1348","ViewID":"1344"},{"CweID":"1349","ViewID":"1344"},{"CweID":"1352","ViewID":"1344"},{"CweID":"1353","ViewID":"1344"},{"CweID":"1354","ViewID":"1344"},{"CweID":"1355","ViewID":"1344"},{"CweID":"1356","ViewID":"1344"}],"References":[{"ExternalReferenceID":"REF-1206"}],"MappingNotes":{"Usage":"Prohibited","Rationale":"This entry is a View. Views are not weaknesses and therefore inappropriate to describe the root causes of vulnerabilities.","Comments":"Use this View or other Views to search and navigate for the appropriate weakness.","Reasons":["View"]},"Notes":[{"Type":"Maintenance","Note":"As of CWE 4.6, the relationships in this view were pulled directly from the CWE mappings cited in the 2021 OWASP Top Ten. These mappings include categories and high-level weaknesses. One mapping to a deprecated entry was removed. The CWE Program will work with OWASP to improve these mappings, possibly requiring modifications to CWE itself."}],"ContentHistory":[{"Type":"Submission","SubmissionName":"CWE Content Team","SubmissionOrganization":"MITRE","SubmissionDate":"2021-10-05","SubmissionVersion":"4.6","SubmissionReleaseDate":"2021-10-28"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}