{"ID":"1223","Name":"Race Condition for Write-Once Attributes","Abstraction":"Base","Structure":"Simple","Status":"Incomplete","Description":"A write-once register in hardware design is programmable by an untrusted software component earlier than the trusted software component, resulting in a race condition issue.","ExtendedDescription":"\n\nIntegrated circuits and hardware IP software programmable controls and settings are commonly stored in register circuits. These register contents have to be initialized at hardware reset to defined default values that are hard coded in the hardware description language (HDL) code of the hardware unit. A common security protection method used to protect register settings from modification by software is to make them write-once. This means the hardware implementation only allows writing to such registers once, and they become read-only after having been written once by software. This is useful to allow initial boot software to configure systems settings to secure values while blocking runtime software from modifying such hardware settings.\n\n\nImplementation issues in hardware design of such controls can expose such registers to a race condition security flaw. For example, consider a hardware design that has two different software/firmware modules executing in parallel. One module is trusted (module A) and another is untrusted (module B). In this design it could be possible for Module B to send write cycles to the write-once register before Module A. Since the field is write-once the programmed value from Module A will be ignored and the pre-empted value programmed by Module B will be used by hardware.\n","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"362","ViewID":"1000","Ordinal":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Name":"Verilog","Prevalence":"Undetermined"},{"Type":"Language","Name":"VHDL","Prevalence":"Undetermined"},{"Type":"Technology","Class":"System on Chip","Prevalence":"Undetermined"}],"ModesOfIntroduction":[{"Phase":"Architecture and Design","Note":"This weakness can appear in designs that use register write-once attributes with two or more software/firmware modules with varying levels of trust executing in parallel."}],"CommonConsequences":[{"Scope":["Access Control"],"Impact":["Bypass Protection Mechanism"],"Note":"System configuration cannot be programmed in a secure way."}],"PotentialMitigations":[{"Phase":["Architecture and Design"],"Description":"During hardware design all register write-once or sticky fields must be evaluated for proper configuration."},{"Phase":["Testing"],"Description":"The testing phase should use automated tools to test that values are not reprogrammable and that write-once fields lock on writing zeros."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"consider the example design module system verilog code shown below. register_write_once_example module is an example of register that has a write-once field defined. Bit 0 field captures the write_once_status value."},{"Nature":"Bad","Language":"Verilog","ExampleCode":"module register_write_once_example\n (\n\n```\n\t input [15:0] Data_in,\n\t input Clk,\n\t input ip_resetn,\n\t input global_resetn,\n\t input write,\n\t output reg [15:0] Data_out\n );\n reg Write_once_status;\n always @(posedge Clk or negedge ip_resetn)\n if (~ip_resetn)\n\t begin\n\t\t Data_out \u003c= 16'h0000; \n\t\t Write_once_status \u003c= 1'b0;\n\t end\n else if (write \u0026 ~Write_once_status) \n\t begin\n\t\t Data_out \u003c= Data_in \u0026 16'hFFFE; // Input data written to register after masking bit 0\n\t\t Write_once_status \u003c= 1'b1; // Write once status set after first write.\n\t end\n else if (~write)\n\t begin\n\t\t Data_out[15:1] \u003c= Data_out[15:1];\n\t\t Data_out[0] \u003c= Write_once_status;\n\t end\n endmodule\n```"},{"BodyText":"The first system component that sends a write cycle to this register can program the value. This could result in a race condition security issue in the SoC design, if an untrusted agent is running in the system in parallel with the trusted component that is expected to program the register."},{"Nature":"Good","ExampleCode":"Trusted firmware or software trying to set the write-once field: \n\n  - Must confirm the Write_once_status (bit 0) value is zero, before programming register. If another agent has programmed the register before, then Write_once_status value will be one.\n\n  - After writing to the register, the trusted software can issue a read to confirm that the valid setting has been programmed."}]}],"RelatedAttackPatterns":["26"],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Base level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"ContentHistory":[{"Type":"Submission","SubmissionName":"Arun Kanuparthi, Hareesh Khattri, Parbati Kumar Manna, Narasimha Kumar V Mangipudi","SubmissionOrganization":"Intel Corporation","SubmissionDate":"2019-12-12"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2022-10-13","ModificationComment":"updated Demonstrative_Examples"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}