{"ID":"1239","Name":"Improper Zeroization of Hardware Register","Abstraction":"Variant","Structure":"Simple","Status":"Draft","Description":"The hardware product does not properly clear sensitive information from built-in registers when the user of the hardware block changes.","ExtendedDescription":"Hardware logic operates on data stored in registers local to the hardware block. Most hardware IPs, including cryptographic accelerators, rely on registers to buffer I/O, store intermediate values, and interface with software. The result of this is that sensitive information, such as passwords or encryption keys, can exist in locations not transparent to the user of the hardware logic. When a different entity obtains access to the IP due to a change in operating mode or conditions, the new entity can extract information belonging to the previous user if no mechanisms are in place to clear register contents. It is important to clear information stored in the hardware if a physical attack on the product is detected, or if the user of the hardware block changes. The process of clearing register contents in a hardware IP is referred to as zeroization in standards for cryptographic hardware modules such as FIPS-140-2 [REF-267].","RelatedWeaknesses":[{"Nature":"ChildOf","CweID":"226","ViewID":"1000","Ordinal":"Primary"},{"Nature":"ChildOf","CweID":"226","ViewID":"1194","Ordinal":"Primary"}],"ApplicablePlatforms":[{"Type":"Language","Class":"Not Language-Specific","Prevalence":"Undetermined"},{"Type":"Operating_System","Class":"Not OS-Specific","Prevalence":"Undetermined"},{"Type":"Architecture","Class":"Not Architecture-Specific","Prevalence":"Undetermined"},{"Type":"Technology","Class":"System on Chip","Prevalence":"Undetermined"}],"ModesOfIntroduction":[{"Phase":"Architecture and Design","Note":"Lack of hardware mechanisms to zeroize or clear registers in the design or specification."},{"Phase":"Implementation","Note":"Mechanisms to zeroize and clear registers are in the design but implemented incorrectly."},{"Phase":"Operation","Note":"Hardware-provided zeroization mechanisms are not used appropriately by the IP user (ex. firmware), or data remanence issues are not taken into account."}],"CommonConsequences":[{"Scope":["Confidentiality"],"Impact":["Varies by Context"],"Note":"The consequences will depend on the information disclosed due to the vulnerability."}],"PotentialMitigations":[{"Phase":["Architecture and Design"],"Description":"Every register potentially containing sensitive information must have a policy specifying how and when information is cleared, in addition to clarifying if it is the responsibility of the hardware logic or IP user to initiate the zeroization procedure at the appropriate time.","EffectivenessNotes":"Unfortunately, data disclosure can occur even after information has been overwritten/zeroized from the digital perspective. Physical characteristics of the memory can reveal the history of previously written data. For example, if the same value is written repeatedly to a memory location, the corresponding memory cells can become physically altered to a degree that even if the original data is erased it can still be recovered through physical characterization of the memory cells [REF-1055]."}],"DemonstrativeExamples":[{"Entries":[{"IntroText":"Suppose a hardware IP for implementing an encryption routine works as expected, but it leaves the intermediate results in some registers that can be accessed. Exactly why this access happens is immaterial - it might be unintentional or intentional, where the designer wanted a \"quick fix\" for something."}]}],"RelatedAttackPatterns":["150","204","37","545"],"MappingNotes":{"Usage":"Allowed","Rationale":"This CWE entry is at the Variant level of abstraction, which is a preferred level of abstraction for mapping to the root causes of vulnerabilities.","Comments":"Carefully read both the name and description to ensure that this mapping is an appropriate fit. Do not try to 'force' a mapping to a lower-level Base/Variant simply to comply with this preferred level of abstraction.","Reasons":["Acceptable-Use"]},"References":[{"ExternalReferenceID":"REF-267","Authors":["Information Technology Laboratory, National Institute of Standards and Technology"],"Title":"SECURITY REQUIREMENTS FOR CRYPTOGRAPHIC MODULES","PublicationYear":"2001","PublicationMonth":"05","PublicationDay":"25","URL":"https://csrc.nist.gov/csrc/media/publications/fips/140/2/final/documents/fips1402.pdf","URLDate":"2023-04-07"},{"ExternalReferenceID":"REF-1055","Authors":["Peter Gutmann"],"Title":"Data Remanence in Semiconductor Devices","Publication":"10th USENIX Security Symposium","PublicationYear":"2001","PublicationMonth":"08","URL":"https://www.usenix.org/legacy/events/sec01/full_papers/gutmann/gutmann.pdf"}],"ContentHistory":[{"Type":"Submission","SubmissionName":"Nicole Fern","SubmissionOrganization":"Tortuga Logic","SubmissionDate":"2020-02-08"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2020-08-20","ModificationComment":"updated Related_Attack_Patterns"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2021-10-28","ModificationComment":"updated Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-04-27","ModificationComment":"updated References, Relationships"},{"Type":"Modification","ModificationName":"CWE Content Team","ModificationOrganization":"MITRE","ModificationDate":"2023-06-29","ModificationComment":"updated Mapping_Notes"}]}